{
  "metadata": {
    "job_title": "seo_manager",
    "company": "amerisave_mortgage_corporation",
    "timestamp": "2024-12-30 18:48:51",
    "file_id": "26185"
  },
  "jobs": [
    {
      "job_title": "Director of Performance Marketing",
      "company": "AmeriSave Mortgage Corporation",
      "description": "About AmeriSave: AmeriSave Mortgage Corporation is a leading mortgage lender committed to providing exceptional service and innovative solutions to our customers. We are seeking a dynamic and experienced Director of Performance Marketing to lead our performance marketing efforts and drive sustainable growth. Job Description: As our Director of Performance Marketing, you will be responsible for developing and executing effective performance marketing strategies that drive customer acquisition, revenue growth, and maximize ROI. You will lead a team of marketing professionals and oversee all aspects of performance marketing, including paid search, social media advertising, affiliate marketing, and email marketing. Key Responsibilities: Performance Marketing Strategy: Develop and implement a comprehensive performance marketing strategy aligned with the company's business objectives. Campaign Management: Oversee the planning, execution, and optimization of performance marketing campaigns across various channels. Data Driven Decision Making: Utilize data analytics to measure marketing performance, optimize campaigns, and identify new opportunities. Budget Management: Manage the performance marketing budget effectively and optimize ROI. Team Leadership: Build, develop, and lead a high performing performance marketing team. Channel Optimization: Continuously optimize performance across all channels to maximize ROI. A/B Testing: Implement A/B testing to identify and optimize high performing marketing tactics. Qualifications: Bachelor's degree in marketing, business, or a related field. 5+ years of experience in performance marketing leadership roles, preferably in the financial services industry. Proven track record of driving significant growth through performance marketing campaigns. Deep understanding of digital marketing channels and technologies. Strong analytical skills and data driven decision making. Experience with marketing automation tools and CRM systems. Excellent leadership, communication, and interpersonal skills. **Please note that the compensation information that follows is a good faith estimate for this position only and is provided pursuant to the Colorado Equal Pay for Equal Work Act and Equal Pay Transparency Rules. It is estimated based on what a successful Colorado applicant might be paid. It assumes that the successful candidate will be in Colorado or perform the position from Colorado. Similar positions located outside of Colorado will not necessarily receive the same compensation. ** Compensation: Target annual compensation for this position is $125,000 – $300,000. Compensation commensurate with experience. Benefits: 401(k) Dental insurance Disability insurance Employee discounts Health insurance Life insurance Paid time off 12 paid holidays per year Paid training Referral program Vision insurance AmeriSave is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. California Consumer Privacy Act Disclosure Acknowledgment Employment Applicants, New Hires, and Employees Residing in California AmeriSave Mortgage Corporation’s Privacy Policy Statement (“Policy”) can be reviewed here: www.amerisave.com/privacy policy AmeriSave Mortgage Corporation’s California Consumer Privacy Act (“CCPA”) Recruitment Disclosure can be reviewed here: https://www.amerisave.com/ccpa recruitment disclosure/ When AmeriSave’s Human Resources Department makes future requests for personal information, the same Policy is applicable. By applying, you understand this acknowledgment covers current and future personal information requests. You also acknowledge the business purpose of the personal information collected and that future requests may occur while applying for a position at AmeriSave and/or during employment, if applicable. show less",
      "date_posted": "2024-12-30 14:46:05.164116",
      "location": "Detroit, MI",
      "remote": "Remote",
      "salary": "$125K/yr - $300K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4112134561/"
    },
    {
      "job_title": "Sr Marketing Science Analyst",
      "company": "State Farm",
      "description": "Overview Being good neighbors helping people, investing in our communities, and making the world a better place is who we are at State Farm. It is at the core of how we operate and the reason for our success. Come join a #1 team and do some good! Khakis optional. . . Starting Salary is $104,000 $139,500 annually. Because work life balance is a priority at State Farm, compensation is based on our standard 38:45 hour work week! Salary offered is dependent on skills and qualifications, with the high end of the range limited to applicants with significant relevant experience. Potential yearly incentive pay up to 15% of base salary. At State Farm, we offer more than just a paycheck. Check out our suite of benefits designed to give you the flexibility you need to take care of you and your family! Get Paid! On top of our competitive pay, you are eligible for an annual raise and bonus. Stay Well! Focus on you and your family’s health with our robust health and wellbeing programs. State Farm pays most of your healthcare premium, and we offer multiple healthcare plan options, including a high deductible plan. All medical plans provide 100% coverage for in network preventative care, AND you and your family have access to vision, dental, telemedicine, 24/7 mental health professionals, and much more! Develop and Grow! Take advantage of educational benefits like industry leading training programs, top notch tuition assistance programs, employee resource groups, and mentoring. Plan Ahead! Plan for those big moments in life with benefits like fertility/IVF/adoption assistance, college coaching, national discount programs, interactive monthly financial workshops, free financial coaching, and more. You can also start a savings account or consider financing through our State Farm Federal Credit Union! Take a Little “You” Time! You will have access to our generous time off policies designed so you can plan around holidays, family events, volunteering, or just to take a relaxing day off. With the opportunity to initially earn up to 20 days annually plus parental leave, paid holidays, celebration day, life leave (40 hours/year), bereavement leave, and community service/education support days, there will be plenty of time for you! Give Back! We offer several ways to give back through our Matching Gift Program, Good Neighbor Grant Program, and the Employee Assistance Fund. Finish Strong! Plan for retirement using free financial advisors and a 401(k) plan with company contributions of up to 7% of your salary. Visit our State Farm Careers page for more information on our benefits, locations, and the hiring process of joining the State Farm team! Remote: Qualified candidates (outside of hub locations listed below) may be considered for 100% remote work arrangements based on where a candidate currently resides or is currently located. Hybrid: Qualified candidates (in or near hub locations listed below) should plan to spend time working from home and some time working in the office as part of our hybrid work environment. Hub locations: Dunwoody, GA; Richardson, TX; Tempe, AZ; or Bloomington, IL Sponsorship: Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H 1B visa) for this opportunity. For Los Angeles candidates: Pursuant to the Los Angeles Fair Chance Initiative for Hiring, we will consider for employment qualified applicants with criminal histories. For San Francisco candidates: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. For Colorado, Hawaii and Washington State candidates: Salary Range: $114,400 $153,450 Application deadline is expected to close on 1/13/2025. Applicant volume and hiring needs may result in early closure or extension beyond the listed deadline. To submit an application, click \"Apply\" on the job listing page on the State Farm career site. For California, New York, and CT candidates: Potential salary range: $130,000 $174,375 Potential yearly incentive pay: up to 15% of base salary Competitive Benefits, including: 401k Plan Health Insurance Dental/Vision plans Life Insurance Paid Time Off Annual Merit Increase Tuition Reimbursement Health Initiatives Responsibilities For more details, visit our benefits summary page. The Sr Marketing Science Analyst is responsible for insights, optimization, experimental design & testing, measuring results, and recommendations within funnel tactics, with an emphasis on direct marketing (email, text, and direct) tactics. This role also includes a focus on identifying and leveraging AI/ML models to further improve tactic results. As a Sr Marketing Science Analyst you will get to: Work closely with business partners to define tactic goals and objectives Leverage data to derive insights and inform marketing tactic execution Utilize analytical and quantitative skills by using data and metrics to test theories, confirm assumptions, generate insights/recommendations, and measure success Compile, prepare, and translate complex data into concise reports and dashboards that provide insights and informs next step actions. Identify opportunities for increasing efficiency and consistency within work processes. Remain current on industry trends and brings forward opportunities for innovation. Mentor and lead other Marketing Science Analysts Qualifications Highly Desired: Ability to extract, manipulate and analyze large and complex sets of data to provide business insights across a broad range of needs and target audiences Experience conducting assessments of marketing performance Working knowledge of marketing models, other statistical techniques, and robust digital marketing acumen Experience producing reports and dashboards using business intelligence and visualization tools (e.g., Microsoft Excel, Tableau, QlikView, etc.) Ability to work effectively, both individually and as a member of a project team Ability to collaborate across departments, build relationships and present to a variety of audiences at all levels of the organization Familiar optimizing direct marketing (email, text, and direct) marketing KPIs and maximizing on ROI Additional Skills: Proficiency in SQL, Python, R, or SAS, or ability to readily acquire proficiency based on experience with comparable programming/querying languages Experience working across multiple computing platforms and operating systems, with an emphasis on AWS, but including other platforms as well (such as Hadoop or DB2) Experience mentoring and leading peers show less",
      "date_posted": "2024-12-30 17:46:25.108319",
      "location": "Tempe, AZ",
      "remote": "Onsite",
      "salary": "$104K/yr - $174.4K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4111067297/"
    },
    {
      "job_title": "Reporting & Analytics Director",
      "company": "U.S. Bank",
      "description": "At U.S. Bank, we’re on a journey to do our best. Helping the customers and businesses we serve to make better and smarter financial decisions and enabling the communities we support to grow and succeed. We believe it takes all of us to bring our shared ambition to life, and each person is unique in their potential. A career with U.S. Bank gives you a wide, ever growing range of opportunities to discover what makes you thrive at every stage of your career. Try new things, learn new skills and discover what you excel at—all from Day One. Job Description We are seeking a highly skilled and experienced Reporting and Analytics Leader to join our Sales, Credit and Servicing Center of Excellence. This role will partner closely with a variety of business lines and product teams to drive the evolution of both Salesforce and nCino reporting & analytics. This leadership role will be responsible for managing a team of reporting and analytics developers. Maintains and refines product backlog; creates user stories and acceptance criteria and prioritizes all stories to ensure work focuses on those with maximum business value that align with the overarching Reporting & Analytics strategy. Acts as primary liaison between the business and Agile teams, ensuring the teams understand vision for the products. Work closely in a hands on style with development team including addressing daily prioritization needs, providing real time feedback and answering questions on an ongoing basis. Works with Product Management to set release dates, determine when sufficient value has been delivered to release to market, understand tradeoffs between schedule, scope and budget and communicates this information to the organization. Employs product management practices and tactics including customer research, data and analytics, and market research. Basic Qualifications Bachelor's degree, or equivalent work experience Eight or more years of related experience Preferred Skills/Experience Management experience Salesforce & nCino experience and certifications SQL & Tableau knowledge Comfortable presenting and working with senior leaders Well developed ability to collaboratively develop and evolve a product backlog Well developed ability to develop and articulate a product vision that supports outcomes, value and prioritization of work Considerable understanding and demonstrated abilities in support of the Agile mindset Well developed verbal and written communication skills Proficient computer navigation skills Standard industry certifications such as SAFE, CSPO, or PSPO are preferred Hybrid/flexible schedule: The role offers a hybrid/flexible schedule, which means there's an in office expectation of 3 or more days per week and the flexibility to work outside the office location for the other days. If there’s anything we can do to accommodate a disability during any portion of the application or hiring process, please refer to our disability accommodations for applicants. Benefits: Our approach to benefits and total rewards considers our team members’ whole selves and what may be needed to thrive in and outside work. That's why our benefits are designed to help you and your family boost your health, protect your financial security and give you peace of mind. Our benefits include the following (some may vary based on role, location or hours): Healthcare (medical, dental, vision) Basic term and optional term life insurance Short term and long term disability Pregnancy disability and parental leave 401(k) and employer funded retirement plan Paid vacation (from two to five weeks depending on salary grade and tenure) Up to 11 paid holiday opportunities Adoption assistance Sick and Safe Leave accruals of one hour for every 30 worked, up to 80 hours per calendar year unless otherwise provided by law EEO is the Law U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors. Applicants can learn more about the company’s status as an equal opportunity employer by viewing the federal KNOW YOUR RIGHTS EEO poster. E Verify U.S. Bank participates in the U.S. Department of Homeland Security E Verify program in all facilities located in the United States and certain U.S. territories. The E Verify program is an Internet based employment eligibility verification system operated by the U.S. Citizenship and Immigration Services. Learn more about the E Verify program. The salary range reflects figures based on the primary location, which is listed first. The actual range for the role may differ based on the location of the role. In addition to salary, U.S. Bank offers a comprehensive benefits package, including incentive and recognition programs, equity stock purchase 401(k) contribution and pension (all benefits are subject to eligibility requirements). Pay Range: $149,515.00 $175,900.00 $193,490.00 U.S. Bank will consider qualified applicants with arrest or conviction records for employment. U.S. Bank conducts background checks consistent with applicable local laws, including the Los Angeles County Fair Chance Ordinance and the California Fair Chance Act as well as the San Francisco Fair Chance Ordinance. U.S. Bank is subject to, and conducts background checks consistent with the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA). In addition, certain positions may also be subject to the requirements of FINRA, NMLS registration, Reg Z, Reg G, OFAC, the NFA, the FCPA, the Bank Secrecy Act, the SAFE Act, and/or federal guidelines applicable to an agreement, such as those related to ethics, safety, or operational procedures. Applicants must be able to comply with U.S. Bank policies and procedures including the Code of Ethics and Business Conduct and related workplace conduct and safety policies. Job postings typically remain open for approximately 20 days of the posting date listed above, however the job posting may be closed earlier should it be determined the position is no longer required due to business need. Job postings in areas with a high volume of applicants, such as customer service, contact center, and Financial Crimes investigations, remain open for approximately 5 days of the posting listed date. show less",
      "date_posted": "NaT",
      "location": "Phoenix, AZ",
      "remote": "Director, Marketing Operations & Analytics (US or Canada Remote) with verification",
      "salary": "$149.5K/yr - $193.5K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4109392990/"
    },
    {
      "job_title": "VP, Demand Generation",
      "company": "Swooped",
      "description": "About The Role In the role of VP of Demand Generation, you will lead a team and create strategies to drive high quality demand that fills the sales pipeline, fostering business growth. You’ll define and target segments, design integrated marketing programs, and measure success to propel the organization forward. Success in this position will be evaluated based on achieving pipeline targets for both new business and expansion opportunities. Responsibilities **Demand Generation & Growth Strategy**: Oversee the overall strategy, program execution, and budget allocation for demand generation, focusing on consistent growth. **Integrated Campaign Management**: Lead the planning and execution of integrated demand generation initiatives, including account based marketing across channels such as email, paid media, SEO, lead nurturing, and more. **Sales Partnership**: Collaborate closely with Sales leadership to ensure the delivery of high quality leads and seamless follow up in alignment with established service level agreements. **Data Driven Campaign Optimization**: Own and manage analytics across all marketing platforms, monitor conversion rates, and continually optimize campaigns to maximize return on investment. **Cross Functional Collaboration**: Build and maintain strong working relationships with Sales, Sales Development, Sales Enablement, Revenue Operations, Customer Success, and Product teams to align demand generation efforts with broader company goals. Qualifications **Leadership Experience**: 5+ years of leadership in demand generation within a SaaS environment, with a proven ability to build and scale teams. **Digital Marketing Expertise**: 10+ years in digital marketing, with deep knowledge of driving demand through Salesforce and partner channels. **Proven Track Record**: Success in a fast paced, high growth startup environment with a hands on approach and the ability to adapt to changing demands. **Analytical Mindset**: Exceptional data analysis skills to guide strategy and inform impactful marketing decisions. Compensation $270K – $300K • includes performance related variable of approximately 10% **A leading firm is dedicated to helping the world’s fastest growing companies automate, simplify, and accelerate revenue.** show less",
      "date_posted": "2024-12-30 17:47:10.913708",
      "location": "United States",
      "remote": "Remote",
      "salary": "$270K/yr - $300K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4112967526/"
    },
    {
      "job_title": "Marketing Analytics Manager",
      "company": "Aston Carter",
      "description": "Job Title: Director of Marketing Insights Job Description This role is responsible for driving data driven strategies focused on end use consumer that inform and optimize marketing initiatives. This role analyzes market trends, consumer behavior, and competitive landscape to guide strategic decision making and identify trends to inform the product development pipeline. Responsibilities Analyze market trends, consumer behavior, and competitive landscape to guide strategic decisions. Design and implement processes and tools to effectively report and communicate market trends and impact. Develop and leverage data to make informed business market decisions and take smart risks. Extract market data and intelligence to design effective communication for all levels, including team members, leadership, and Board of Directors. Present materials for various audiences, including mill leaders and Board members. Collaborate with team members to achieve results oriented outcomes. Essential Skills Bachelor’s Degree in Business, Marketing, Economics, or a related function. Advanced Excel modeling techniques. Strong proficiency in data analysis tools. Exceptional communication skills (written and verbal). Ability to develop and leverage data for market analysis and trend identification. Confidence in influencing others to make forecasted business decisions. Additional Skills & Qualifications Master’s Degree preferred. 7+ years’ experience in marketing analytics/research, forecasting, or consumer insights. Experience in the paperboard or packaging industry preferred. Proven track record of using insights to drive business growth and improve marketing strategies. Deep understanding of consumer behavior, market trends, and competitive landscapes. Ability to present complex insights to non technical stakeholders. Work Environment The Director of Marketing Insights reports to the VP of Market Strategy and Development and is a member of the Commercial team. This is a four person team, all individual contributors. The role is a functional director level position, meaning the individual will still be an individual contributor, but will be expected to coach, teach, and mentor due to the level of experience required. Pay and Benefits The pay range for this position is $174000.00 $174000.00 Healthcare, Dental, and Vision programs (eligibility begins on 31st day of employment) Company Paid Life Insurance 401K with Company Match Paid Time Off including 15 days of vacation, 9 paid designated holidays, 40 hours paid floating holidays (prorated based on start date) Matching Gift Program More information on these programs will be provided to you at any time upon your request or on your start date. Clearwater Paper reserves the right to prospectively modify or terminate any of its benefits plans or programs at any time and for any reason, to the extent permitted by applicable law. Workplace Type This is a fully remote position. Application Deadline This position will be accepting applications until Dec 31, 2024. About Aston Carter Aston Carter provides world class corporate talent solutions to thousands of clients across the globe. Specialized in accounting, finance, human resources, talent acquisition, procurement, supply chain and select administrative professions, we extend the capabilities of industry leading companies. We draw on our deep recruiting expertise and expansive network to meet the evolving needs of our clients and talent community with agility and excellence. With offices across the U.S., Canada, Asia Pacific and Europe, Aston Carter serves many of the Fortune 500. We are proud to be a ClearlyRated Best of Staffing® double diamond winner for both client and talent service. Diversity, Equity & Inclusion At Aston Carter, Diversity And Inclusion Are a Bridge Towards The Equity And Success Of Our People. DE&I Are Embedded Into Our Culture Through Hiring diverse talent Maintaining an inclusive environment through persistent self reflection Building a culture of care, engagement, and recognition with clear outcomes Ensuring growth opportunities for our people The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law. If you would like to request a reasonable accommodation, such as the modification or adjustment of the job application process or interviewing process due to a disability, please email astoncarteraccommodation@astoncarter.com for other accommodation options. show less",
      "date_posted": "NaT",
      "location": "Spokane, WA",
      "remote": "Remote",
      "salary": "$174K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4107293940/"
    },
    {
      "job_title": "Lead Product Manager, Performance Marketing",
      "company": "Jobs via Dice",
      "description": "Job Description Job Description We offer a hybrid work environment. Most US based positions can also be performed remotely (any exceptions will be noted in the Minimum Qualifications below.) Our Mission: To actively connect people to their next great opportunity. Who We Are: ZipRecruiter is a leading online employment marketplace. Powered by AI driven smart matching technology, the company actively connects millions of all sized businesses and job seekers through innovative mobile, web, and email services, as well as through partnerships with the best job boards on the web. ZipRecruiter has the #1 rated job search app on iOS & Android. Summary: As the Senior Product Manager for Performance Marketing, you will be responsible for the development, optimization, and launch of back end systems, APIs, and data products aimed at improving and tracking the outcomes of our Enterprise customers' (employers') job advertising campaigns. Your work will directly improve customer satisfaction, retention, and generate revenue. Key Focuses: Lead the ideation of improvements to our ad technology platform, campaign management tools, and external facing campaign management APIs Work collaboratively and cross functionally with Executive, Product, Engineering, Analytics, Biz Dev, Sales, and Marketing teams to prioritize, launch, and operationalize new features and products Deeply understand our Enterprise customer segments and needs, as well as our internal teams needs, to inform product decisions and strategy Be an internal advocate, educator, and communicator about the products you own Write specs, manage execution, and define product rollout strategy and communications Own your team's planning process and roadmap, proactively communicate learnings, advocate for new features, and write documentation for technical and non technical audiences Minimum Qualifications: 4+ years Product Management experience You can write a basic SQL query and arent afraid to dive into data to make decisions and assess impact Fundamental knowledge of Performance Marketing metrics (ex. CTR, CVR, ROI, CPC, CPA, etc.) Business level understanding of technical concepts such as APIs, relational databases, data formats (ex. CSV, XML, JSON, etc.) Preferred Qualifications: Experience working on AdTech/MarTech, AI/ML, Big Data, or two sided marketplace products SaaS Product experience, specifically in an Enterprise or B2B offering Experience as a product manager developing backend products such as APIs or data products As part of our team youll enjoy: Competitive salary Exceptional benefits package Flexible Vacation & Paid Time Off Employer matched 401(k) plan The US base salary range for this full time position is $192,500 $255,000. Our salary ranges are determined by role, level, and location, and the range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location, role related knowledge and skills, depth of experience, relevant education or training, and additional role related considerations. Depending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits. ZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics. Privacy Notice: For information about ZipRecruiter's collection and processing of job applicant personal data for this job, please see our Privacy Notice at: https://www.ziprecruiter.com/careers/job applicant privacy notice Company Description ZipRecruiter is the fastest growing employment marketplace. We have helped over 1 million businesses and 100 million job seekers find their next perfect match through partnerships with the best job boards on the web, curated email alerts, award winning mobile apps, and the world s best search algorithm for jobs. Company Description ZipRecruiter is the fastest growing employment marketplace. We have helped over 1 million businesses and 100 million job seekers find their next perfect match through partnerships with the best job boards on the web, curated email alerts, award winning mobile apps, and the world s best search algorithm for jobs. show less",
      "date_posted": "NaT",
      "location": "Santa Monica, CA",
      "remote": "Remote",
      "salary": "$192.5K/yr - $255K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4110735108/"
    },
    {
      "job_title": "Principal SEO Strategist",
      "company": "Demand.io",
      "description": "Quick overview Shape the future of e commerce search by combining deep technical SEO expertise with cutting edge AI innovation. As our Principal SEO Strategist, you'll leverage your strong technical foundation to pioneer new approaches for both traditional and emerging search platforms. This role is ideal for a technical SEO expert who is passionate about using AI to transform how we approach search optimization and discovery. The challenge We're looking for someone who can bridge deep technical SEO knowledge with emerging AI capabilities to solve complex challenges in search. You'll need to: Architect sophisticated technical SEO implementations that can scale across millions of pages Pioneer new approaches for AI driven search experiences and emerging platforms Use AI to accelerate and enhance traditional SEO workflows Design optimization strategies for conversational search and AI generated results Lead our adaptation to major algorithm updates and industry shifts Create frameworks for semantic search optimization Build predictive models for search performance across platforms About Demand.io Demand.io is revolutionizing e commerce through AI driven platforms powered by ShopGraph, our proprietary knowledge graph. Founded in 2009, we're profitable and growing rapidly with: SimplyCodes: AI and community powered savings platform covering 400,000+ stores Product.ai: AI shopping assistant redefining online purchasing ShopGraph: Comprehensive e commerce knowledge graph powering our platforms $1B+ annual e commerce transaction volume The opportunity Working directly with our founder and senior leadership, you'll: Drive technical SEO excellence while pioneering AI innovations in search Architect next generation approaches to search optimization Transform traditional SEO workflows through AI acceleration Shape our response to the evolution of search across platforms Lead technical implementation of sophisticated SEO strategies Build and mentor a forward thinking SEO team What you'll do First 30 days: Deep dive into our technical SEO infrastructure Analyze our current search presence across traditional and AI platforms Audit our technical optimization approaches Start developing AI enhanced SEO workflows First 60 days: Present comprehensive technical SEO strategy incorporating AI innovation Launch initial AI accelerated optimization processes Begin experimentation with emerging search platforms Establish frameworks for measuring success across channels First 6 months: Implement sophisticated technical SEO improvements at scale Drive measurable improvements in search performance Pioneer new approaches for emerging search platforms Build predictive models for search optimization Create scalable systems for technical SEO automation Demonstrate clear business impact through organic growth About you Must haves: 8+ years of technical SEO experience Deep expertise in technical SEO fundamentals: JavaScript rendering and optimization Core Web Vitals Schema markup and structured data Site architecture and crawlability Large scale SEO implementation Experience using AI to enhance SEO workflows Strong understanding of search algorithm dynamics Track record of driving significant organic growth Excellence in data analysis and experimentation Nice to haves: Experience with conversational search optimization Knowledge of emerging search platforms Background in e commerce optimization Familiarity with LLM behavior and optimization Experience with knowledge graphs Background in programming or engineering Our technical environment Tools you'll use: Advanced SEO and analytics platforms AI tools for workflow acceleration Natural language processing systems Multi platform search monitoring tools Knowledge graph management systems Custom internal tools and dashboards Modern web frameworks and technologies Development practices: AI accelerated workflows Continuous experimentation Data driven decision making Rapid prototyping and testing Growth opportunity As a key leader at Demand.io, you'll have: Opportunity to define the future of AI driven search Access to cutting edge AI tools and technologies Clear path to building and leading a team Significant impact on company strategy Platform to pioneer new search approaches Our engineering culture Deep generalists who solve hard problems Strong bias towards action and shipping Minimize process and maximize impact Collaborate closely across teams Work primarily from our Santa Monica office Invest heavily in learning and growth Creating wealth through innovation We've reimagined tech compensation for elite talent. Unlike traditional tech compensation heavily weighted toward RSUs or illiquid equity, we provide substantial immediate wealth creation through monthly cash payments. Foundation: Base: $160,000 $220,000 Equity: 0.2% 0.5% Partners Program: Substantial monthly profit sharing bonuses Top performers achieve total compensation of $300,000 $500,000+ annually through our unique Partners Program. Key advantages: Monthly cash payments (not annual or deferred bonuses) Immediate wealth creation (vs locked RSUs) Uncapped earning potential No lockup periods or liquidity events required Increasing bonus percentages as you advance through Partner levels Additional benefits: Partners Program with uncapped earning potential Learning stipend for conferences and courses Access to cutting edge AI tools and research 100% coverage of health benefits for you and dependents Unlimited PTO Generous parental leave 401(k) program Catered lunches in our Santa Monica office Relocation assistance available Ready to combine technical SEO expertise with AI innovation? If you're excited about leveraging deep technical SEO knowledge to pioneer new approaches to search while using AI to transform how we work, we want to hear from you. Learn more about our products, our team, and our unique culture at Demand.io. show less",
      "date_posted": "NaT",
      "location": "Los Angeles Metropolitan Area",
      "remote": "Onsite",
      "salary": "$160K/yr - $220K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4108184888/"
    },
    {
      "job_title": "Director of Marketing",
      "company": "Intuitive.Cloud",
      "description": "About us: Intuitive.Cloud is one of the fastest growing (INC 5000, CRN) Cloud & SDx solution and services companies supporting enterprise customers on a global scale. Intuitive is an \"Engineering Company\" delivering measurable value and key business outcomes. Intuitive Superpowers: DataOps & AI/ML Cloud Native, AppSecOps, DevSecOps Cloud Migration & Transformation Cloud FinOps Cybersecurity (App/Data/Infra) & GRC SDx & Digital Workspace We are proud to partner with some of the world's leading enterprises and serve 200+ customers across different industry verticals. We have achieved many milestones along the way, including being recognized as a top 10 fast growth 150 IT company in the Americas by CRN in 2022 and being named one of America's fastest growing private companies by INC 5000 in 2022. That’s not all! Even CIO Review awarded us as the Most Promising Cloud Migration Company and Artificial Intelligence Solutions Provider in 2022. About the job: Title – Director of Marketing Start date: Immediate Position Type: Full Time Location: Remote across USA Role Overview: Sr. Director of Manager is a key player in driving the company's marketing strategy and execution. This role requires a passion for marketing and cloud technologies, with a focus on developing and executing strategies that promote Intuitive's brand growth and drive market share. The Sr. Marketing Director will report to the Chief Alliance & Marketing Officer and be a key stakeholder in designing and implementing the overall marketing strategy, including all areas of partner marketing. We are looking for a seasoned marketing leader with entrepreneurial spirit who will make a real impact on our growing business through proven experience of running all aspects of marketing at a fast growing cloud consulting/SaaS company. The role requires a blend of creativity and analytical skills with full accountability for managing integrated campaigns, events, marketing assets, digital presence, and partner marketing initiatives across multiple channels. Responsibilities: Integrated Campaigns: Develop, oversee, and measure the execution of multi channel marketing campaigns, including digital marketing, social media, content marketing, and live events. Customer Demand Generation: Partner with sales and technical teams to design and drive demand generation initiatives through targeted marketing programs aimed at generating leads and nurturing prospects. Content: Collaborate with technical teams, digital agencies, alliance, and sales teams to create engaging high quality original marketing content, including messaging, nurture emails, website content, blogs, pitch decks, sell sheets, webinars, videos social media content, and customer testimonials, etc. Design: Create professional modern looking collateral, source freelancers, and select vendors to develop creative concepts that enhance content Digital Marketing: Lead digital marketing strategy concentrating on promoting the Intuitive brand, services, and offerings across multiple digital platforms. Partner Marketing & Demand Generation: Develop strong working relations with outside partner marketing teams (AWS, GCP, IBM, Azure, Palo Alto, Databricks, etc.); together with Alliance team, secure participation in key partner programs, maximize MDF, jointly design and manage demand generation activities to generate leads in the areas of data governance, AI, security, application modernization, migrations, etc. Brand Visibility: Lead the implementation of marketing strategies to enhance brand visibility across all Intuitive partners, manage social media, and company website. Events: Plan and execute scalable, value add partner and customer events that create speaking opportunities and new customer connections; engage partners and customers across multiple personas/roles; organize industry trade shows and conferences; CXO roundtables; partner events, user groups, and more. Website and SEO: Oversee the company's website, optimizing its content and technical aspects to improve its ranking on search engines through SEO strategies and drive more organic traffic. Work with the selected agency to regularly review and update the website content and ensure site optimal functionality. Team Leadership & Vendor Management: Build and lead a team of marketing specialists, manage and coach free lancers, digital agencies, and other team members to efficiently execute all aspects of marketing. Qualifications: Bachelor’s degree in marketing, Communications, Business Administration, or related fields. 10+ years of marketing experience, with a strong background in partner marketing, digital marketing, content creation and social media management at a B2B tech space (technical services consulting companies preferred) Experience in selecting and working with digital marketing agencies, content writers, and marketing freelancers; experience in building and managing a marketing team. Proficiency in marketing automation tools, CRM systems, and customer outreach platforms such as HubSpot, ZoomInfo, etc. Strong understanding of SEO and Google Analytics; knowledge of website analytics tools like Google Analytics Basic website editing experience; understanding of HTML, CSS, and basic website development concepts. An understanding of cloud and data partnerships (Amazon Web Services, Microsoft Azure, Google Cloud, IBM), Business Intelligence, Data Science, and Data Governance Ability to edit and revise marketing content for grammar, content structure, and overall quality. Basic graphic design skills to edit collateral (customer decks, one pagers, etc.) and basic video editing skills (i.e., Canva, Adobe Rush or Premier) Excellent communication skills, with the ability to articulate marketing strategies and collaborate effectively with sales and technical teams. High degree of initiative, independence, adeptness at managing multiple tasks in a fast paced environment Location: This position is 100% remote; some travel may be required (up to 20%) travel show less",
      "date_posted": "2024-12-30 13:48:51.578025",
      "location": "United States",
      "remote": "Remote",
      "salary": "Remote\nMatches your job preferences, workplace type is Remote.",
      "job_url": "https://www.linkedin.com/jobs/view/4112135171/"
    }
  ]
}