{
  "metadata": {
    "job_title": "head_of_marketing",
    "company": "ecocart",
    "timestamp": "2024-12-31 15:53:33",
    "file_id": "60262"
  },
  "jobs": [
    {
      "job_title": "Head of Marketing",
      "company": "EcoCart",
      "description": "EcoCart is a leading post purchase CX platform for ecom brands. We partner with brands to meet their post purchase & sustainability goals by powering package protection, issue resolution, and carbon offsetting. We are powering peace of mind for shoppers, which builds trust and boosts repeat purchase rates and CLTV. We are a 20 person, remote first company looking for people who are motivated by being part of a team building products that will help change the world. We're growing quickly, and want you to grow with us. EcoCart is currently only hiring folks based in the United States or Canada. The Opportunity 💻 EcoCart is seeking a dynamic and innovative Head of Growth Marketing to lead our growth initiatives for new product expansions and drive our customer acquisition strategy. The ideal candidate will have a proven track record in scaling marketing efforts and driving sales pipeline, a deep understanding of digital marketing channels, and a passion for helping e commerce brands. Salary Range: $140,000 $160,000 base (OTE $200k+) A day in the life ☀️ Strategy Development: Develop and execute a comprehensive growth marketing strategy to achieve company objectives. Your mission: Drive a massive amount of pipeline, quickly and efficiently—no excuses, just results. Constraints will be your fuel for creativity, pushing you to find growth in unexpected places Campaign Management: Oversee the creation, implementation, and optimization of multi channel marketing campaigns (email, social media, search, display, content, etc.). Leverage data and analytics to measure campaign performance and iterate for continuous improvement Team Leadership: Lead and mentor a high performing marketing team, fostering a culture of creativity and accountability. Collaborate with cross functional teams (product, sales, customer success) to align marketing efforts with business goals Brand Building: Enhance EcoCart's brand presence and awareness through innovative marketing initiatives. Ensure consistent messaging and branding across all marketing channels and materials DTC Experience: You’ll leverage your expertise in marketing to eCommerce brands, direct to consumer brands, or SaaS marketing for online retail to drive impact. Understanding the nuances of these markets is essential to your success Growth Mindset: Embrace a test and learn approach. Experiment, iterate, and optimize constantly to stay ahead. You know what works today might not work tomorrow, and you thrive on figuring it out Minimum Requirements Demonstrated success running marketing and/or growth at a small startup company Experience setting up marketing and growth infrastructure (such as paid ads, automated outbound, and CRM systems) Knowledge of how to successfully A/B test top of funnel strategies and quickly optimize Startup experience Preferred Qualifications Experience managing Hubspot Experience within the ecommerce ecosystem, especially Shopify Experience with creating and iterating on brand identity Benefits 🤩 Series A Equity Think like an owner, be an owner Unlimited PTO Take the time you need to perform at your best Paid parental leave Up to 10 weeks fully paid Flexible hours Work when you want Remote first environment Work where you want Best of the best options for medical, dental, & vision insurance Paid 100% by the company 401(k) Mental health benefits Free membership to TalkSpace with availability for other providers Life insurance show less",
      "date_posted": null,
      "location": "Lehi, UT",
      "remote": "Remote",
      "salary": "$140K/yr - $200K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4030984736/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "UpCodes",
      "description": "About Us Trusted by 800,000 monthly active users, UpCodes (YC S17) is a comprehensive compliance and product research platform that accelerates design to construction in the AEC space. The construction industry suffers from unnecessary costs and complexity; every year billions of dollars are wasted on rework. We’re committed to delivering easy to use tools that help designers and builders spend less time finding the right compliance and product resources and more time doing what they love — designing and building. We make a real world tangible impact on the lives of our users and their work of constructing our homes, schools, hospitals, and offices. About The Role Historically we’ve primarily invested in R&D to build a healthy foundation of product market fit before building out Sales & Marketing. However, we are now reaching an inflection point where we want to invest much more on the GTM side. As part of this expansion, we’re looking for a Head of Marketing to translate top level company goals to marketing strategies, tactics, and investments for achieving our goals. As Head of Marketing, you’ll collaborate closely with the CEO, playing a pivotal role in maintaining our competitive edge as we continue to grow as a compound startup. You will not only develop the strategy across all marketing functions but oversee the projects and teams. You will work closely with cross functional partners across Product, Sales, and Engineering to ensure we are driving healthy growth across both our self serve and sales led sides of the business. You'll find that we have a very open, collaborative environment where we encourage debate and input from lots of stakeholders. Lastly, you will have resources to create, grow, and develop a team to achieve our shared goals. What You’ll Do As a Head of Marketing, you’ll have a direct and significant impact on how we go to market and the company's future. At UpCodes, you’ll be responsible for… Marketing Strategy: Work backwards from company priorities to create the roadmap and goals across the Marketing team. Team Leadership: Plan, build, lead, and mentor a high performing marketing team, ensuring alignment with cross functional teams such as Sales, Customer Success, & Marketing. Messaging and positioning: Guide the team to continue developing the messaging from the product lines to our diverse range of users. Develop and Execute Multi Channel Campaigns: Oversee integrated marketing campaigns across various digital channels such as email, paid media, social media, and SEO. Lead Generation: Oversee demand generation strategies to create consistent, high quality pipeline growth for the sales team. Sales Collaboration: Partner with sales leadership to ensure marketing programs are aligned with sales goals, deliver qualified leads, and improve lead to close conversion rates. Plus, at UpCodes we value: Working cross functionally with our talented and motivated team: We believe the best solutions come from the exchange of various perspectives, so we’ll want to harness this collective wisdom to drive the product forward and execute our product strategy. You’ll work with our subject matter experts to understand the industry's challenges and translate them into user value. You’ll connect with users through user interviews and attend sales meetings Expert communication and documentation: We’re a fully distributed, remote team with an async culture, which means that in order to be successful, we need to be able to communicate efficiently in writing. Whether it’s a project brief, launch plan, Slack message, we ensure every decision is documented. THE IDEAL CANDIDATE Experience in marketing: Over 7+ years of marketing experience in a B2B startup or tech company, including 3+ years in a managerial role. Proven track record of leading and scaling teams of 8+ members Have experience with crafting, iterating, and testing end user messaging Have experience bringing new products to market Have experience with growth, demand generation, or PMM Data driven: You use data to set the right objectives and find the most effective solutions. Your decisions are backed by clear, defendable reasoning, but you also appreciate the role of intuition and conviction. Open to feedback: You’re good at managing feedback and using it as a driving force for your work. You thrive in a fast paced environment, handling multiple initiatives and perspectives simultaneously while maintaining an optimistic outlook. You're open minded and not afraid to learn through trial and error. You sweat the small stuff: As a detail oriented person, you raise the team's standards for quality and attention to detail. Compensation Range: $140K $260K show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$140K/yr - $260K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4069166515/"
    },
    {
      "job_title": "Director, Head of Marketing Automation",
      "company": "John Hancock",
      "description": "Manulife/John Hancock is on a journey to become a customer obsessed digital leader. As part of this journey, we are looking for a skilled professional and natural leader to drive the optimization and growth of John Hancock’s outbound marketing technology platforms to provide exceptional digital first experiences to our customers. The Director and Head of Marketing Automation will lead a team of specialists to foster and nurture partnerships with marketing teams across Insurance, Long Term Care and Annuities to understand their unique business objectives, targeted outcomes, and key results. Key areas of focus will be to create digital marketing strategies that drive tailored customer journeys, raise brand awareness, generate leads, and foster brand loyalty and engagement. Collaborating with MarTech strategists and enablement professionals to translate business requirements into technical solutions and build audience strategy and personalization. Additionally, the team collaborates with global colleagues and vendor partners to facilitate continued education and upskilling in marketing technology. This role requires strong partnerships and continual collaboration across a matrixed organization, specifically with the Global Performance Marketing Shared Services and Global Data & Technology teams, which will lead audience strategy, personalization, activation, automation, and support. The Director will work closely with cross functional teams, including marketing, IT, sales, and external vendors, to drive innovation and maximize the return on investment (ROI) of MarTech initiatives. Key Responsibilities Lead the Automation & Performance Marketing team, creating a center of practice to support John Hancock’s outbound marketing technology platforms and digital engagement activities Enabling a full funnel approach designed to drive tailored customer journeys powered by connected data, that when integrated raises brand awareness, drives quality traffic, generates leads, secures sales, and fosters brand loyalty. Lead the team responsible for understanding the business requirements and use cases, identifying the required integrations, translating them into implementable technical solutions with the assistance of technology teams, and building audience strategy, personalization, and activation of the use cases. Ensure the team empowers and supports business partners to create digital marketing strategies leveraging customer centric omnichannel journeys (email, web, push, deep linking, SMS, and beyond) to achieve their business goals. Provide specialized support and leadership as it relates to ensuring clear workflows, intake, prioritization, resource management and reporting in addition to content creation, sharing and activation to improve digital journeys, team building, change management, and quality assurance. Scaling and growing the journey design practice across John Hancock Marketing by providing coaching and guidance in marketing technology best practices, digital governance, and frequency capping Partner with Advanced Analytics for the exploration of new models and opportunities for increased personalization and dynamic content; identify opportunities to leverage emerging technologies such as generative AI and machine learning to drive personalization at scale. Collaborate with vendor partners to design and facilitate continued education and upskilling for marketing technology to ensure the team remains at the forefront of innovation and new capabilities. Qualifications Education: Bachelor’s degree in Marketing, Business, Computer Science, or a related field. Experience: 7 10 years of experience in marketing technology, digital marketing, or related fields, with at least 3 5 years in a leadership role. Technical Proficiency: Deep understanding of various MarTech tools and platforms (e.g., Adobe, CRM, marketing automation, analytics, content management systems). Analytical Skills: Strong analytical skills to interpret data and generate actionable insights. Experience with analytics tools (e.g., Google Analytics, Tableau). Project Management: Excellent project management skills to handle multiple projects and implementations simultaneously. Strong organizational skills and attention to detail. Communication Skills: Effective communication skills to articulate complex technical concepts to non technical stakeholders. Ability to present information clearly and concisely. Leadership: Proven leadership skills to guide and motivate cross functional teams. Ability to manage and resolve conflicts, fostering a collaborative team environment. Problem Solving: Strong problem solving skills to address technical challenges and optimize MarTech tools. Creativity in finding innovative solutions. About Manulife And John Hancock Manulife Financial Corporation is a leading international financial services provider, helping people make their decisions easier and lives better. To learn more about us, visit https://www.manulife.com/en/about/our story.html. Manulife is an Equal Opportunity Employer At Manulife/John Hancock, we embrace our diversity. We strive to attract, develop and retain a workforce that is as diverse as the customers we serve and to foster an inclusive work environment that embraces the strength of cultures and individuals. We are committed to fair recruitment, retention, advancement and compensation, and we administer all of our practices and programs without discrimination on the basis of race, ancestry, place of origin, colour, ethnic origin, citizenship, religion or religious beliefs, creed, sex (including pregnancy and pregnancy related conditions), sexual orientation, genetic characteristics, veteran status, gender identity, gender expression, age, marital status, family status, disability, or any other ground protected by applicable law. It is our priority to remove barriers to provide equal access to employment. A Human Resources representative will work with applicants who request a reasonable accommodation during the application process. All information shared during the accommodation request process will be stored and used in a manner that is consistent with applicable laws and Manulife/John Hancock policies. To request a reasonable accommodation in the application process, contact recruitment@manulife.com. Primary Location Boston, Massachusetts Working Arrangement Hybrid Salary range is expected to be between $114,975.00 USD $206,955.00 USD If you are applying for this role outside of the primary location, please contact recruitment@manulife.com for the salary range for your location. The actual salary will vary depending on local market conditions, geography and relevant job related factors such as knowledge, skills, qualifications, experience, and education/training. Employees also have the opportunity to participate in incentive programs and earn incentive compensation tied to business and individual performance. Manulife/John Hancock offers eligible employees a wide array of customizable benefits, including health, dental, mental health, vision, short and long term disability, life and AD&D insurance coverage, adoption/surrogacy and wellness benefits, and employee/family assistance plans. We also offer eligible employees various retirement savings plans (including pension/401(k) savings plans and a global share ownership plan with employer matching contributions) and financial education and counseling resources. Our generous paid time off program in the U.S. includes up to 11 paid holidays, 3 personal days, 150 hours of vacation, and 40 hours of sick time (or more where required by law) each year, and we offer the full range of statutory leaves of absence. Know Your Rights I Family & Medical Leave I Employee Polygraph Protection I Right to Work I E Verify I Pay Transparency Company: John Hancock Life Insurance Company (U.S.A.) show less",
      "date_posted": null,
      "location": "Boston, MA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$115K/yr - $207K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4093061354/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Dallas, TX",
      "remote": "Remote",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098052849/"
    },
    {
      "job_title": "Head of Marketing - Digital Health / SaaS / AI / Startup",
      "company": "Sales Talent Inc.",
      "description": "A fast growing seed start up is hiring a Head of Marketing to lead all Marketing efforts. The company is disrupting the market with a SaaS, AI powered ground breaking solution targeting healthcare systems. It is backed by two leading Israeli VCs with a reputation for investing in unicorns. To be considered, you must be a full stack b2b marketer, who has experience owning marketing in a startup environment (preferably Seed/Series A experience). This role oversees all marketing efforts, focusing on product marketing and demand generation to support growth. Responsibilities include refining messaging, demonstrating ROI, and driving lead generation through targeted strategies and speaking opportunities. The role also involves managing the SDR team, as well as external agencies, and updating the brand strategy for a new product category. The ideal candidate will experiment, adapt, and adjust strategies to ensure success. This is an opportunity to build marketing from the ground up, combining strategic oversight with hands on execution. Growth: On track for 4–5x growth this year, with another 4x revenue growth projected next year. Performance Metrics: Achieving a 1/3 lead to close rate with clear product market fit, 0% churn, and 90% active user engagement within six months of onboarding. Clients: Brigham and Women’s Hospital (Harvard Medical School), UCSF Medical Center, Cedars Sinai Medical Center, and Columbia University Irving Medical Center. Compensation and Benefits: Salary: $150k 180k + 15% Bonus. Equity. Comprehensive Insurance: Medical, dental, and vision coverage. Retirement Planning: 401(k) available, with plans to introduce employer contributions soon. Flexible Time Off: Unlimited PTO to support work life balance. Hardest part of the job? Startups thrive on solving problem after problem, and success requires smart, curious problem solvers who uncover user value and adapt quickly. In a disruptive startup creating a new product category, there are no playbooks—critical thinking and adaptability are essential. With rare product market fit achieved, we need someone to scale our foundation by rolling up their sleeves and driving growth in uncharted territory. The Right Background: Must be a full stack b2b marketer with proven experience in startup environment, preferably as the 1st marketing person in the organization. B2B SaaS or B2B healthcare experience. Excellent problem solving skills with track record of using data driven approaches to solve complex business problems. Proven track record of driving demand in complex sales cycles targeting enterprise customers. Proven track record of building a product marketing strategy. Comfortable in a fast paced environment that requires adaptability. Strong understanding of digital marketing strategies and tools (HubSpot, Google Analytics, LinkedIn Ads, etc.). show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Remote",
      "salary": "$150K/yr - $180K/yr + Bonus\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4106254685/"
    },
    {
      "job_title": "Head of Marketing at Fella & Delilah — Remote, $150k-$300k/yr + 0.3%-1.0%",
      "company": "Fella & Delilah",
      "description": "About Fella & Delilah Fella & Delilah is the telehealth clinic for busy working families in Middle America to get to a healthier weight. Fella is optimized for busy bigger guys who want a no nonsense solution to getting healthier. Delilah is built for strong women in their prime who want a sustainable solution to feel their best. We use affordable, effective weight loss medication to solve our customers’ most pressing healthcare need, then aim to remain their core healthcare provider for the rest of their life — expanding to hormonal health, mental health, longevity, and primary care. GLP 1s are a f*ing big deal. We’re in a remarkable & rapid period of change which will radically reshape the patient & cash flows in the healthcare system. Our mission is to accelerate the global take up of GLP 1s among busy, working families to solve obesity worldwide. From this, we’ll become the world’s leading consumer healthcare brand. We’ve grown >1000x since Aug 2021, >200x since Aug 2022, >20x since Aug 2023. We’ve just surpassed $30M ARR. As a company, we’ve been cashflow positive for the last 18mo. We’re fast approaching 10,000 active customers with high NPS. Almost all of this has so far been through Fella. Delilah is still very new and your job is to make her soar. We’re a young startup and we’re just getting started. This is still Day 1 and all our work is ahead of us. You can read more about working at Fella & Delilah here: Working at Fella & Delilah https://fella.notion.site/Working at Fella Delilah 14a2ac8575d34d148d009bb410387af4 We're Backed By Top Healthcare & Consumer Investors Y Combinator Global Founders Capital — backed Facebook, Slack, LinkedIn, Revolut, Rocket Internet AngelList Early Stage Fund (backed by Naval Ravikant) BrandProject (venture builder behind 2 unicorns) The founders of Indeed, Curative (unicorn), Alan (unicorn), Kaia Health (>$300mil valuation), Vouch Insurance (>$500mil valuation), Not Boring (Packy McCormick) The opportunity as Head of Marketing We’re building a world class team. As Head of Marketing at Fella & Delilah, your fundamental role is to nail a profitable growth machine so we can grow ~5% WoW, every week. I expect 10x growth in 2025. You’ll lead a team which is rapidly scaling a robust, low CAC growth engine that adapts to market changes. Our growth strategy must remain at the frontier of the rapidly changing consumer obesity market and we need an A* team to execute. You’ll lead us to 100k customers and beyond. Since our launch in June 2021, Fella positioned itself as the telemedicine clinic for busy, bigger guys to live 10 years longer. We’ve recently launched a female focused partner brand: Delilah is built for strong women in their prime who want a sustainable solution to feel their best. Delilah is still very new and your job is to make her soar. Together, Fella & Delilah is the telehealth clinic for busy working families in Middle America to get to a healthier weight. There is a generational brand to be built in making Americans healthy again — it is your job to capture that zeitgeist. If you nail the role, you’ll be top candidate for GM of Fella & Delilah (the brands, within an overarching company). This is a full time, fully remote role, and you’ll work mostly async in the timezone of your choice — as long as you’re around until midday Pacific Time for calls as needed. This is a very senior role. You’ll report directly to me, Richie :) (our CEO). I’m intense, so you’ll also be intense. You’ll work most closely with our Head of Growth (Dave Lane) who’s built our growth machine since 2021. You’ll lead everything in Marketing, so Dave will report to you. Key responsibilities 📈 ”A startup is a company designed to grow fast. The only essential thing is growth. If you get growth, everything else tends to fall into place.” Overall: Lead a team which is rapidly scaling a robust, low CAC growth engine that adapts to market changes so we can profitably acquire 1 million customers by the end of 2026. Our growth strategy must remain at the frontier of the rapidly changing consumer obesity market and we need an A* team to execute. Strategy: GLP 1s are a f*ing big deal. We’re in a remarkable & rapid period of change which will radically reshape the patient & cash flows in the healthcare system. We gotta stay on the frontier to avoid getting crushed. Brand: Own our brand strategy, brand identity, and creative direction. There is a generational brand to be built in making Americans healthy again. It is your job to capture that zeitgeist. Delilah: We’ve only recently launched our female focused brand, Delilah. She is still very new and your job is to make her soar. Tech stack: Tooling is changing rapidly & our numbers drive our decision making. You’ll own the decision on what stack to use and guide its implementation. Ads + Creative: Lead the team which creates ad campaigns with superb creative that convert at low CAC. Build a high performance in house creative team that consistently produces bold ads that convert, taking big swings as well as guiding subtle optimization. CRO + Lifecycle: Lead the team which maniacally think→test→optimize (both macro + micro) to improve conversion & referral. Execute new product launches, create channel specific acquisition funnels based on the channel, and nurture leads via personalized journeys. Channel happy customers into brand advocates: writing reviews & referring new customers. Organic + Social: Lead the team which expands our organic presence to be a trusted resource for both nurturing & TOF. Capture the zeitgeist and build a social media presence that slaps: plugged in, on brand, and bold — and on the right platforms. The overall goal is to build low CAC, long term defensible organic channels. Setting + Closing: Guide the running of a lean, high performing sales org that has a high conversion rate to minimize CAC. Setting should be comprehensive and closing should be relentless. KPIs MRR End of 24Q3 = $2,192,138 Target for end of 25Q4 = ~$30,000,000 (~10x/yr) Active subscribers End of 24Q3 = 6214 Target for end of 25Q4 = ~85,000 (~10x/yr) Blended CAC End of 24Q4 = ~$450 Target for end of 25Q4 = ~$400 Need to have Experience: You have 5+ years leading marketing at high growth D2C companies, with clear ownership scaling past $100M/yr. You do not need healthcare experience. I have a strong preference for people who understand & enjoy the scary speed of a high growth startup. Brand: You’re superb at brand. You intimately understand your customer, nail positioning, and give compelling creative direction. There is a generational brand to be built in making Americans healthy again — it is your job to capture that zeitgeist. Scientist: You’re maniacal about your metrics. You’re proactive when crafting experiments and have a clear process ****for generating & prioritizing ideas. You care a weird amount about your analytics stack and design experiments across the whole customer lifecycle which are both bold & have clear attribution. Trenches: You don’t hesitate to get your hands dirty in the trenches. You’re not too pretentious or senior to grind it out when needed — in fact you miss the times when that was more of your day to day. Strategy: You’re excellent in the trenches but you’re also the general at 30,000 ft deciding where to move the troops. You don’t get lost in the weeds and you always make sure we’re taking the required big swings. If you don’t, no one will. Hiring: You hate incompetence as much as me. You build a team of strictly A players, and you truly mean it. Excellence: You’re annoyingly capable at meta skills. You’re an autodidact with impressive speed and resourcefulness. You’re highly organized and can complete multiple projects concurrently. You calmly handle uncertainty and rapidly changing situations. Nice to have Agentic: You're a doer. You’ve been pulled into important problems, taken risks, excelled in new areas. You've likely founded something, however small. You may want to start your own company in the future. Systems: You think in and build out systems. In solving a problem you recognize the underlying system, then focus on improving the system itself to fix the true cause of an issue. Figure it out: You’re likely one of those timeless people that could be dropped anywhere in the world, in any century, and you’d figure it out. Your friends probably think of you as that person :) Our cultural standards These are the core cultural standards to which we hold ourselves & our team members: Belief in the mission: We will have served 10 million patients by the end of 2028 and we transform the life of most patients who join. We have a lot of work to do. We are obsessed with our patients and are dedicated to the mission. Unwavering integrity: We are at the frontier, so we often live in ambiguity with no trodden path. When we can’t look to others for guidance, we must maintain impeccable ethics and unwavering integrity. Only the paranoid survive: Bad sh*t is coming. By joining us, you’re choosing to sail straight towards the storms with unhesitating conviction. However much we’ve already done, however far we’ve already come — it’s still Day 1 and all our work is ahead of us. Your life’s work: This will be your most challenging, most rewarding role of your life. You’ll be shocked how capable you are & how much you can achieve. If we’re average we fail: We are only interested in “insanely great”, a focus on the quality of our execution that in everyday life would be considered pathological. We have a dedication to excellence and reject incompetence. Commitment to candor: That which can be destroyed by the truth should be. You get full transparency from the company and the company expects full transparency from you. We never say anything about someone that you wouldn’t say to them directly. We give feedback with love and do not need to protect people from fleeting physical sensations. A maniacal sense of urgency: We execute at an intensity that most people think is impossible. Speed is critical and we need things done yesterday. We all work very hard and in such a competitive world there really is no other way to win. Enduring frugality: We are frugal. We hate being wasteful and we are anti luxury. A culture of cheapness keeps us young. We spend our cash wisely & carefully — in a way that would make our grandmas proud. Bulldozing barriers: The world is malleable and we shape it. We truly believe this and act accordingly. We are relentlessly resourceful and are at the mercy of no one but ourselves. Keep your head down: We’re boring people doing exciting work. We don’t chase short term status — we ignore short term dopamine hits and focus on what matters. Outsiders will underestimate us and we revel in that. The power of focus: We live in a world of power laws and we cannot overestimate the unimportance of practically everything. Know your One Thing, and nail it. 🎯 “You just build a fing amazing experience. Make each step amazing. Make every decision in the long term interest of the customer. Give the customer massively more value than you take.”* Compensation & Benefits Compensation: $150k $300k/yr + 0.3% 1.0% Healthcare: comprehensive medical insurance (if appropriate) Vacation: PTO with a yearly minimum (≥2wks/yr + local national holidays) Remote: our team is fully distributed across the world and functions fully remotely Personal development: budget for books, courses, coaching ($1200/yr) Personal wellness: budget for gym, health apps ($1200/yr) Health coaching: free weekly health coaching so you stay healthy Work coaching: free weekly work coaching so you stay calm + sharp Equipment: Macbook & work from home equipment provided as needed What are we missing? We're still early so you get to shape our culture. How to apply Email richie+hiring@joinfella.com with: your resume highlights from your experience relevant to the role. show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "",
      "salary": "$150K/yr - $300K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4092875237/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "FalconX",
      "description": "Who are we? FalconX is a pioneering team of operators, investors, and builders committed to revolutionizing institutional access to the crypto markets. Operating at the intersection of traditional finance and cutting edge technology, FalconX addresses the industry's foremost challenges: Navigating the digital asset market can be complex and fragmented, with limited products and services that support trading strategies, structures, and liquidity found in conventional financial markets. As a comprehensive solution for all digital asset strategies from start to scale, FalconX operates as the connective tissue empowering clients with seamless navigation through the ever evolving cryptocurrency landscape. Head of Marketing We are seeking a driven and experienced Head of Marketing to join our growing team. In this role, you will be responsible for leading our marketing team and developing/executing comprehensive marketing strategies that increase our market share, enhance our brand position, and drive customer acquisition across both traditional finance and crypto markets. This role requires a unique blend of financial services marketing expertise and a deep understanding of the digital asset landscape. Responsibilities Support and execute a comprehensive marketing strategy aligned with company goals and industry trends Lead and mentor a high performing marketing team, fostering a culture of innovation and collaboration Create compelling narratives that effectively communicate our value proposition to a diverse institutional investor base Oversee the development of multi channel marketing campaigns, including digital, content, event, and PR initiatives and align efforts with performance marketing plans. Collaborate closely with product, sales, and business development teams to ensure marketing efforts support overall business objectives Manage relationships with external agencies and partners to maximize marketing impact and efficiency Analyze market trends, competitor activities, and campaign performance to continuously refine marketing strategies Establish and track key performance indicators (KPIs) to measure the effectiveness of marketing initiatives Manage the marketing budget, ensuring optimal allocation of resources Act as a thought leader and brand ambassador, representing the company at industry events and in media engagements Qualifications Bachelor's degree in Marketing, Business, or related field; MBA preferred 10+ years of progressive marketing experience, with at least 5 years in a senior leadership role Proven track record in developing and executing successful marketing strategies in both traditional finance and digital asset sectors Excellent written and verbal communication skills, with the ability to distill complex concepts into clear and compelling narratives. Deep understanding of cryptocurrency, blockchain technology, and the broader fintech landscape Strong knowledge of institutional finance, including experience marketing to hedge funds, asset managers, and other financial institutions Excellent leadership skills with the ability to inspire and manage high performing teams Data driven mindset with experience in marketing analytics and performance measurement Adaptability and agility to thrive in a fast paced, rapidly evolving industry Strong network within the finance and crypto communities Location & Travel FalconX is a hybrid first organization with 7 global offices. This role is expected to sit in our New York City office three days a week. There is a strong preference for this role to sit in our NYC office, however, we are open to considering qualified talent in the Bay Area. Due to the nature of this role's work, we do expect there to be domestic and potentially international travel as well. Compensation Base pay for this role is expected to be between $192,000 and $252,000 USD. This expected base pay range is based on information at the time this post was generated. This role will also be eligible for other forms of compensation such as a performance linked bonus, equity, and a competitive benefits package. Actual compensation for a successful candidate will be determined based on a number of factors such as skillset, experience, and qualifications. Notice at Collection and Privacy Policy Applicants located in California and/or applying to a role based in California, please refer to our Notice at Collection and Privacy Policy here. Inclusivity Statement FalconX is committed to building a diverse, inclusive, equitable, and safe workspace for all people. Our roles are intended for people from all walks of life. We encourage all those interested in applying to our organization to submit an application regardless if you are missing some of the listed background requirements, skills, or experiences! As part of our commitment to inclusivity, FalconX would like to acknowledge that the EEOC survey has limited potential responses that you can select. For legal reasons, FalconX must use this language to align with federal requirements, however, we want to ensure that you are able to provide a response to our own voluntary survey questions about your identity that best aligns with your most true self. FalconX is an equal opportunity employer and will not discriminate against an applicant or employee based on race, color, religion, national origin, ancestry, ethnicity, sex (including gender, pregnancy, sexual orientation, and gender identity), age, physical or mental disability, veteran or military status, genetic information, citizenship, or any other legally recognized protected basis under federal, state, or local law. Applicants with disabilities may be entitled to reasonable accommodation under the Americans with Disabilities Act and other applicable state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on FalconX. Please inform FalconX’s People team at recruiting@falconx.io, if you need assistance with participating in the application process. show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$192K/yr - $252K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4010192180/"
    },
    {
      "job_title": "Regional Head of Marketing",
      "company": "Vertex Service Partners",
      "description": "Regional Head of Marketing Location: Charlotte, NC hybrid 6525 Carnegie Blvd STE 200, Charlotte, NC About Us: At Vertex Service Partners, we’re building the largest and most successful residential home services brands in the country. With financial backing from Alpine Capital and a commitment to being the employer and partner of choice, we’re poised for rapid growth. Our brands are known for their strong community ties, quality service, and commitment to being the best place to work. We believe that people are the driving force behind our success, and we strive to create a culture where talent thrives. The Opportunity: Can you combine the entrepreneurial energy of a small business with the resources of a larger organization? Are you ready to apply your marketing expertise to help grow a company in an essential, recession resistant industry? If so, we want to hear from you! As a Regional Head of Marketing, you’ll lead client acquisition, retention, and the entire marketing funnel across one of our regions, overseeing multiple residential roofing & home services brands in our portfolio. You’ll leverage your strategic and analytical abilities to create impactful marketing campaigns, driving customer growth and brand recognition. What You’ll Do: Lead Marketing Strategy: Develop and execute both traditional and digital marketing strategies to guide prospects from awareness to purchase. Full Funnel Ownership: Manage the marketing funnel from top to bottom, optimizing customer acquisition, retention, and engagement across all channels. Collaborate & Manage Teams: Work closely with internal stakeholders and external agencies to design, test, and execute effective campaigns. Analyze & Optimize: Use data to analyze campaign performance, providing actionable insights to improve outcomes. Build reports, dashboards, and KPIs to track results. Channel Strategy: Oversee search marketing, SEO, CRM, affiliate marketing, demand generation and paid social strategies, ensuring the integration of digital and offline efforts. Budget Management: Manage a multi million dollar marketing budget, ensuring efficient allocation of resources. Community Engagement: Build and deploy community marketing initiatives, such as event sponsorships and Chamber of Commerce partnerships, aligned with our regional presence. DTC & Loyalty Programs: Drive Direct to Consumer (DTC) and customer loyalty strategies to deepen relationships with our clients. MarTech Leadership: Partner with industry marketers to develop a leading martech stack, keeping our tools and tactics cutting edge. Light travel: 1 2 days per month may be necessary to build rapport with partner brands and provide support. What We’re Looking For: Experience: 8 10+ years leading B2C marketing teams, with a proven track record in driving YoY sales growth. Market Insight: Expertise in analyzing market trends and segmenting audiences for targeted marketing in local markets. Digital Savvy: Deep knowledge of Google AdWords, SEO, organic search, social strategies, and website development. Data Driven: Proficient in using Google Analytics and other BI tools to track and interpret engagement metrics, churn data, and sales funnels. Strategic & Hands On: A balance of high level strategic thinking with hands on execution. People Skills: Strong negotiation, conflict resolution, and management skills. Detail Oriented: High attention to detail and commitment to quality. Why Join Us? At Vertex Service Partners, we believe in rewarding our team with more than just a paycheck. You’ll enjoy: A full benefits package, including medical, dental, vision, life insurance, and more. A generous 401(k) match of up to 4%. The chance to be part of a dynamic, fast growing company where your contributions make a real difference. We are an Equal Opportunity Employer (EOE). show less",
      "date_posted": null,
      "location": "Charlotte, NC",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$160K/yr - $180K/yr + Bonus\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4110572360/"
    },
    {
      "job_title": "Global Head of Marketing, Global Logistics",
      "company": "Amazon",
      "description": "Description Join the rapidly expanding Global Logistics team that offers global shipping solutions for selling partners, retail vendors, internal Amazon businesses, and external shippers. This is a strategic company priority as part of Supply Chain by Amazon. We are making significant investments in transportation, storage, and distribution services to provide our customers with a complete solution to quickly and reliably move products from manufacturing locations to customers worldwide. We are seeking an outstanding B2B marketing leader with global experience to own the development and execution of our marketing strategy to drive brand awareness and demand generation. The ideal candidate is a highly capable leader who can inspire and direct a team of global marketing managers, develop compelling campaigns, drive high performance across both existing and new marketing channels, pitch and align senior leadership to new ideas, and effectively collaborate with global cross functional teams and stakeholders. This candidate will have experience in both targeted performance marketing and mass marketing, a strong data orientation, and a history of success in building customer demand and brand awareness for emerging brands. Key job responsibilities Develop and execute strategies that drive brand awareness, adoption, and engagement for our logistical services Work across business, operations, product, quality, marketing channels, insights, retail, tech, and key external partners globally to create bold, innovative, and strategic plans Leverage customer insights to build and drive full funnel customer engagement strategies and brand awareness Demonstrate deep understanding and hands on experience with integrated marketing, digital demand generation, CRM, and global marketing Build and develop a global, diverse marketing team, setting strategic direction, cultivating a learning oriented and collaborative culture Navigate ambiguity, investigate complex challenges, and effectively influence cross functional stakeholders Work backwards from the customer, apply innovative thinking, and identify and mitigate gaps Develop targeting and segmentation strategies, marketing channel measurement and reporting, and strategies to retain customers and deliver topline targets Build and own the playbook for new marketplace and product launches Represent Global Logistics as the Head of Marketing in internal and external meetings, conferences, and trade shows Collaborate with PR teams to design strategies and campaigns to drive Global Logistics brand awareness Align and leverage marketing capabilities across Supply Chain by Amazon teams Candidate must be able to travel internationally and within USA. A day in the life The ideal candidate will be a passionate engagement lifecycle marketer and leader, with a track record of building teams, creating strategies, and delivering results. You are highly analytical, and adept at synthesizing quantitative and qualitative customer learning into a tight, clear marketing plan. You will have strong understanding of all aspects of the marketing funnel, with strong ownership and a problem solving orientation. You will need to communicate clearly and persuasively, both verbally and in writing. About The Team Global Logistics is part of Supply Chain by Amazon and encompasses a set of supply chain services that get products from manufacturers to customers around the world. We are the first part of the supply chain from the factory door and offer a complete end to end solution that keeps products in stock, provides faster and more reliable shipping, and significantly lowers costs. We offer international and domestic logistic solutions. Our cross border expertise enables Amazon's introduction into new markets. Global Logistics cultivates global expansion with the highest standard of quality, accountability, and transparency. Our multicultural, multilingual team works with merchants, sellers, vendors, providers, governments, and trade officials from the busiest to the most remote locations worldwide, applying a global perspective with a local approach. We are open to hiring candidates to work out of one of the following locations: Bellevue, WA, USA Basic Qualifications 10+ years of professional non internship marketing experience Experience managing teams Experience using data and metrics to drive improvements Experience with Excel or Tableau (data manipulation, macros, charts and pivot tables) Experience driving direction and alignment with cross functional teams Preferred Qualifications Knowledge of Photoshop, video editing, and related tools Experience in inter team working skills to develop partnership with partner, tech team and operating at leadership levels Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $136,000/year in our lowest geographic market up to $252,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company Amazon.com Services LLC A57 Job ID: A2635576 show less",
      "date_posted": null,
      "location": "Bellevue, WA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$136K/yr - $252.9K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/3919725917/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Abacus Works",
      "description": "The Hyperlane protocol is pioneering permissionless and modular interoperability. Providing developers with an API to connect between blockchains, Hyperlane is the first tool that allows anyone to add interoperability capabilities to any chain, without having to deal with any gatekeeping! Hyperlane's modular security stack means developers can configure and customize their security to their needs, always remaining in control. Come build the interchain with us! | Learn more at docs.hyperlane.xyz In This Role You Will Manage our marketing team and foster a collaborative, high performing culture. Proven track record of successful marketing launches such as mainnet. Define and own Hyperlane’s marketing vision, strategy, and budget. Establish scalable processes and frameworks to support Hyperlane’s rapid growth. Design and execute content strategies to showcase Hyperlane’s value. Create campaigns to drive engagement, ensuring alignment with product and business goals. Plan, organise and execute team participation in events aligned with our goals. Excel in using metrics and analytics to evaluate performance, refine strategies, and optimize campaigns. For This Role You Have Or Are 3+ years of experience leading marketing efforts in the crypto ecosystem. Proven track record of scaling established marketing functions and driving measurable improvements in visibility, engagement, and results. Expertise in data analysis, using insights to refine strategies and improve impact. Deep understanding of the crypto ecosystem, with active participation in the space. Exceptional communication skills, with experience creating compelling content. Nice To Have Familiarity with on chain data and its application in marketing. Experience organizing developer focused events or hackathons. Background in business development or product marketing within crypto. Creative, innovative problem solving skills. Salary range for this role is $200K to $250K USD (NY). Compensation is subject to experience. Published salary bands pursuant to transparency laws, do not include possible variable compensation such as annual merit increases, bonus eligibility, commission, or equity incentive. show less",
      "date_posted": null,
      "location": "New York, United States",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$167K/yr - $220K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4082898790/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Unit21",
      "description": "About Us At Unit21, we believe that combating financial crime demands a united front. Through our adaptable risk engine and versatile case manager, we identify and proactively mitigate risks related to money laundering, fraud, and other illicit activities. With a simple API and no code interface, we empower fraud fighters and AML heroes to proactively detect and prevent fraud–without tapping engineering. Job Description This is a remote position. About the Role: We are looking for our Head of Marketing at Unit21. We’re building a set of no code tools that enables non technical risk and compliance teams to run complex logic without having a Computer Science education. The result of greater empowerment means that the tools that were historically controlled by engineers can now be available to the actual business user, enabling them to do their best work. We have seen great results in decreased fraud losses and lower false positives for several financial institutions. We are looking for a product oriented marketing leader to build out our marketing function with sharp data insights. The ideal leader should have meaningful product marketing experience combined with being extremely data driven. The candidate will have the tenacity, creativity and boldness to transition Unit21. The Unit21 Head of Marketing will set product messaging and strategy, lead demand generation, and be responsible for key pipeline metrics. As Head of Marketing, you will build out a strategy to drive Unit21’s awareness and drive demand for Unit21’s platform. You will recruit and lead a high performance team, and drive the overall strategy for demand generation, product marketing, brand, and developer evangelism functions. In this role: What you will be doing: Lead, mentor, inspire and grow a team of marketers responsible for our pipeline, demand generation, user retention, product marketing, brand, and PR Establish demand generation best practices, owning accountability for and managing the top and mid funnel lead routing, nurturing, and retention strategies, and ensure delivery of pipeline and leads to support our aggressive growth goals Develop, communicate, and execute Unit21’s marketing strategy and plan, both near and long term Set current and long term goals for direct reports and supporting functions Effectively lead across functional boundaries, ensuring alignment on the goals and objectives Drive awareness for Unit21 Represent Unit21 at relevant industry events including speaking, sponsorship, and exhibiting opportunities What We're Looking For: Our Head of Marketing will need to balance their time between being hands on at the project level and working with our executive team on strategy. As our ideal candidate, you'll have a strong track record of delivering business results as a hands on Marketing IC, as well as a strong track record of stewarding a high performing team as a people manager. Additionally, you'll be able to demonstrate experience with the following: 10+ years of experience in marketing leadership roles, including experience scaling a team through high growth at a growing B2B SaaS company, with a proven record of achieving significant results You have deep product marketing and/or demand generation experience and have led teams of 5+ marketers across a variety of disciplines Significant experience in B2B technology marketing (preferably analytics platforms and/or fintech) with a solid understanding of the ecosystem and technical audiences we serve Proven track record in leading new brand positioning, new brand campaigns, activation programs and copy to market from a total company perspective Track record of managing a high dollar budget annually with excellent performance metrics Ability to aggressively prioritize the few things that have the biggest impact Love of analytics and a proven track record of analyzing campaign performance and identifying actionable insights to achieve your key metrics Compensation: The standard base pay range for this role is $200,000 250,000 Annually. This base pay range does not include variable compensation including potential commissions, bonuses or other financial or equity incentives. About Unit21: Unit21 stops bad actors by leveraging data to deliver justice and safety in the world. We protect businesses against adversaries engaging in money laundering, fraud, and other sophisticated risks by offering no code infrastructure to model, detect, and remediate suspicious activity. Our customers range from large Fortune 500 companies to high potential, pre launch startups. We have reported over USD $2 billion in fraud and laundered money to the US government using our software. We are a rapidly growing Series C startup, having raised close to $100m from Google, Tiger Global, ICONIQ Capital, Jack Dorsey, Diane Greene, and other leading VCs. Our team believes deeply in fostering individual ownership, iterative product development, and empathetic communication. There are many challenging problems to solve in this industry, and a huge opportunity for our software to empower companies to define a new standard of eliminating bad behavior on their platforms. We encourage people of all backgrounds to apply. Unit21 is committed to creating an inclusive culture, and we celebrate diversity of all kinds. show less",
      "date_posted": null,
      "location": "San Francisco Bay Area",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$200K/yr - $250K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4085838563/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Austin, TX",
      "remote": "Remote",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098081300/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Teneo",
      "description": "About Teneo Teneo is the global CEO advisory firm. We partner with our clients globally to do great things for a better future. Drawing upon our global team and expansive network of senior advisors, we provide advisory services across our five business segments on a stand alone or fully integrated basis to help our clients solve complex business challenges. Our clients include a significant number of the Fortune 100 and FTSE 100, as well as other corporations, financial institutions and organizations. Our full range of advisory services includes strategic communications, investor relations, financial transactions and restructuring, management consulting, physical and cyber risk, organizational design, board and executive search, geopolitics and government affairs, corporate governance, ESG and DE&I. The firm has more than 1,600 employees located in 40+ offices around the world. Description The Head of Marketing oversees the day to day execution of the global marketing function. This includes oversight and development of several team members and spans the following critical functions across the business: Content and Channel Marketing, Business Development and Brand, and Stakeholder Engagement and Experiences. The Director of Marketing has deep experience across key marketing functions, including content management, communications, events, and marketing technology; is a proven leader and talent manager; and is self motivated and highly entrepreneurial. They partner with the Chief Integration Officer and key stakeholders across all regions and business units on key marketing and communications initiatives. This role is based in New York City. Responsibilities Leads the day to day execution of the global marketing function in support of the overall marketing plan and objectives Manage and develops marketing team members, including overseeing work product; providing oversight and quality control checks; guiding priorities; making daily decisions; and providing coaching and training Partner with the Chief Integration Officer and regional and business leaders to develop the annual marketing priorities, plan and budget; routinely measure and report progress against the plan and budget Communicate proactively with leadership, escalating questions/issues as needed; serve as primary point of contact for business and regional leads on marketing initiatives and projects Evolve internal and external stakeholder communication plans, processes and content Lead special projects Serve as in house expert and relationship manager for MarTech tools and vendors, including various CMS systems, global CRM, e mail marketing tools, etc. Participate in negotiation with and fulfilment of key corporate sponsorships, partnerships, memberships and vendor relationships Create, maintain and monitor a Return on Marketing Investment (ROMI) dashboard to measure effectiveness of current initiatives; proactively propose and implement improvements/enhancements as needed Serve as steward of the Teneo brand, including positioning in the market and adherence to visual brand guidelines Provide oversight of the firm’s global thought leadership program – participating in content development, exercising quality control and overseeing amplification across external channels Qualifications Proven leadership capabilities, a strong work commitment, high ethical standards, ability to collaborate with a broad range of internal and external stakeholders, and desire to coach and develop team members Excellent verbal and written communicator, with strong editorial and proofreading skills Superior project management and organizational skills, with creative problem solving abilities, sound judgment and attention to detail Resourceful, team oriented, enthusiastic, collaborative and entrepreneurial Ability to simultaneously manage multiple time sensitive and demanding assignments Experience working with a variety of MarTech tools (CRM, CMS, Google Analytics, etc.) and vendors required, with proficiency in synthesizing and managing data preferred Education: Bachelor’s degree or equivalent required Suggested work experience: 14+ years in marketing, communications and/or related fields; experience in professional services strongly preferred Must be based in New York City and work from the midtown office a minimum of three days per week Periodic domestic and international travel required What We Offer As a Teneo employee, you will enjoy unique benefits including flexible time off policy; medical, dental, and vision coverage; long term disability, and life insurance; a 401K plan; commuter benefits; team events; snacks; and other perks. Our Commitment to Diversity and Inclusion Teneo is an equal opportunity employer and promotes a diverse and inclusive workplace. Teneo considers all applicants without regard to race, color, religion, creed, national origin, age, sex, marital status, ancestry, disability, veteran status, gender identity, genetic information, or sexual orientation or any other status protected by applicable law. Base Salary Range $265,000 $285,000 (compensation for this role will depend on several factors, including a candidate’s qualifications, skills, competencies, and experience that may fall outside of the range listed). Bonus Eligible Yes Total Compensation Package Includes annualized bonus, 401k match, healthcare coverage and a broad range of additional benefits and perks. Flexible Work Policy Work Arrangement: Hybrid (3 days in office, 2 days remote). Teneo believes in in person collaboration when possible and if you are assigned to the New York and San Francisco offices, the company expectation is for employees to work from the office location a minimum of three times a week. show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$265K/yr - $285K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4030401167/"
    },
    {
      "job_title": "Head of Marketing (Remote)",
      "company": "VC Lab",
      "description": "Decile Group (https://decilegroup.com) is transforming venture capital into a force for good in the world. We are working to launch 1,000 next generation venture capital firms by 2025, changing the face of venture capital. We run VC Lab, the leading venture capital accelerator worldwide and operate the Decile Hub platform, reducing the barriers of entry for next generation investors to launch and grow meaningful early stage investment firms. We are looking for a forward thinking, proactive Head of Growth to join our team. This individual will plan out complex marketing calendars, write engaging outreach emails, coordinate social activities company wide, manage an advanced funnel of leads, and test and measure new outreach and marketing strategies. At Decile Group, everyone has the opportunity to contribute to everything, offering a vibrant, fast paced startup environment where you can experience every facet of venture capital. This is a unique opportunity to elevate your marketing and growth strategy skills to the next level. Remote candidates are accepted. The Head of Marketing's responsibilities include: Plan out complex marketing calendars for a year in advance Write engaging outreach emails that resonate with our target professional audiences Coordinate social activities company wide, particularly focused on engagement on LinkedIn Manage an advanced funnel of leads, ensuring regular communication Test and measure new outreach and marketing strategies for list building and conversion Work closely with company leadership to develop and execute growth strategies Use data to inform growth decisions, continually optimizing for success What You Have: 5 7+ years of experience in growth marketing or a related field Proven track record in designing and implementing successful growth strategies Proficient in major digital marketing platforms and marketing analytics tools Strong written and verbal communication skills, able to write engaging outreach emails High emotional intelligence and intuition Detail oriented, analytical, and comfortable working with data Ability to thrive in a fast growing startup What We Offer: Ability to help change the world Vibrant work environment with passionate and capable peers Opportunities for personal growth and role expansion The thrill and perks of a fast growing startup Flexible remote work environment Even if you don't tick every box above, we still encourage you to apply. We're building a diverse team whose skills balance and complement one another. show less",
      "date_posted": null,
      "location": "Silicon Valley, CA",
      "remote": "",
      "salary": "$90K/yr - $175K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4093021304/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Candid Health",
      "description": "What You’ll Be Doing Build a world class marketing team responsible for demand generation, brand marketing, and product marketing. Develop and implement marketing strategies to hit company goals, largely leveraging account based marketing and top of funnel demand generation. Identify and target high potential market segments through detailed analysis of the total addressable market. Identify, engage, and convert the key accounts that could be transformative to our growth Measure and report on the performance of different strategies you’ve implemented, then use this data to iterate toward higher and higher ROI activities Who You Are 6+ years of marketing experience with a focus on demand generation at B2B SaaS, enterprise tech, or health tech. 2+ years of people management experience. Experience at a small start up or scaling a high growth marketing team. Energized by owning lofty, impactful company goals, and are comfortable wearing many hats + learning new things to accomplish them. Clear and concise communicator and analytical thinker. You’re as comfortable writing a press release as you are digging into data. Pay Transparency The estimated starting annual salary range for this position is $175,000 230,000 USD. The listed range is a guideline from Pave data, and the actual base salary may be modified based on factors including job related skills, experience/qualifications, interview performance, market data, etc. Total compensation for this position will also include equity, and employee benefits. Given Candid Health’s funding and size, we heavily value the potential upside from equity in our compensation package. Further note that Candid Health has minimal hierarchy and titles, but has broad ranges of experience represented within roles. show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$175K/yr - $230K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/3860729048/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Storm2",
      "description": "Head of Enterprise Marketing About Us We are a dynamic, fast growing financial technology company focused on building a reliable payment infrastructure that enables businesses and consumers globally to send and receive payments effortlessly. Our mission is to ensure that everyone, especially across Africa, can fully participate in the global economy. We operate in over 20 countries, serving 300,000+ businesses worldwide. Our core values are centered on customer focus, adaptability, accountability, collaboration, excellence, and inclusion. Our leadership operates as performance coaches, dedicated to helping team members achieve their professional goals. We thrive on setting ambitious objectives, exceeding expectations, and creating seamless experiences for our clients. Role Overview The Head of Enterprise Marketing is responsible for designing and implementing a robust marketing strategy aimed at accelerating business growth and capturing market share in key regions. This leader will oversee the creation of lead generation and nurture programs, demand generation efforts, and account based marketing strategies to attract and convert enterprise clients globally. This role reports to the Revenue Team and requires a strong leader with the ability to steer enterprise marketing initiatives, positioning the company as a leader in payment solutions for enterprise clients. Key Responsibilities: Strategic Marketing Leadership: Develop and execute a comprehensive enterprise marketing strategy focused on brand visibility, customer acquisition, and revenue growth across major regions, including Africa, the US, and Europe. Targeting and Segmentation: Use data insights to craft campaigns targeting specific enterprise customer needs, with a focus on high volume industries such as e commerce, SaaS, and financial services. Sales Enablement: Collaborate with the sales and revenue teams to develop impactful sales collateral and tools to help generate qualified leads and support lead conversion. Brand Building: Build strategies to elevate the brand's presence in B2B segments, fostering trust, recognition, and authority in the fintech and payments sectors globally. Demand Generation: Implement lead generation and nurturing programs, using lead scoring and qualification techniques to deliver high quality leads to the sales team. Support sales pipeline progression with engagement programs. Account Based Marketing (ABM): Create and drive ABM initiatives, targeting and engaging key enterprise accounts with highly customized marketing strategies. Retention & Upsell: Design and execute lifecycle marketing programs to enhance customer retention, boost engagement, and identify upsell and cross sell opportunities within the enterprise client base. Conferences & Events: Plan and manage the company’s presence at key industry conferences, trade shows, and events to increase brand visibility and generate leads from enterprise customers. Content Leadership: Oversee the creation of high quality, thought leadership content, including white papers, case studies, blogs, webinars, and video content to engage enterprise customers. Team Leadership: Build, manage, and mentor a geographically distributed marketing team, fostering a culture of accountability, innovation, and collaboration. Growth & Performance Marketing: Lead data driven marketing efforts focused on direct revenue growth, customer acquisition, and long term engagement with enterprise clients. Adaptability & Innovation: Embrace change in a fast paced environment by continuously evolving marketing tactics to stay ahead of market trends. Analytics & Optimization: Regularly monitor, measure, and report on the performance of marketing campaigns, optimizing for return on investment (ROI) and customer acquisition costs. Qualifications & Experience: Minimum of 12 years of experience in B2B marketing, including at least 3 years in a leadership position. Proven track record of developing and executing marketing strategies for high growth companies, particularly in fintech, SaaS, or technology sectors. Strong knowledge of the African business landscape. Experience in revenue focused marketing roles with measurable outcomes and an emphasis on sales enablement. Deep understanding of growth marketing and the ability to build trust and credibility at the enterprise level. Expertise in performance marketing, demand generation, and driving revenue growth through B2B marketing channels. Proficient in marketing automation, CRM systems, and data analytics tools. Experience leading global marketing strategies with localized execution in various regions. Analytical mindset with a strong focus on data driven decision making and understanding of marketing ROI. Salary and Work Environment: The salary range for this position is between $175,000 and $220,000 base, with a 40% bonus structure. This is a remote position, but candidates must be located in Eastern Time (ET) or Central Time (CT) zones. show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$175K/yr - $220K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4057204581/"
    },
    {
      "job_title": "Head of Marketing, Vascular",
      "company": "Abbott",
      "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals and branded generic medicines. Our 114,000 colleagues serve people in more than 160 countries. Abbott is seeking a passionate, experienced and strategic medical device leader to join our Vascular commercial team and lead the U.S. marketing team and commercialization efforts. This role requires flawless preparation/execution of product launches, delivering effective marketing campaigns and tracking/measuring success. This role requires a close feedback loop with our global marketing, medical education, clinical affairs, finance and field sales team. This role requires a high level of interaction with US customers. In addition, this role will lead a team of marketing managers and product managers whose tasks are launching product, executing marketing campaigns, driving capital services sales, marketing promotions, and messaging/positioning of the Vascular portfolio at the US level. Responsibilities Annual Plan Expectations: Achieve revenue and margin expectations for Vascular in the U.S.; accountable to delivering on the annual strategic business objectives. Strategic Leadership: Develop and implement the U.S. marketing strategy, value propositions, and marketing initiatives for the Vascular portfolio (including Endovascular, Coronary and Vessel Closure.) Team Management: Provide leadership, coaching, and spearhead cross functional collaboration across the Vascular business, as indicated by key talent retention, on time deliverables, event preparedness and alignment to Vascular objectives. Market Growth: Identify growth opportunities, prioritize initiatives, and develop business cases to support revenue and margin expectations; identify new growth opportunities and segments. Stakeholder Collaboration: Work closely with internal and external stakeholders, including global marketing, field sales, sales operations, strategic accounts, enterprise accounts, finance, legal, regulatory, medical affairs, public affairs, executive management, creative departments, vendors, and healthcare professionals. Strategic Planning: Lead both long term (3 5 years) and short term (annual) strategic planning, including analysis, recommendations, and presentations to senior leadership. Customer Focus: Act as the voice of the customer within the organization, leading market research and intelligence efforts to inform strategy and tactical decisions. KOL Leadership: Engage with KOL’s and top accounts to drive preference toward Abbott Vascular products. Execute Vascular events at a best in class level. Product Management: Product lifecycle management, product/sku level demand planning, and inventory management of US products and updates as needed; manage profitability by product line. Launch Excellence: Create launch messaging, segmentation, targeting, pricing, promotion, metrics, and best practices for Go To Market launch plans for the US, in conjunction with global marketing, training, clinical affairs and medical education along with managing limited market release programs and reporting on execution deliverables and reimbursement tactics. Execution: Translate insights and analysis into effective value propositions, campaigns, initiatives and ensure alignment across the organization. Increase commercial management system effectiveness (ie, SFDC, PowerBI). Explore and implement additional solutions to help drive strategic focus for Vascular team. Pricing/Contracting Strategy: Develop and lead U.S. pricing strategies; Partner with Sales Operations and Contracting to implement tools and insights to enhance margins. Support IDN GPO acceptance and approval strategies, contract analysis and positioning strategies. Budget Planning/Management: Managing operating expense of US Marketing and partnering overall with US sales and global marketing team. Communication: Deliver cadence of communication needs including translation from \"global message\"; US specific promotions and customer communications; sales engagements including launch meetings and calls; sales tool roll outs, quarterly sales promotions; quarterly plans of action and US programs to address competition. Qualifications Bachelor's degree in Engineering, Marketing, Business or equivalent, MBA preferred. 15+ years experience with progressive responsibility in medical devices, healthcare, diagnostics, brand management, or healthcare marketing. 6+ years of demonstrated experience at a managerial level, including prior Director level leadership experience at a medical technology company. Extensive experience with strategic marketing, including launch, of US and global medical devices. Proven ability to interact directly with executive leadership to drive strategy and investment decisions. Strong strategic marketing acumen and experience in leading upstream and/or downstream marketing functions. Proven ability to develop and execute complex strategic business and marketing plans. Familiarity with primary and secondary market research and data analysis. Experience and proficiency with P&L and budget management. Strong interpersonal and people management skills. Strong analytical and project management skills. Must demonstrate ability to effectively prioritize projects that align with corporate priorities. Strong leadership skills, including ability to set goals, provide positive and constructive feedback respectfully to build positive relationships and improve business results. Demonstrated ability to lead and develop teams and collaborate with cross functional teams. Strong communication skills with ability to effectively align at multiple levels in the organization. Multi tasks, prioritizes and meets deadlines in timely manner. Strong organizational, planning, and follow up skills and ability to hold others accountable. Experience working in a broader enterprise/cross division business unit model preferred Ability to work in a highly matrixed and geographically diverse business environment. Ability to travel up to 50%. The base pay for this position is $186,300.00 – $372,700.00. In specific locations, the pay range may vary from the range posted. show less",
      "date_posted": null,
      "location": "Santa Clara, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$186.3K/yr - $372.7K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4090783894/"
    },
    {
      "job_title": "HEAD OF MARKETING",
      "company": "UP TOP",
      "description": "🎯 Kinode https://www.kinode.org/ raised $18mm, tech is built, preparing for Q1 TGE, perfect time to join! WHAT WE’RE LOOKING FOR Kinode is pioneering the future of permissionless computing and decentralized application development with our innovative Web3 operating system. We are seeking a visionary Head of Marketing to lead our marketing initiatives, elevate our brand presence, and drive user acquisition within the blockchain and cryptocurrency sectors. The ideal candidate will possess a deep understanding of blockchain technology, a proven track record in strategic marketing leadership, and the ability to craft compelling narratives that resonate with our target audience. RESPONSIBILITIES • Strategic Marketing Leadership: Develop and execute a comprehensive marketing strategy that aligns with Kinode’s mission to blend blockchain benefits with off chain efficiency, enhancing brand awareness and driving user engagement. • Brand Development: Shape and maintain Kinode’s brand identity, ensuring consistent messaging across all channels to position Kinode as the leading Web3 operating system. • Content Strategy and Creation: Oversee the production of high quality content, including blog posts, tutorials, and social media updates, to educate and engage the developer community and broader audience. • Community Engagement: Foster a vibrant community by organizing events, webinars, and discussions that highlight Kinode’s key features, such as blockchain integration, peer to peer networking, and privacy focused design. • Partnership and Ecosystem Growth: Identify and cultivate strategic partnerships to expand Kinode’s ecosystem, promoting tools like Kit, Valet, DartFrog, and MemeDeck. • Performance Analysis: Set key performance indicators (KPIs), monitor campaign effectiveness, and utilize data driven insights to refine marketing strategies. • Team Leadership: Build and mentor a high performing marketing team, fostering innovation and collaboration to achieve marketing objectives. • Cross Functional Collaboration: Work closely with product, engineering, and business development teams to ensure marketing efforts align with Kinode’s technological advancements and business goals. QUALIFICATIONS Required: • Extensive experience in marketing leadership roles within the blockchain, cryptocurrency, or fintech industries. • Proven ability to develop and implement successful marketing strategies that drive brand growth and user acquisition. • Exceptional communication skills, with the ability to articulate complex technical concepts to diverse audiences. • Demonstrated expertise in digital marketing, content creation, and community management. • Strong analytical skills to assess campaign performance and inform strategic decisions. Preferred: • A robust network within the blockchain and developer communities. • Experience with decentralized technologies and a passion for Web3 innovation. • Ability to thrive in a fast paced, dynamic startup environment. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$200K/yr - $250K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102125734/"
    },
    {
      "job_title": "Head of Marketing and Communications",
      "company": "80Twenty",
      "description": "Our client is a lean yet fast growing, dynamic and innovative B2B software company providing high performance platforms to some of the world’s leading institutions. They are looking for a Head of Marketing and Communications in this high impact role as they grow ambitiously towards their goals. You would lead the strategic and tactical execution of marketing initiatives to drive brand awareness, client engagement, and business growth. This high impact role combines strategy, branding, and hands on execution in areas such as lead generation, multi channel campaigns, PR, event management, community management, and thought leadership. You will manage a small, talented team while collaborating closely with the Director and CEO to align marketing efforts with organizational goals. This is a hybrid role in downtown New York (3 days in, 2 days remote or in office as desired). Key Responsibilities Develop and execute strategic marketing plans to elevate brand visibility. Create impactful content across LinkedIn, email campaigns, press releases, client communications, and trade show materials. Lead client workshops, webinars, and partner events to deepen engagement. Analyze marketing data and performance metrics to optimize lead generation and client acquisition strategies. Manage external agencies and cross departmental collaboration to ensure seamless execution of campaigns. Oversee PR initiatives and establish strong relationships with key publications. Qualifications Proven success in a senior marketing role, ideally in B2B software, FinTech, or enterprise technology. Experience crafting multi channel marketing campaigns, content strategy, and managing lead generation. Strong analytical and project management skills, with a results oriented mindset. Ability to thrive in a fast paced, performance driven environment. Bonus: Background in FinTech, data analytics, or a science degree with Python/SQL experience. Why Join? Opportunity to make a huge impact and work in a collaborative, close knit, and results oriented environment in a lean and dynamic organization. Be part of a company growing at 70% year over year with a trajectory of 100% YOY growth next year and beyond. Competitive salary and benefits, including 401k matching and health insurance contributions. show less",
      "date_posted": null,
      "location": "New York, United States",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "Up to $200K/yr + Bonus, Stock options\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102076071/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Gremlin",
      "description": "Today’s complex, fast paced systems have become a minefield of reliability risks—any of which could cause an outage that costs millions and destroys customer confidence. That’s why high availability teams use the Gremlin to find and fix ‌reliability risks before they become incidents. Gremlin Reliability Platform helps software teams proactively monitor and test their systems for common reliability risks, build and enforce reliability standards, and automate their reliability practices organization wide. As the industry leader in Chaos Engineering and reliability testing, we work with hundreds of the world’s largest organizations where high availability is non negotiable. About The Role Of Head Of Marketing We are seeking an experienced and strategic Head of Marketing to lead the marketing efforts for Gremlin. This individual will play a pivotal role in driving product positioning, messaging, and go to market strategies while also implementing growth marketing tactics to accelerate customer acquisition and product adoption. The Head of Marketing will manage a small but dynamic team of three, and work closely with cross functional teams, including product management, sales, and customer success, to deliver impactful marketing initiatives. In This Role, You'll Get To Own the development and execution of product marketing strategies that drive awareness, engagement, and adoption of Gremlin. Lead competitive market research to inform product positioning, pricing, and go to market strategies. Lead go to market efforts for new product launches and feature releases, coordinating cross functional teams to ensure consistent and impactful execution. Drive the creation of compelling sales enablement tools, including product collateral, presentations, case studies, and whitepapers. Ensure the GTM strategy is aligned with the sales team’s needs and market demand to support revenue growth and implement growth driven campaigns that focus on lead generation, nurturing, and conversion. Leverage data driven insights to refine marketing efforts, improve customer acquisition costs, and optimize the user journey. Partner with product and sales teams to gather feedback, conduct customer interviews, and use insights to inform product enhancements and marketing strategies. Monitor and analyze industry trends, competitor positioning, and market dynamics to keep the company ahead of the curve. We'll Expect You To Have 7+ years of experience in product marketing, marketing a technical product.Strong knowledge and experience in Growth Marketing strategies, with a proven track record of driving customer acquisition, activation, retention, and monetization.Experience leading go to market strategies, product launches, and creating product messaging that resonates with enterprise customers.Proven ability to lead and mentor small teams, driving cross functional collaboration. Ability to translate customer and market insights into actionable product marketing and growth strategies. Proficiency in marketing automation tools, CRM systems, analytics platforms, and sales enablement tools The role does not offer sponsorship employment benefits. If you don't think you meet all of the criteria below but still are interested in the job, please apply. Nobody checks every box—we’re looking for candidates that are particularly strong in a few areas, and have some interest and capabilities in others. Gremlin Offers a Competitive Total Rewards Package, Which Includes Base salary Equity Healthcare, dental, and vision benefits 401(k) with employer match Variable compensation for specific roles Compensation is based on the candidate’s skills and qualifications. The estimated annual salary for this role at Gremlin is $160K $190K. About Gremlin Gremlin is a team of industry veterans and people eager to learn from one another. We set the standard for reliability and equip leading organizations with the mindset and expertise needed to drive reliability improvements that move the world forward. We’re backed by top tier investors Index Ventures, Amplify Partners, and Redpoint Ventures. Our customers love us, and we’re thrilled to be a partner in their success. What Do We Care About We Care about our People People are our critical differentiators. The company strives to treat our people with respect, empathy, and dignity. We expect that our people will treat each other similarly. In both cases, we will assume good intent. All are welcome at Gremlin. We know our differences make us stronger and that our best ideas and contributions can come from anyone at any level. We Care about Collaboration Gremlin is strongest when we come together as one team with shared goals. Be the glue, not the glitter. But as a remote company, teamwork and collaboration won’t happen by accident. We approach every challenge as a shared challenge. We rely on each other for diverse perspectives and creative ideas. We celebrate our wins as a team. We Care about Results Be high productivity, low drama. Results matter. To keep our pace, everyone owns the outcomes of their actions and takes action when needed. We reward speed over perfection. We empower each other to iterate and experiment. You are welcome at Gremlin for who you are. The more voices and ideas we have represented in our business, the more we will all flourish, contribute, and build a more reliable internet. Gremlin is a place where everyone can grow and is encouraged. However you identify and whatever background you bring with you, please apply if this sounds like a role that would make you excited to come into work everyday. It’s in our differences that we will find the power to keep building a more reliable internet by building and designing tools used by the best companies in the world. Visit our website to learn more https://www.gremlin.com/about show less",
      "date_posted": null,
      "location": "Tippecanoe County, IN",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$160K/yr - $190K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4085508600/"
    },
    {
      "job_title": "Head of Marketing & Brand",
      "company": "Hårklinikken",
      "description": "The Role As Hårklinikken’s Head of Marketing & Brand, you will bring an industry leading perspective on executing brand and product marketing strategies globally, seamlessly weaving the brand narrative across all consumer touchpoints. The Head of Marketing & Brand will possess a strong growth focused mindset to drive brand awareness among Hårklinikken’score consumers, as well as a clear articulation of Hårklinikken’s core value proposition, attaining a keen balance between building brand equity and driving commercial performance. We are looking for a dynamic and entrepreneurial, hands on, influential leader with a strong desire to significantly contribute to the scaling of a mission driven wellness brand. Primary Relationships Reporting to the CEO, within Hårklinikken, the Head of Marketing & Brand has primary working relationships with the Founder, Head of eCommerce, CFO, and Chief Scientific Officer. Externally, the Head of eCommerce is responsible for managing relationships with partners such as PR & Communications agencies, and VIP clients. Job Responsibilities Leadership & Team Building Lead and mentor a team that includes PR & Communications, Social & Influencers, VIP & Community, Copywriting and Digital Design. Support the personal development of each team member, ensuring they are always clear on the goals and objectives they are working towards. Lead by example promoting professionalism, encouraging drive and motivation Collaborate with other business and functional leads to align on initiatives that grow Hårklinikken’s top line revenue base across all channels. Marketing & Brand Ensure that overarching brand identity is integrated across all consumer touchpoints, transforming consumer insights and hair health information into compelling storytelling. Collaborate with the performance marketing, retention, eCommerce, and creative teams to drive the overall marketing strategy and content calendar to create and launch campaign assets on time. Collaborate with the CEO and Founder to define higher level brand strategy initiatives. Drive brand building and brand development initiatives; relentlessly and consistently act as the voice of the consumer and brand. Lead the development and execution of big campaign ideas and 360 holistic marketing plans for the launch of new products and hero SKUs. Oversee and direct the brand and product marketing media strategy and go to market earned / owned media plan. Partner with the growth / performance marketing team in effectively executing the content calendar across all paid channels, with a focus on optimizing investments and returns. Employ an omni channel perspective when strategizing and deploying marketing activations to support online, clinics, and partnership channels. Provide strong marketing analytics / KPIs to determine ROI on key marketing activities to best optimize investments. Develop and test a scalable and creative marketing mix plan to accelerate household penetration to thoughtfully define, deploy and manage the marketing budget. Manage PR agency relationships, working closely with Founder, CEO, and agencies to execute key media events. Core Competencies 10+ years of brand management experience, including go to market planning and holistic marketing activations, with 5+ years of beauty experience, ideally within the luxury/prestige beauty market. Ideal background includes broader experience defining and managing a high growth consumer brand, including leveraging insight to position a new brand or reposition an existing brand, creative thinking in building a marketing plan, team management and team building, thriving in an entrepreneurial environment. Comfortable managing multiple projects and deadlines in a fast paced environment. Highly analytical, detail oriented with a data driven mindset to evaluate and learn from insights. Ability and openness to partner with the E commerce and Performance Marketing team to build the brand while delivering critical company goals/metrics. Strong negotiation, oral and written communication skills; able to build coalitions across multiple stakeholders. Excellent people skills to quickly communicate ideas and drive actions through the team. Demonstrated leadership and management skills — self starting, inquisitive, results oriented mindset with high energy and a positive attitude. Ability to move faster than feels comfortable, and ability to toggle between heads down work to multi year strategy conversations with board members. Ability to lead, coach, and develop a talented team with a collaborative, growth mindset. Who Are We? Founded in 1992 in Copenhagen, Hårklinikken’s award winning treatment regimen is expert formulated to help clients achieve optimal scalp health and long lasting hair gain with product blends rich in potent botanicals. We’ve masterminded a diagnostic approach to hair health known as The Hårklinikken Method. Beginning with a consultation – conducted virtually or in person at one of our clinics in New York, Beverly Hills, Copenhagen, Aarhus, Dubai, or Reykjavik – our specialists create a regimen of Hårklinikken essentials, personalized to each client’s individual needs. We’re on a mission to help as many people as possible achieve fuller, stronger, healthier hair with restorative products that optimizeconditions for hair growth. Our work environment includes: Modern clinics with maximum focus on quality and aesthetics Safe work environment International workforce Growth opportunities A flexible hybrid working policy 401k contributions PTO allowance Discounts and allowances on products and treatments Equal Employment Opportunities We offer equal employment opportunities to qualified individuals without regard to race, religion, color, national origin, age, gender, disability, sexual orientation, gender identity, gender expression, marital status, veteran status, or any other characteristic protected by law. We strongly believe that cultivating a diverse workplace gives a company strength. The combination of unique skills, abilities, experiences, and backgrounds creates an environment that produces extraordinary results. show less",
      "date_posted": null,
      "location": "New York City Metropolitan Area",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$170K/yr - $200K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4074734546/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Vir Biotechnology, Inc.",
      "description": "Vir Biotechnology, Inc. is a clinical stage biopharmaceutical company focused on powering the immune system to transform lives by discovering and developing medicines for serious infectious diseases and cancer. Vir’s clinical stage portfolio includes infectious disease programs for chronic hepatitis delta and chronic hepatitis B infections, in addition to multiple oncology programs. Vir also has a preclinical portfolio of programs across a range of other infectious diseases and oncologic malignancies. We believe the success of our colleagues drives the success of our mission. We are committed to creating a company passionate about equality, inclusion, and respect. When everyone feels supported and encouraged to give their best, we will collectively deliver outstanding results. THE OPPORTUNITY The Head of Marketing will drive both the global commercial product strategy and implementation for the VIR portfolio. Reporting directly to the SVP, Commercial, you will help develop and deliver Vir’s commercial strategies and marketing plans for the company’s lead Hepatitis program(s) in preparation for anticipated launches. In this highly collaborative role, you will sit on the Hepatitis Program team, lead the BCT (Business Commercial Team), and sit on multiple other cross functional teams, representing commercial and/or Hepatitis leadership. You will partner with Program Executives/Teams, Medical Affairs, Legal, Manufacturing, Advocacy, Finance, CI, etc. to drive the planning and execution of strategies across Marketing, Patient Support, Market Access, Distribution, Advocacy/Health Policy, and Field Strategy. As an integral member of the Commercial team, you will inform commercial product strategy more broadly across the VIR portfolio. This role is located in our San Francisco headquarters with an expectation of 4 days per week in office. What You'll Do Lead the creation of the global brand plan and oversee the development and execution of the tactical plan in support of the overall brand strategy Oversee pre launch positioning and key message planning as well as post launch tactical planning and implementation for Vir’s inline products Maintain and modify our commercial launch readiness playbook; bring creative thinking in go to market approaches Build integrated global strategic plans and budgets that meet market, regulatory, commercial and enterprise needs. Work with functional counterparts to achieve those plans and budgets Be a key stakeholder in the refinement of forecasts, commercial budgets, and P&L for collaborations/products/programs Develop and execute US launch campaigns, and global where applicable, including the development of a differentiating strategy, unique branding, compelling positioning and key messaging that maintain or extend our global market position Shape, maintain and update the brand profile and develop key marketing deliverables, including value proposition, messaging, positioning, differential advantages, brand book and, in coordination with strategic partners to maximize revenue potential while ensuring strategic alignment and meeting patient needs Conduct strategic marketing activities including market and competitive research and product positioning in close collaboration with cross commercial disciplines and partners as appropriate. Identify actionable insights based on market research and ensure that the product/brand addresses areas of unmet need. Ensure KPIs are relevant and informative for brand and patient objectives Participate in portfolio prioritization and life cycle planning activities for relevant clinical stage programs Who You Are And What You Bring 12+ years of relevant in line commercial experience at an early stage biotech and/or pharmaceutical company, preferably in both large and small companies, developing and executing launch strategies B.A./ B.S. and MBA and/or advanced degree required Substantial experience in product strategic planning, including developing differentiated brand positioning and messaging, as well as deep in line experience, both pre launch and post launch Any of the following experiences would be a plus: rare disease, building new markets/new therapeutic area commercialization and/or market development/activation experience Working knowledge of current US payer environment and dynamics, including patient affordability programs Strong analytical skills, demonstrated by the ability to identify and interpret complex issues and provide appropriate recommendations to senior management and across functional areas, including key market planning insights based on epi data and market research Previous experience attracting, developing and retaining high caliber leaders and contributors that help build and shape the business to drive future success of the organization Strong developmental leader who leverages this skillset to create a high performing organization Ability to travel as required to meet business needs Must plan to be in office 4 days per week _AA1 Who We Are And What We Offer The expected salary range for this position is $225,000 to $329,500. Actual pay will be determined based on experience, qualifications, geographic location, and other job related factors. Vir’s compensation and benefits are aligned with the current market and commensurate with the person’s experience and qualifications. All full time employees receive a package that includes compensation, bonus and equity as well as many other Vir benefits and perks such as health, dental, vision, life and disability insurance benefits, non accrual paid time off, company shut down for holidays, commuter benefits, childcare reimbursement, education reimbursement, 401K match and lunch each day in the office. Applicants must currently be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. Vir Biotechnology (“Vir”) is an equal opportunity employer. All employment decisions at Vir are based on legitimate, non discriminatory business requirements, job duties and individual qualifications. Employment decisions are made without regard to race, color, religion, sex (including pregnancy), gender, gender identity, gender expression, sexual orientation, age, parental status, marital status, national origin, ancestry, disability, medical condition, genetic information (including family medical history), political affiliation, military service or any other legally protected characteristic. This commitment extends to all management practices and decisions, including recruitment and hiring, compensation, appraisal systems, promotions, training and career development programs. Vir also strongly commits to providing employees with a work environment free of unlawful discrimination or harassment. Vir Human Resources leads recruitment and employment for Vir. Unsolicited resumes sent to Vir from recruiters do not constitute any type of relationship between the recruiter and Vir and do not obligate Vir to pay fees should we hire from those resumes. We ask that external recruiters and/or agencies not contact or present candidates directly to our hiring manager or employees. For hires based in the United States, Vir Biotechnology, Inc., participates in E Verify. Candidate Privacy Notice show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$225K/yr - $329.5K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4089808813/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "24 Seven Talent",
      "description": "Our client is a fast growing skincare brand looking to add a Head of Marketing to lead their North America business. Responsibilities Establish strategies for retailer partnerships Day to day management of the marketing team including brand, influencer, and social media strategies for the brand. Lead and inspire the team Manage all marketing calendar activities and social campaigns Manage strategies across sampling, eventing, press, social content, and advertising Continuous analysis of competitive environment and consumer trends Track and measure marketing results Manage marketing budget Qualifications 7+ years in marketing Passion and experience working in the beauty industry Team management experience Experience working with senior leadership show less",
      "date_posted": null,
      "location": "New York City Metropolitan Area",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$160K/yr - $185K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4093844053/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098079350/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "San Jose, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098225585/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Austin, TX",
      "remote": "Remote",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098055690/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Park City, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098052850/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Provo, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098068928/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Salt Lake City, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098057611/"
    },
    {
      "job_title": "Head of Marketing, ART19",
      "company": "Amazon",
      "description": "Description We are looking for an experienced Head of Marketing to oversee development of fresh branding, positioning, and a marketing plan, and partner in the execution of a new go to market strategy as we enter the next phase of our product and business evolution at Amazon. The ideal candidate will have SaaS marketing experience, including designing innovative campaigns and managing multi functional marketing teams. This candidate has a demonstrable track record of success in the development and implementation of marketing strategies, creative advertising materials, paid and owned media, social and digital, CRM, and analytics. Key job responsibilities Drive the development and execution of new enterprise SaaS marketing strategy Drive the development and execution of new downstream digital marketing strategy Manage development of new branding and positioning Collaborate with our data team to design customer segmentation and analytics platforms Manage our marketing budget and track KPIs Compile comprehensive pre launch and post mortem reports Develop clear communication systems for internal and external stakeholders About The Team Imagine being a part of an agile team where your ideas have the potential to reach millions. Envision being able to leverage the resources of a Fortune 500 company within the atmosphere of a start up. ART19 (an Amazon Company) is a leading audio platform, providing cutting edge tools for podcast hosting, distribution, ad serving, and audience measurement. At the intersection of publishers and advertisers, the company powers hundreds of millions of podcast downloads every month for the industry’s largest shows. ART19 enables publishers to manage all content and ad operations in one place, offering best in class targeting capabilities, seamless integration with listening platforms, and a flexible infrastructure to continuously enhance revenue opportunities for its clients. Basic Qualifications 9+ years of professional non internship marketing experience Experience owning and executive against marketing strategies that drive growth Experience using data and metrics to drive improvements Experience building, executing and scaling cross functional marketing programs Experience driving direction and alignment with cross functional teams Experience managing, analyzing and communicating results to senior leadership Experience marketing technical SaaS products Experience writing professional business documents and proposals Preferred Qualifications 8+ years of relevant leadership experience 3+ years of team management experience Experience developing creative Product marketing experience Enterprise SaaS marketing experience Digital marketing experience Media industry experience Familiarity with content marketing Passion for podcasting and the media industry in general with an understanding of emerging trends and innovations. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $127,800/year in our lowest geographic market up to $211,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company ART19 LLC Job ID: A2808514 show less",
      "date_posted": null,
      "location": "New York, United States",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$127.8K/yr - $211.2K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4053494998/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Park City, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098078495/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Los Angeles, CA",
      "remote": "Remote",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098080326/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Salt Lake City, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098077907/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Provo, UT",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098074925/"
    },
    {
      "job_title": "Head of Marketing, ART19",
      "company": "Amazon",
      "description": "Description We are looking for an experienced Head of Marketing to oversee development of fresh branding, positioning, and a marketing plan, and partner in the execution of a new go to market strategy as we enter the next phase of our product and business evolution at Amazon. The ideal candidate will have SaaS marketing experience, including designing innovative campaigns and managing multi functional marketing teams. This candidate has a demonstrable track record of success in the development and implementation of marketing strategies, creative advertising materials, paid and owned media, social and digital, CRM, and analytics. Key job responsibilities Drive the development and execution of new enterprise SaaS marketing strategy Drive the development and execution of new downstream digital marketing strategy Manage development of new branding and positioning Collaborate with our data team to design customer segmentation and analytics platforms Manage our marketing budget and track KPIs Compile comprehensive pre launch and post mortem reports Develop clear communication systems for internal and external stakeholders About The Team Imagine being a part of an agile team where your ideas have the potential to reach millions. Envision being able to leverage the resources of a Fortune 500 company within the atmosphere of a start up. ART19 (an Amazon Company) is a leading audio platform, providing cutting edge tools for podcast hosting, distribution, ad serving, and audience measurement. At the intersection of publishers and advertisers, the company powers hundreds of millions of podcast downloads every month for the industry’s largest shows. ART19 enables publishers to manage all content and ad operations in one place, offering best in class targeting capabilities, seamless integration with listening platforms, and a flexible infrastructure to continuously enhance revenue opportunities for its clients. Basic Qualifications 9+ years of professional non internship marketing experience Experience owning and executive against marketing strategies that drive growth Experience using data and metrics to drive improvements Experience building, executing and scaling cross functional marketing programs Experience driving direction and alignment with cross functional teams Experience managing, analyzing and communicating results to senior leadership Experience marketing technical SaaS products Experience writing professional business documents and proposals Preferred Qualifications 8+ years of relevant leadership experience 3+ years of team management experience Experience developing creative Product marketing experience Enterprise SaaS marketing experience Digital marketing experience Media industry experience Familiarity with content marketing Passion for podcasting and the media industry in general with an understanding of emerging trends and innovations. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $127,800/year in our lowest geographic market up to $211,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company ART19 LLC Job ID: A2808514 show less",
      "date_posted": null,
      "location": "Culver City, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$127.8K/yr - $211.2K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4053601030/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Coral",
      "description": "We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "San Diego, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098077508/"
    },
    {
      "job_title": "Head of Marketing, ART19",
      "company": "Amazon",
      "description": "Description We are looking for an experienced Head of Marketing to oversee development of fresh branding, positioning, and a marketing plan, and partner in the execution of a new go to market strategy as we enter the next phase of our product and business evolution at Amazon. The ideal candidate will have SaaS marketing experience, including designing innovative campaigns and managing multi functional marketing teams. This candidate has a demonstrable track record of success in the development and implementation of marketing strategies, creative advertising materials, paid and owned media, social and digital, CRM, and analytics. Key job responsibilities Drive the development and execution of new enterprise SaaS marketing strategy Drive the development and execution of new downstream digital marketing strategy Manage development of new branding and positioning Collaborate with our data team to design customer segmentation and analytics platforms Manage our marketing budget and track KPIs Compile comprehensive pre launch and post mortem reports Develop clear communication systems for internal and external stakeholders About The Team Imagine being a part of an agile team where your ideas have the potential to reach millions. Envision being able to leverage the resources of a Fortune 500 company within the atmosphere of a start up. ART19 (an Amazon Company) is a leading audio platform, providing cutting edge tools for podcast hosting, distribution, ad serving, and audience measurement. At the intersection of publishers and advertisers, the company powers hundreds of millions of podcast downloads every month for the industry’s largest shows. ART19 enables publishers to manage all content and ad operations in one place, offering best in class targeting capabilities, seamless integration with listening platforms, and a flexible infrastructure to continuously enhance revenue opportunities for its clients. Basic Qualifications 9+ years of professional non internship marketing experience Experience owning and executive against marketing strategies that drive growth Experience using data and metrics to drive improvements Experience building, executing and scaling cross functional marketing programs Experience driving direction and alignment with cross functional teams Experience managing, analyzing and communicating results to senior leadership Experience marketing technical SaaS products Experience writing professional business documents and proposals Preferred Qualifications 8+ years of relevant leadership experience 3+ years of team management experience Experience developing creative Product marketing experience Enterprise SaaS marketing experience Digital marketing experience Media industry experience Familiarity with content marketing Passion for podcasting and the media industry in general with an understanding of emerging trends and innovations. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $127,800/year in our lowest geographic market up to $211,200/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company ART19 LLC Job ID: A2808514 show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$127.8K/yr - $211.2K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4053499540/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "Los Angeles, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098054773/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Italic",
      "description": "Italic is creating a world of luxury without labels. We believe that luxury today is exclusionary and all about marketing that hurts its customers and manufacturers. Our mission is to create a new model that enables manufacturers to bypass the legacy luxury supply chain and deliver luxury goods with equivalent or better quality directly to consumers. Our customers come to rely on Italic for our quality, timeless design, and radical value. We are seeking an exceptional marketing leader to drive Italic's continued evolution as a premium lifestyle brand. As we redefine modern luxury through thoughtful design and uncompromising quality, this role will be instrumental in scaling our business while maintaining our brand's elevated positioning and strong unit economics. NOTE This is an intensive individual contributor role for someone who thrives on driving measurable results and shaping business success. Your primary focus and majority of time will be spent on paid media buying. Responsibilities Strategy & Brand Growth Develop and execute sophisticated growth strategies that align with our premium positioning while driving profitable customer acquisition Lead data driven initiatives across paid media, email, and organic channels while maintaining our elevated brand voice Design and implement testing frameworks to optimize conversion while preserving our luxury market positioning Partner with creative teams to ensure all growth initiatives reflect our French inspired contemporary aesthetic Performance & Analytics Own key performance metrics including CAC, ROAS, and customer LTV across channels Build and optimize multi channel campaigns targeting our core demographic of sophisticated professionals (28 45) Develop comprehensive reporting systems to track growth initiatives and inform strategic decisions Scale successful programs while maintaining strict profitability requirements Cross Functional Leadership Collaborate with product and merchandising teams to align growth strategies with new collection launches Partner with creative to ensure all acquisition materials reflect our intentionally designed, irreverent brand voice Work closely with finance to optimize spending and maintain profitable unit economics Guide email and CRM strategy to foster long term relationships with our premium customer base Requirements Experience 5+ years of growth marketing experience, preferably in premium/luxury DTC brands Proven track record of scaling profitable customer acquisition programs Deep expertise in performance marketing across paid social, search, and emerging channels Experience marketing to affluent consumers with sophisticated taste Technical Skills Advanced proficiency in analytics platforms (Google Analytics, Looker, etc.) Expert level knowledge of paid media platforms including Meta, Google, and TikTok Strong understanding of email marketing automation and CRM systems Ability to analyze complex datasets and translate insights into actionable strategies Essential Qualities Refined aesthetic sensibility and understanding of luxury consumer psychology Outstanding analytical capabilities and attention to detail Proven ability to thrive in fast paced, metrics driven environments Exceptional communication skills and cross functional collaboration abilities Natural drive for excellence and continuous optimization Culture Great Brands Start With Great People Our culture focuses on performance, integrity, and longevity. We believe that the best brands are not grown through sheer force but rather through deliberate decision making and persistent effort over a long period of time. We are committed to creating a workplace where talented individuals can thrive in building an enduring, beloved brand that we all take pride in. Inputs Over Outputs We value the effort and work that goes into achieving results rather than just the end result. We believe that investing in our people and processes will lead to better outcomes while also creating a more sustainable and enjoyable environment. Flat Hierarchy Our company has a flat hierarchy and values the input and ideas of all team members. We believe that everyone has the potential to make a significant contribution to the success of the company. Small Team, Big Opportunities As a small team, all employees are expected to take ownership in their work. Some might move faster while others are fine with a slower pace. Those who seek to move faster in their career will be able to do so based solely on merit, contribution, and performance. Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "San Francisco, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4098053840/"
    }
  ]
}