{
  "metadata": {
    "job_title": "analytics",
    "timestamp": "2025-11-03 22:30:49",
    "total_jobs": 75
  },
  "jobs": [
    {
      "job_title": "Product Marketing & Intelligence Lead",
      "company": "Shelf",
      "description": "About Shelf: There is no AI Strategy without a Data Strategy. Getting GenAI to work is mission critical for most companies but 90% of AI projects haven't deployed. Why? Poor data quality it is the #1 obstacle companies have in getting GenAI projects into production. We've helped some of the best brands like Amazon, Mayo Clinic, AmFam, and Nespresso solve their data issues and deploy their AI strategy with Day 1 ROI. Simply put, Shelf unlocks AI readiness. We provide the core infrastructure that enables GenAI to be deployed at scale. We help companies deliver more accurate GenAI answers by eliminating bad data in documents and files before they go into an LLM and create bad answers. Shelf is partnered with Microsoft, Salesforce, Snowflake, Databricks, OpenAI, and other big tech players who are bringing GenAI to the enterprise. Our mission is to empower humanity with better answers everywhere. Job Overview: We’re seeking a Market Intelligence & Product Marketing Strategy Lead who thrives at the intersection of research, strategy, and execution. In this role, you’ll shape how we understand the market, anticipate customer needs, and translate insights into impactful product marketing strategies and roadmap decisions. You will be responsible for deeply analyzing customer personas and their communication patterns, pain points, motivations, and underlying psychology. With natural curiosity, sharp analytical skills, and compelling storytelling abilities, you’ll uncover the hidden drivers behind how customers seek information, evaluate solutions, and make purchasing decisions. By translating complex behavioral patterns into strategies and narratives, you’ll empower marketing, sales, and product teams to connect with customers in ways that resonate and drive meaningful growth. The ideal candidate brings both skill and passion for understanding people, with a strong grasp of human behavior, emotions, and decision making processes and the ability to connect those insights directly to business outcomes. You combine strong research skills and market intelligence expertise with a strategic mindset, leveraging data and behavioral insights to shape product direction, inform go to market strategies, and craft narratives that drive measurable impact. What You’ll Do: Market Intelligence & Research Become our in house expert on market trends, competitive moves, and emerging signals in the AI and platform ecosystem. Dive deep into customer pain points, challenges, and opportunities, surfacing actionable insights that drive product and go to market strategy. Stay ahead of the curve. Your reading list, curiosity, and ability to synthesize complex information into clear recommendations set you apart. Product Marketing Strategy Partner with product, sales, and marketing leadership to guide and shape product positioning, messaging, and roadmap priorities. Translate insights from the market and customers into strategic direction and storytelling that resonates. Bring fresh ideas to the table, championing market driven product strategy and execution. Execution & Ownership Roll up your sleeves and drive execution, from product launches and campaigns to customer facing experiences that deliver measurable outcomes. Own the success of product tours, demos, and other product experiences tied directly to engagement and adoption. Analyst & Ecosystem Engagement Manage relationships with key industry analysts (Gartner, Forrester, IDC, etc.) to ensure our story is heard, understood, and differentiated. Turn analyst insights into actionable strategies that elevate our market position and amplify our voice in category defining conversations. Who You Are A deep learner and researcher, someone who consumes ideas voraciously and can tell us about the last five books, reports, or podcasts that shaped your thinking. A market signal detector, always connecting dots across competitors, customers, and technology shifts to forecast what’s next. Experienced in AI and platform technologies, with a deep understanding of how they are reshaping enterprise software and redefining customer expectations. Skilled at balancing strategy with execution equally comfortable in a strategy session with the C suite and diving hands on into platform tools to deliver outcomes. Adept at building relationships with analysts, customers, and internal stakeholders to amplify impact. What We Offer: Competitive salary: $150,000 $180,000 Generous equity grant in the form of company stock options Comprehensive health and wellness packages Open PTO Realistic, clearly communicated expectations Team wide aligned values and goals Location: Remote work in the NYC Metro Area with travel to Stamford, CT as needed. Why Shelf: GenAI will be at least a $18 Trillion market by 2032 and Shelf is a core infrastructure that enables GenAI to be deployed at scale We are blazing the path for the future of Artificial Intelligence globally. Our Leadership Team has deep AI domain expertise and enterprise SaaS background to execute this plan We love our customers and our customers love us. Ask a Shelf customer why, and they’ll tell you it’s because of our innovative capabilities, rock solid reliability, they truly enjoy working with our people, but most of all – it’s the improvements they see in their business KPIs. We have raised over $60 million in funding and our investors include; Insight Partners, Tiger Global, Base10, and others We have high velocity growth powered by the most innovative product in our category We now have over 100 employees in multiple U.S. states and European countries, and we have ambitious hiring goals over the next few quarters. We encourage you to review the values we thrive on at https://shelf.io/careers/ show less",
      "date_posted": null,
      "location": "New York City Metropolitan Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4303231002/"
    },
    {
      "job_title": "Senior Marketing Advanced Analytics",
      "company": "KellyMitchell Group",
      "description": "Job Summary: Our client is seeking a Senior Marketing Advanced Analytics to join their team! This position is remote PST/MST. Duties: Design, build, and maintain scalable and auditable data pipelines using Databricks and Snowflake Own the data validation lifecycle, including source to target reconciliation using Oracle, data profiling, and anomaly detection Conduct deep dive data mining to uncover patterns, inconsistencies, and opportunities for business action Develop and maintain data visualizations and dashboards in Tableau to support transparency and decision making Implement data quality checks and automated alerting for pipeline failures, anomalies, and audit flags Collaborate with analysts, scientists, and business stakeholders to gather requirements, and deliver reliable data products Optimize existing pipelines for performance, scalability, and operational simplicity Document data lineage, pipeline logic, and metadata clearly and consistently Desired Skills/Experience: 7+ years of experience required Hands on experience designing and maintaining scalable data pipelines using Databricks and Snowflake Strong SQL development skills for data extraction, transformation, and performance tuning Ability to conduct source to target data reconciliation, auditing, and anomaly detection across large datasets Proven experience troubleshooting Spark performance issues Expertise in Snowflake data loading and update patterns Tableau dashboard development, including parameters, performance optimization, and data driven visualization Solid understanding of data validation lifecycle Benefits: Medical, Dental, & Vision Insurance Plans Employee Owned Profit Sharing (ESOP) 401K offered The approximate pay range for this position is between $49.00 and $70.00. Please note that the pay range provided is a good faith estimate. Final compensation may vary based on factors including but not limited to background, knowledge, skills, and location. We comply with local wage minimums. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4314190316/"
    },
    {
      "job_title": "Strategy Director, E-Commerce",
      "company": "Marks",
      "description": "POSITION SUMMARY: We’re seeking an eCommerce Strategy Director to elevate content performance and drive digital shelf success for a major CPG client. In this role you’ll be serving as a dedicated strategic partner to drive their brand’s digital performance. In the future, this role may transition to a shared bench of eCommerce strategy expertise, supporting multiple clients. Your deep expertise in SEO, content performance, and retailer strategies will aide in translating complex business challenges into tailored, scalable eCommerce solutions that drive conversion, brand affinity, and market leadership. This leader will bring the right mix of strategic thinking, platform expertise, and content fluency to guide how our client shows up across key retailers like Amazon, Walmart, and Target—and how we as an agency can scale our strategic offerings This is a remote role with preference to candidates in Chicago or Toronto. JOB RESPONSIBILITIES: Client Partnership & Strategic Leadership Serve as a strategic partner to client teams—turning business goals into actionable eCommerce content strategies Lead digital shelf and SEO driven content strategy across key retailers and DTC platforms Build frameworks that define what “best in class” looks like across PDPs and brand storefronts Translate data and insights into performance boosting content strategies and roadmaps Lead client presentations and work sessions to align on strategy and measure progress Content & Platform Expertise Guide copy and creative teams with content best practices across Amazon, Walmart, Target, and other retailers Audit content regularly to identify opportunities for optimization or syndication Recommend content variations and enhancements tailored to platform algorithms, requirements, capabilities and shopper behavior Stay ahead of algorithm changes, retailer updates, and eCommerce trends Performance & Optimization Partner with insights teams to analyze content health, SEO performance, and retail KPIs Make data backed recommendations to continuously improve content effectiveness Collaborate with analytics to connect e commerce results to broader marketing impact/full funnel effectiveness Support tool evaluation, both internal and external client tools (Helium 10, Jungle Scout, Salsify, Profitero, Stackline, etc.) to improve performance visibility and tracking Internal Growth & Practice Building Support the development of reusable tools, templates, and best practices Responsibility to contribute to business impact and client revenue growth Share thought leadership internally and contribute to client RFPs or case studies Help elevate overall eComm IQ across internal teams through informal mentoring and knowledge sharing QUALIFICATIONS: 5–8 years of eCommerce experience in content strategy, digital shelf optimization, or performance marketing Deep knowledge of major retailer platforms (Amazon, Walmart, Target, etc.), SEO, PDP strategy, and content syndication tools Experience with platforms like Helium 10, Walmart Connect, Amazon Ads / Vendor Central, Profitero, Stackline, Salsify, Vizit, or similar Experience translating insights into action—from audits to optimization roadmaps Strong communicator and presenter who can simplify the complex and align stakeholders Highly collaborative and proactive, with experience partnering across creative, copy, insights, and client service teams Understanding of retailer and google algorithms Expertise in industry best practices and a proactive approach to incorporating new techniques and tools into content strategies Experience developing omnichannel comms plans that include ecommerce and retail conversion Strong understanding of major retail media platforms Amazon and Walmart Off line shopper marketing strategy experience in the CPG category Occasional travel either locally, nationally, and/or internationally may be required. PHYSICAL ASPECTS/WORK ENVIRONMENT: Regularly required to stand; walk; sit; and talk, hear and see. Regularly/Occasionally lift and/or move up to 10 pounds. * Reasonable accommodations may be made to enable individuals to perform the essential functions. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. This is a remote position in the US. We are open to candidates in various states, with the exception of those residing in the following: AK, DC, DE, ME, NH, NM, OK, HI, MS, MT, NV, NE, ND, SD, UT, VT, WY, WA, WV Our compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $140,000 $150,000 USD annually. Ultimately, in determining pay, we will consider the successful candidate’s location, experience, and other job related factors Group benefits currently include a selection of health care plans with prescription drug coverage, dental plan, vision plan, basic and supplemental life insurance, a flexible spending account for medical and dependent care expenses or a health savings account based on plan selection, short/long term disability and 401(k) Savings Plan. show less",
      "date_posted": null,
      "location": "Chicago, IL",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316324144/"
    },
    {
      "job_title": "Manager, Marketing Data Operations",
      "company": "Vertex Inc.",
      "description": "Job Description: We are looking for a Manager, Marketing Data Strategy & Operations to lead the transformation and day to day execution of our global marketing data function. This role reports to the VP of Marketing Operations and is responsible for driving the strategy, health, and scalability of our marketing database across Salesforce, Marketing Cloud, Microsoft Fabric, and Snowflake, while supporting Salesforce Data Cloud as part of our Enterprise 360 value stream. This role is ideal for someone who understands the strategic importance of clean, governed data in a modern marketing organization and is passionate about building a future ready data foundation that supports emerging technologies ESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES: Own the marketing data roadmap and operations, ensuring alignment with enterprise data strategy, AI readiness, and evolving marketing goals. Manage and scale a centralized marketing data team, including internal staff and external contractors. Oversee database health and hygiene across Salesforce and Marketing Cloud, with a focus on acquisition, enrichment, compliance, and contact lifecycle management. Lead data intake processes including event lead uploads, third party list requests, and vendor provided contact data—ensuring accuracy, governance, and campaign readiness. Serve as a primary marketing data liaison to enterprise data and IT teams, helping ensure cross functional alignment for Snowflake, Salesforce Data Cloud, and AI enablement across systems. Establish and maintain data governance standards including field mapping, segmentation logic, deduplication, and sourcing protocols. Support regulatory compliance initiatives (GDPR, CAN SPAM, etc.) in partnership with Legal and InfoSec. Collaborate extensively with technology and analytics teams to ensure the marketing data infrastructure supports advanced analytics, AI modeling, and scalable experimentation. Act as the marketing data point person for external vendors supporting the data team, overseeing contracts, deliverables, and quality for enrichment and data projects. Help define future state architecture that enables data interoperability, real time enrichment, and machine learning use cases in partnership with enterprise stakeholders. SUPERVISORY RESPONSIBILITIES: Determine appropriate resourcing of staff in order to achieve goals and objectives. Define annual Key Performance Indicators aligned with corporate goals. Manage and mentor employees on performance gaps, career development opportunities, and strategies. Manage and coach employees on all human resource related processes including onboarding, performance management, succession planning, employee relations, selection, terminations, compensation and rewards. Recognize others’ contributions and share credit for success. Own attainment of high employee satisfaction and retention; lead development of program and initiatives within group to attain high employee satisfaction. Prepare and manage budget as assigned; analyzes variances and initiates corrective actions to maximize operational performance. KNOWLEDGE, SKILLS AND ABILITIES: Technical understanding of enterprise data architecture strategy and systems integration. Strong experience with Salesforce CRM, Marketing Cloud (Pardot or similar MAP), Salesforce Data Cloud, and Snowflake. Familiarity with AI based segmentation, predictive scoring, and data enrichment tools is a plus. Deep understanding of lead lifecycle, governance, and marketing compliance standards. Demonstrated ability to operationalize data governance and build scalable intake, enrichment, and routing workflows. Excellent cross functional collaboration skills and ability to translate business needs into scalable, future ready data solutions. EDUCATION AND TRAINING: 6+ years of experience in B2B Marketing Operations or Marketing Data roles; SaaS or technology industry experience strongly preferred. 2+ years of people management experience, with a proven ability to lead high performing teams. Other Qualifications The Winning Way behaviors that all Vertex employees need in order to meet the expectations of each other, our customers, and our partners. Communicate with Clarity Be clear, concise and actionable. Be relentlessly constructive. Seek and provide meaningful feedback. Act with Urgency Adopt an agile mentality frequent iterations, improved speed, resilience. 80/20 rule – better is the enemy of done. Don’t spend hours when minutes are enough. Work with Purpose Exhibit a “We Can” mindset. Results outweigh effort. Everyone understands how their role contributes. Set aside personal objectives for team results. Drive to Decision Cut the swirl with defined deadlines and decision points. Be clear on individual accountability and decision authority. Guided by a commitment to and accountability for customer outcomes. Own the Outcome Defined milestones, commitments and intended results. Assess your work in context, if you’re unsure, ask. Demonstrate unwavering support for decisions. COMMENTS: The above statements are intended to describe the general nature and level of work being performed by individuals in this position. Other functions may be assigned, and management retains the right to add or change the duties at any time. Pay Transparency Statement: US Base Salary Range: $114,500.00 $148,800.00 Base pay offered to new hires may vary based upon factors including relevant industry and job related skills and experience, geographic location, and business needs.* The range displayed does not encompass the full potential of the role, which allows for further growth and career progression. In addition, as a part of our total compensation package, this role may be eligible for the Vertex Bonus Plan (VOB), a role specific sales commission/bonus, and/or equity grants. Learn more about Life at Vertex and connect with your recruiter for more details regarding Vertex's compensation and benefit programs. In no case will your pay fall below applicable local minimum wage requirements. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271369135/"
    },
    {
      "job_title": "Senior AI Martech Strategist",
      "company": "Bounteous",
      "description": "Bounteous is a premier end to end digital transformation consultancy dedicated to partnering with ambitious brands to create digital solutions for today’s complex challenges and tomorrow’s opportunities. With uncompromising standards for technical and domain expertise, we deliver innovative and strategic solutions in Strategy, Analytics, Digital Engineering, Cloud, Data & AI, Experience Design, and Marketing. Our Co Innovation methodology is a unique engagement model designed to align interests and accelerate value creation. Our clients worldwide benefit from the skills and expertise of over 4,000+ expert team members across the Americas, APAC, and EMEA. By partnering with leading technology providers, we craft transformative digital experiences that enhance customer engagement and drive business success. Role Summary Lead AI product strategy for an intelligent orchestration platform transforming end to end performance marketing. Design marketer first AI experiences that eliminate unwarranted manual work, enable 1:1 personalization at scale, and bridge Adobe Experience Cloud with enterprise systems. Shape product vision, agentic architecture, and market positioning for a future ready platform serving B2B marketing use cases. What You'll Do: AI Product Strategy (40%) Solutioning: Analyze performance marketing gaps (campaign planning, content production, audience development, activation, reporting) and architect AI solutions Product Led: Lead phased evolution from automation to personalization, orchestration and predictive intelligence Agentic AI: Design multi agent ecosystem (e.g. Audience, Content, Journey, Brief, Query, Optimization, Critics) with orchestration enabling autonomous marketing execution Experience: Champion intuitive, SPOG or command center interface eliminating tool switching for non technical users Future Ready: Ensure extensible, modular architecture scaling to emerging AI capabilities Technical Architecture (35%) Integration: Architect integrations with GCP, AEP/CDP, Workfront, Analytics and advise on APIs AI Stack Orchestration: Evaluate & integrate LLM (Gemini, Vertex AI), RAG, prompt frameworks Feasibility: Assess use cases vs. existing platform capabilities (Pega, Adobe etc.) and constraints Agentic Design: Define interaction protocols, decision logic, human in loop & feedback methods Stakeholder Alignment (15%) Executive Mandates: Bridge C suite objectives (cost, velocity, personalization) with AI realities Change Strategy: Design adoption approach, identify champions, training needs, success metrics Requirements Synthesis: Distill diverse stakeholder needs into coherent product specifications Thought Leadership (10%) Monitoring: Track Adobe/Salesforce/Martech events & identify differentiation opportunities Innovation: LLM/Agentic advancements, real time personalization & assess applicability Required Qualifications: Core Expertise 10+ years Martech strategy; 3+ years building AI products for marketing Agentic AI: Hands on multi agent system design with orchestration, decision logic, human machine collaboration AI Development: LLM integration, prompt engineering, RAG architectures, conversational AI, recommendation systems Performance Marketing: Deep understanding of campaign workflows, briefing, segmentation, content production, QA, activation, attribution and B2B pain points Platform Knowledge Adobe Experience Cloud: AEP/CDP, GenStudio, Workfront, Marketo etc. Broader Martech: Marketing automation, Analytics/BI, DAM, advertising platforms etc. Integration Patterns: API design, event driven architecture, real time data sync Strategic Skills Product Thinking: Define vision, prioritization balancing user needs/feasibility/value UX for Marketers: Design intuitive interfaces enabling AI leverage without technical expertise Executive Communication: Present complex AI concepts to Execs, translate architecture to business outcomes Cross Functional Leadership: Navigate organizational complexity, drive team outcomes with influence Preferred Agency/consulting background across multiple clients B2B or telecommunications marketing experience Google Cloud AI (Vertex/Gemini) Certifications: Adobe Expert, Google Cloud Professional Computer science/engineering background show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4312732689/"
    },
    {
      "job_title": "Lead, Product Analytics (Amplitude Experience)",
      "company": "Cengage Group",
      "description": "We believe in the power and joy of learning At Cengage Group, our employees have a direct impact in helping students around the world discover the power and joy of learning. We are bonded by our shared purpose – driving innovation that helps millions of learners improve their lives and achieve their dreams through education. Our culture values inclusion, engagement, and discovery Our business is driven by our strong culture, and we know that creating an inclusive workplace is absolutely essential to the success of our company and our learners, as well as our individual well being. We recognize the value of diverse perspectives in everything we do, and strive to ensure employees of all levels and backgrounds feel empowered to voice their ideas and bring their authentic selves to work. We achieve these priorities through programs, benefits, and initiatives that are integrated into the fabric of how we work every day. To learn more, please see https://www.cengagegroup.com/about/inclusion and belonging/. Cengage is on a mission to make every student a confident learner, and we are looking for a Lead Digital Product Analytics to help achieve that goal. What You’ll Do Here: In this role you will help Cengage set up our world class product analytics practice. You will work with product and technology teams to assess the needs of our customers, use amplitude and other product analytics tools to tag the end to end digital experience, collect the right data, and create metrics and insights from the data. You will work closely with product owners to identify what parts of the digital customer experience need to be changed, set up A/B tests to identify customer response to product changes and measure the business value and customer satisfaction delivered by the digital product. The ideal candidate is an experienced analytical and process improvement professional, with experience in data driven decision making and Digital clickstream data, product analytics concepts with ideally some exposure to digital marketing and data science. You will lead a team of analysts and data scientists, collaborating with various partners in global businesses on important analytics and product tasks. Are you motivated by working to refine analytical capability in established businesses, while bringing standard methodologies and analytical horsepower to more up and coming ones? Reporting to the VP, Head of Product Analytics, you will help bring this strategic process thinking and continual improvement to Cengage’s global businesses. What You’ll Need: Highly analytical, with the ability to think through problems, business processes & metrics. Experience with Amplitude Ability to create, define, and implement a team vision and directive High energy self starter, comfortable acting as a player coach Comfortable setting clear expectations and coaching team and peers in process improvement methodologies Ability to work with varied team members and groups (at all levels) Bachelor’s or Master’s degree or equivalent experience and a shown foundation in statistical and data science (e.g. Machine Learning, Predictive analytics, etc.) concepts 5+ years of analytics experience, including experience working in Marketing Analytics and Data Science Strong communication and interpersonal skills Excellent attention to detail and structured problem solving skills Skill with analytic tools ranging from relational databases and SQL to Excel, and Python/R Ability to tell a clear story with data and translate to business and customer implications Skilled with creating effective presentations, tailored to different audiences Knowledge of product analytics and digital marketing Preferred Experience with Product analytics tools like Content square, Adobe analytics, etc. Experience working with on Premise and/or Cloud analytics environments like Hadoop, AWS, Snowflake, etc. Experience with data visualization and enablement tools like Tableau, Power BI, etc. Experience in the creation and assessment of A/B tests to support continual optimization. Experience instructing analytical, statistical and data science concepts to others Experience using sampling techniques to monitor and analyze performance Cengage Group is committed to working with broad talent pools to attract and hire strong and most qualified individuals. Our job applicants are considered regardless of race, national origin, religion, sex, sexual orientation, genetic information, disability, age, veteran status, and any other classification protected by applicable federal, state, provincial or local laws. Cengage is also committed to providing reasonable accommodations for qualified individuals with disabilities including during our job application process. If you are an applicant with a disability and require reasonable accommodation in our job application process, please contact us at accommodations.ta@cengage.com or at +1 (617) 289 7917. About Cengage Group Cengage Group, a global education technology company serving millions of learners, provides affordable, quality digital products and services that equip students with the skills and competencies needed to be job ready. For more than 100 years, we have enabled the power and joy of learning with trusted, engaging content, and now, integrated digital platforms. We serve the higher education, workforce skills, secondary education, English language teaching and research markets worldwide. Through our scalable technology, including MindTap and Cengage Unlimited, we support all learners who seek to improve their lives and achieve their dreams through education. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4314034383/"
    },
    {
      "job_title": "Senior Manager, Analytics Engineering",
      "company": "Upstart",
      "description": "About Upstart Upstart is the leading AI lending marketplace partnering with banks and credit unions to expand access to affordable credit. By leveraging Upstart's AI marketplace, Upstart powered banks and credit unions can have higher approval rates and lower loss rates across races, ages, and genders, while simultaneously delivering the exceptional digital first lending experience their customers demand. More than 80% of borrowers are approved instantly, with zero documentation to upload. Upstart is a digital first company, which means that most Upstarters live and work anywhere in the United States. However, we also have offices in San Mateo, California; Columbus, Ohio; and Austin, Texas. Most Upstarters join us because they connect with our mission of enabling access to effortless credit based on true risk. If you are energized by the impact you can make at Upstart, we’d love to hear from you! The Team Our Analytics Engineering team plays a critical role in Upstart's mission by transforming raw data into trustworthy, well modeled, and scalable foundations that power decisions across the company. We’re seeking a Senior Manager to lead a team of Analytics Engineers who build and maintain the data infrastructure that fuels product innovation, operational excellence, and strategic insight. You’ll manage a team of high performing engineers and be responsible for the technical direction, team growth, and impact of Analytics Engineering across multiple domains. You’ll partner closely with Data Analysts, Product Managers and Software Engineers to scale our data capabilities and ensure Upstart makes decisions grounded in high quality, reliable data. How you’ll make an impact: Lead and Scale Team: Lead and grow a high performing team of Analytics Engineers, guiding them across technical execution, career development, and impact delivery. Set Technical Vision: Define and execute a strategic roadmap for Analytics Engineering, shaping architecture and modeling patterns that support trusted, scalable data assets used across domains. Enable Product and Business Impact: Ensure delivery of high quality data pipelines, models, and tools that improve operational efficiency, enhance decision making, and support product growth. Foster Cross Functional Partnerships: Collaborate with leaders in Analytics, Product, Engineering, Machine Learning and Finance to align on priorities, manage dependencies, and influence roadmaps. Uphold and Elevate Standards: Establish and enforce best practices in engineering, testing, documentation, observability, and stakeholder communication. Lead by example in code and technical reviews. What we’re looking for: Minimum requirements: 8+ years of experience in Data Engineering, Analytics Engineering, or Business Intelligence, with at least 3 years in people management. Strong technical background in SQL and dbt, with working knowledge of Airflow, cloud data warehouses (e.g., Databricks), and CI/CD practices. Experience designing data models, pipelines, and frameworks that support scalability and performance. Proven ability to lead project execution and drive outcomes across ambiguous, cross functional environments. Excellent communication and stakeholder management skills. Track record of developing engineers, setting clear expectations, and calibrating performance against defined competencies. Preferred qualifications: Experience in high growth, consumer tech or fintech environments. Advanced degree in a quantitative or technical field (e.g., Computer Science, Math, Engineering). Strong intuition for business impact and the role data plays in accelerating outcomes. Familiarity with upstream/downstream systems (e.g., APIs, product telemetry, ML workflows) and how analytics fits into broader data ecosystems. Position Location This role is available in the following locations: Remote, San Mateo, Columbus, Austin Time Zone Requirements This team operates across all U.S. time zones. Travel Requirements This team has regular on site collaboration sessions. These occur 3 days per quarter at an Upstart office. If you need to travel to make these meetups, Upstart will cover all travel related expenses. What you'll love: Competitive Compensation (base + bonus & equity) Comprehensive medical, dental, and vision coverage with Health Savings Account contributions from Upstart 401(k) with 100% company match up to $4,500 and immediate vesting and after tax savings Employee Stock Purchase Plan (ESPP) Life and disability insurance Generous holiday, vacation, sick and safety leave Supportive parental, family care, and military leave programs Annual wellness, technology & ergonomic reimbursement programs Social activities including team events and onsites, all company updates, employee resource groups (ERGs), and other interest groups such as book clubs, fitness, investing, and volunteering Catered lunches + snacks & drinks when working in offices At Upstart, your base pay is one part of your total compensation package. The anticipated base salary for this position is expected to be within the below range. Your actual base pay will depend on your geographic location–with our “digital first” philosophy, Upstart uses compensation regions that vary depending on location. Individual pay is also determined by job related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. In addition, Upstart provides employees with target bonuses, equity compensation, and generous benefits packages (including medical, dental, vision, and 401k). United States | Remote Anticipated Base Salary Range $186,100—$257,500 USD Upstart is a proud Equal Opportunity Employer. We are dedicated to ensuring that underrepresented classes receive better access to affordable credit, and are just as committed to embracing diversity and inclusion in our hiring practices. We celebrate all cultures, backgrounds, perspectives, and experiences, and know that we can only become better together. If you require reasonable accommodation in completing an application, interviewing, completing any pre employment testing, or otherwise participating in the employee selection process, please email candidate_accommodations@upstart.com https://www.upstart.com/candidate_privacy_policy show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4263502249/"
    },
    {
      "job_title": "Senior Demand Generation Manager",
      "company": "ClickHouse",
      "description": "About ClickHouse Established in 2009, ClickHouse leads the industry with its open source column oriented database system, driven by the vision of becoming the fastest OLAP database globally. The company empowers users to generate real time analytical reports through SQL queries, emphasizing speed in managing escalating data volumes. Enterprises globally, including Lyft, Sony, IBM, GitLab, Twilio, HubSpot, and many more, rely on ClickHouse Cloud. It is available through open source or on AWS, GCP, Azure, and Alibaba. ClickHouse is looking for our first demand generation manager to drive brand new marketing initiatives. Your role is to strategically generate global pipeline and self serve MRR by building integrated marketing campaigns, intent based outbound and product led sales plays. We’re looking for someone who enjoys experimenting and building from the ground up. You’ll have the opportunity to try new, cutting edge marketing strategies and work with a passionate community of ClickHouse users. Experience with database or developer tooling companies is a must. What you will do: Design and execute integrated campaigns across key verticals and use cases, owning the full campaign lifecycle from strategy to execution and measurement. Lead competitive displacement campaigns targeting enterprises currently using Snowflake, BigQuery, or other database solutions, partnering with Product Marketing on developing messaging frameworks and building a tactic BOM to reach our target audience. Build multi touch campaign journeys that span events, webinars, content syndication, paid media, and email nurture sequences, ensuring consistent messaging and optimal touchpoint sequencing across the buyer journey. Collaborate with field marketing to integrate global integrated campaigns with regional event strategy, ensuring consistent messaging and lead capture optimization across all touchpoints. Leverage our CSP (AWS, GCP, Azure) partnerships to augment your campaigns, working closely with partner marketing and the partnerships team. You’ll have a pool of marketing funds to deploy with some of these partners. Own pipeline and demand funnel metrics. Consistently analyze conversion rates at each stage of the demand funnel, identifying bottlenecks and proactively implementing improvements to pipeline velocity and quality. Stay up to date with industry trends, competitor activities and emerging technologies in our space. Identify new demand generation opportunities and innovative approaches. Requirements: Minimum of 6 years of experience in demand generation or growth within the database or developer tooling space. Bonus if you have experience at a company with an open source product. Proven track record of developing and executing successful demand generation campaigns, resulting in measurable lead generation and revenue growth. Proficiency in Salesforce and Marketo. Prefer experience in intent based selling tools like Common Room. Analytical mindset with the ability to interpret data, identify trends, and make data driven decisions. Excellent written and verbal communication skills. Demonstrated ability to create engaging content targeting developers. Strong project management and organizational skills, with the ability to manage multiple campaigns simultaneously and meet deadlines. The typical starting salary for this role in the US is $115,000 $175,000 USD The typical starting salary for this role in US Premium Markets is $150,000 $200,000 USD Compensation For roles based in the United States, the typical starting salary range for this position is listed above. In certain locations, such as Los Angeles, CA, the San Francisco Bay Area, CA, the Seattle, WA, Area, and the New York City Metro Area, a premium market range may apply, as listed. These salary ranges reflect what we reasonably and in good faith believe to be the minimum and maximum pay for this role at the time of posting. The actual compensation may be higher or lower than the amounts listed, and the ranges may be subject to future adjustments. An individual’s placement within the range will depend on various factors, including (but not limited to) education, qualifications, certifications, experience, skills, location, performance, and the needs of the business or organization. If you have any questions or comments about compensation as a candidate, please get in touch with us at paytransparency@clickhouse.com. Perks Flexible work environment ClickHouse is a globally distributed company and remote friendly. We currently operate in 20 countries. Healthcare Employer contributions towards your healthcare. Equity in the company Every new team member who joins our company receives stock options. Time off Flexible time off in the US, generous entitlement in other countries. A $500 Home office setup if you’re a remote employee. Global Gatherings – We believe in the power of in person connection and offer opportunities to engage with colleagues at company wide offsites. Culture We All Shape It As part of our first 500 employees, you will be instrumental in shaping our culture. Are you interested in finding out more about our culture? Learn more about our values here. Check out our blog posts or follow us on LinkedIn to find out more about what’s happening at ClickHouse. Equal Opportunity & Privacy ClickHouse provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment of any type based on factors such as race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Please see here for our Privacy Statement. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4210781106/"
    },
    {
      "job_title": "Data Team Lead",
      "company": "Mainz Brady Group",
      "description": "Data Engineering Lead – Data & Intelligence We’re seeking an experienced data engineer to drive our strategy across business intelligence, machine learning, and GenAI. As we embed intelligence and automation into trading workflows, building reliable, high quality data infrastructure is mission critical—and this role leads that effort. Unlike orgs that split these functions, we value a hands on leader who understands both the data and its downstream use cases. You’ll work with software engineers, data engineers, data scientists, and quants, and help shape our technical direction. What You’ll Do Architect & build: Design and implement scalable, reliable data pipelines powering everything from BI dashboards to production ML/AI models. Own core infrastructure: Lead our cloud data warehouse, ETL/ELT orchestration, and real time processing stacks; define and execute the technical roadmap. Mentor & lead: Coach engineers and set best practices for code quality, testing, CI/CD, and operational excellence. Collaborate & deliver: Partner with Quant Researchers, ML Engineers, and business stakeholders to translate requirements into robust, production grade data solutions. Champion data quality: Establish data quality, governance, and observability standards to build trust with all data consumers. About You You’re a seasoned data engineering leader who thinks like an owner—strong analytically, pragmatic in problem solving, and focused on systems that stand the test of time. You’re comfortable setting technical direction, guiding architecture, and raising the bar for delivery. You see the full lifecycle—from raw ingestion to the models and dashboards that depend on it—and know that clean, well architected data is the foundation for every data driven initiative. Qualifications 7+ years designing, building, and productionizing data intensive systems. Proven experience mentoring engineers and leading complex technical projects. Expert level SQL and Python; deep familiarity with data manipulation libraries and backend patterns. Track record owning mission critical data platforms (data warehouses/lakes; ETL/ELT pipelines). Strong with modern batch processing & orchestration (e.g., Airflow, Dagster, Prefect). Experience with real time processing & messaging (e.g., Apache Kafka, GCP Pub/Sub). Bachelor’s or advanced degree in Computer Science, Engineering, Mathematics, Economics, or related field. Nice to Have Financial services or trading technology experience. ML/AI infrastructure exposure (feature engineering, model deployment, monitoring). Familiarity with GenAI/LLM ecosystem (vector DBs, RAG). Containerization & orchestration (e.g., Docker, Kubernetes). show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317955062/"
    },
    {
      "job_title": "Senior Manager, Commercial Analytics & Data Science",
      "company": "Cypress HCM",
      "description": "Senior Manager, Commercial Analytics & Data Science How you’ll make an impact: You will build machine learning models to answer key business questions impacting strategy and marketing spend allocation You will perform feature engineering and contribute to our feature store You will lead dashboard development and lead development of enhanced visualization tools Responsibilities: What you’ll do: Build advanced machine learning models to inform marketing tactics (examples: adaptive clustering, reinforcement learning, regression modeling, price elasticity modeling etc.) Execute sophisticated quantitative analyses and descriptive modeling to answer key business questions to shape business strategy. Use enhanced python based graphical visualizations to deliver key insights to leadership. Research and implement novel modeling techniques to solve complex business problems. Develop analytics databases & lead development and maintenance of automated dashboards for AB experiment results. Develop complex SQL queries combining data from a wide variety of sources in preparation of feature engineering or to perform analysis of business questions. Measure incrementality of paid media campaigns using matched market testing. Requirements: What you’ll need: Bachelor’s or Master's degree in data science, computer science, statistics, engineering, or related quantitative field. Strong prior experience in data science, business & statistical analytics. 7+ years of experience in related field. Strong background in SQL & Python, R is a plus. Experience in machine learning algorithms & libraries. Examples: CausalML/EconML, TensorFlow, PyTorch, Keras, sk learn, seaborn, LSTM, RNN. Experience in visualization tools. Examples: Databrick AI/BI, Rshiny, Dash, Tableau. Familiarity with Databricks platform is a plus. Willingness to take initiative and to follow through on projects. Excellent time management skills with the ability to prioritize and multi task, and work under shifting deadlines in a fast paced environment. Must have legal right to work in the U.S. Compensation: $100 to $105/hr. (W2) Job req# 1654 1 show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4311637824/"
    },
    {
      "job_title": "Growth Marketing Analytics",
      "company": "OnePay",
      "description": "About OnePay OnePay is a consumer financial services app with an exceedingly simple mission: to help people achieve financial progress. Tens Of Millions Of Americans Today Are Unbanked Or Underbanked, Meaning They Don’t Have Enough Money In Savings To Cover a Minor Emergency. They Pay Too Much In Fees, Don’t Have Access To Credit At Affordable Rates, And Have Little Ability To Grow Their Wealth. OnePay’s Vision Is To Create a Single App For Consumers To Save, Spend, Borrow, And Grow Their Money, Bringing Our Mission To Life With Simple And Accessible Banking, Credit, And Payments Products That Deliver a Best in class Experience To Millions Of Customers. Our Products Include Checking and high yield savings accounts Domestic and international peer to peer payments Credit Builder and credit score monitoring Digital wallet / contactless payment solutions Credit card program Buy now pay later installment loans at Walmart Prepaid mobile service Why do we have a right to win? We have the backing of Walmart (a Fortune 1) and Ribbit Capital (a preeminent fintech investor), are deeply embedded with the distribution of the world’s largest omnichannel retailer, and have an industry leading multi product value proposition — all in addition to having some of the best people and talent in the industry. There’s never been a better time to build a category defining business and there has rarely been a team better positioned for the opportunity. Join us! The Role In this Growth Marketing Analytics role your mandate will be to drive data driven decisions in our Paid Media strategies across search, social, affiliates and other paid media platforms. You’ll play a critical role in helping us optimize our media investments, improve our customer acquisition efficiency, and drive smarter decision making with data. You’ll work closely with our Growth Marketing, Analytics Engineering and Finance teams. This Role Is Responsible For Analyzing performance across all paid marketing channels (search, social, affiliates), focusing on down funnel metrics such as CAC, ROAS, and conversion quality to optimize our investment decisions. Identifying actionable insights and partnering with our Growth Marketing team to continuously optimize spend and targeting. Design and lead a wide ranging testing agenda, including geo lift tests and holdouts, to better understand the true impact of upper funnel investments. Build and maintain predictive models to power advanced bidding strategies, including Value Based Bidding (VBB) and projected ROAS frameworks. You Bring 7+ years in Paid Media or marketing analytics roles Experience working in an analytical scripting language (primarily SQL) is a must with concrete understanding of common statistical methods and experimentation, with strong focus on incrementality testing. Experience with platforms such as GA4 a plus, but the core requirement of this role is advanced SQL experience Experience with App Based Marketing (Android + iOS), UAC/ASA, Paid Social (Meta Ads / TikTok), Paid Search, Google Ads OLV/Streaming Audio & Affiliates experience is a plus Strong written and verbal skills inclusive of the ability to distill technical subjects for non technical audiences and effectively communicate findings to stakeholders and executive leadership. Strong drive and sense of ownership to autonomously drive analysis and projects. What We Offer Competitive base salary, stock options, and health benefits from Day 1 401(k) plan with company match Remote friendly (US), flexible time off (FTO), and opportunities for growth A high growth, mission driven, inclusive culture where your work has real impact. Standard Interview Process Initial Interview with Talent Partner Technical or Hiring Manager Interview Team Interview Executive Interview Offer! Equal Employment Opportunity To build technology and products that are used and loved by people and solve real world problems, we need to build a team with many different perspectives and experiences. We are an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us at talent@onepay.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4296318776/"
    },
    {
      "job_title": "Director, SEO Data Analytics & Insights",
      "company": "Raptive",
      "description": "Raptive is seeking an analytically driven professional with deep expertise in data analysis and SEO to power our data, insights, and tooling efforts across one of the internet’s largest creator networks. This is a senior, hands on role: you’ll work directly with large datasets, write SQL/Snowflake queries, QA pipelines, and run advanced statistical analyses, while also shaping methodologies, guiding peers, and partnering with product and engineering teams to scale our SEO products and creator recommendations. We’re looking for someone who thrives at the intersection of data rigor and SEO impact—a player coach who can dig into the data, but also ensure insights translate into scalable recommendations that improve creator outcomes and business growth. Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. What you’ll be doing Hands on analytics: Dive into SEO datasets with SQL/Snowflake, Python, and scripts to uncover opportunities, validate data quality, and inform recommendations. QA and trust: Build and maintain frameworks for validating data pipelines, ensuring accuracy and confidence in SEO tooling outputs. Data to action: Translate analyses into actionable insights that improve creator outcomes, audience growth, and product performance. Cross functional partnership: Collaborate with product and engineering to define, test, and refine SEO tools, dashboards, and recommendation engines. Guidance & best practices: Provide technical and analytical mentorship to teammates, setting standards for excellence. Innovation: Introduce automation, AI (e.g., ChatGPT prompting), and advanced statistical methods to accelerate and deepen insights. Stakeholder communication: Clearly articulate findings to SEO leadership, product managers, and other stakeholders—bridging technical details with business outcomes. The skills and experience you bring to the job 7+ years of experience in a data analytics or data science role, preferably within digital media, publishing, or SEO driven industries. Passion for and proficiency in data, reporting, and business growth. Strong hands on skills in SQL (Snowflake preferred), Python (pandas, forecasting/statistics), and data QA. Solid foundation in statistics and experimental design, with proven ability to validate and interpret results with accuracy and attention to detail. Experience in an SEO or data related role, with a genuine interest in understanding audience content consumption habits. Proficiency in data visualization tools (Sigma, Looker, Tableau, Power BI, advanced Excel). Comfort working with APIs, web scraping, and automation scripts. Strong verbal and written communication skills; able to bridge technical and non technical audiences. Creativity, self sufficiency, and eagerness to learn; methodical and logical in approach. Bonus points: Experience with data science techniques such as NLP, machine learning models, or advanced forecasting. About Raptive Raptive is a new kind of media company built for creators and home to one of the largest and most diverse audiences on the internet. Raptive combines its position as the world’s largest ad management platform with a comprehensive suite of monetization, audience and business solutions that enable creators to turn their passions and talents into thriving independent companies and enduring brands. We stand for the future of a diverse, open internet powered by the creativity and entrepreneurship of the independent creators and publishers it serves. To date, Raptive has paid over $2.5 billion to thousands of independent creators. Join us in creating a more equitable and inclusive future for media. Raptive was recognized as a Fortune 100 Best Places To Work for 2024 2025. The base salary range for this position is $130,000 $180,000. The range provided is Raptive’s reasonable estimate of the annualized base compensation for this role. The actual amount may be higher or lower, based on non discriminatory factors such as experience, geographic location, knowledge, skills and abilities. This role is eligible for additional incentive compensation that isn’t included in the posted range. For more information, visit www.Raptive.com or follow us on LinkedIn or Instagram. Raptive is committed to diversity, equity, and inclusion. We believe we are most impactful when people with a wide range of backgrounds, experiences, and identities come together with a common purpose. We encourage candidates from all backgrounds to apply. Raptive is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please reach out to a member of our recruiting team. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4310444055/"
    },
    {
      "job_title": "Head of Data",
      "company": "Fundraise Up",
      "description": "Highlights OTE: $245,000 $272,000 Base Salary: $175,100 $190,400 Stock options About Us At Fundraise Up, we are reimagining the fundraising platform to create the most convenient and fastest way to donate to non profit foundations. Our innovation is aimed at enhancing loading speeds, boosting conversion rates, offering diverse payment methods, and more. Each month, individuals worldwide donate tens of millions of dollars through our platform. We are the go to fundraising solution for some of the world's leading non profit organizations. UNICEF, The Obama Foundation, the Alzheimer's Association, and many others leverage our platform for their online fundraising needs. About The Role We are seeking a strategic and hands on Head of Data to lead our end to end data strategy, performance analytics, and market intelligence initiatives. You’ll be responsible for building a unified data function that enables smarter go to market execution, revenue forecasting, customer insights, and competitive positioning. This is a high impact leadership role that bridges revenue, product, and strategic planning supporting decisions from tactical funnel conversion to long term market Key Responsibilities Build and lead the Revenue Intelligence function, owning the strategy, team, and roadmap across analytics, tooling, and governance Lead development of a centralized data architecture and reporting ecosystem, integrating sources like Salesforce, product usage data, and BI platforms (e.g., Looker, Tableau)Drive pipeline analytics, sales performance tracking, and forecasting accuracy for GTM leaders Lead end to end analysis of the AARR funnel (Acquisition, Activation, Retention, Referral, Revenue) to identify conversion and engagement opportunities Create and maintain TAM/SAM/SOM models to support market sizing, segmentation, and strategic planning Conduct PMF (Product Market Fit) assessments using customer usage, NPS, and engagement data to guide positioning and product strategy Deliver market share analytics and competitor benchmarks to inform positioning and growth potential Partner cross functionally with Finance, Product, and Marketing on strategic planning, pricing strategy, and go to market optimization Champion data quality and governance, ensuring teams operate from a single source of truth Translate complex data into clear, compelling executive insights that drive action and alignment Skills And Qualifications 8–12+ years of experience in analytics, revenue operations, or data leadership roles, ideally within high growth B2B SaaS or marketplace companies Proven track record of building and leading high performing teams across analytics, ops, and data engineering Deep knowledge of Salesforce, GTM tools, CRM analytics, and BI platforms (e.g., Looker, Tableau, PowerBI) Experience with AARRR funnel frameworks and GTM performance measurement Strong analytical modeling experience, including TAM/SAM frameworks, PMF evaluation, and market share estimation Proficiency with SQL or equivalent data querying, or experience leading technical teams that build data pipelines Bonus Points Business first mindset with excellent communication skills; comfortable influencing C level stakeholders Experience working cross functionally across Sales, Marketing, Finance, and Product teams High bias for action, with the ability to bring structure to ambiguity and drive results through data Benefits Health, Dental, and Vision insurance covered at 100% for employees, 80% for employee plus dependents, and 70% for employees plus family. FSA Spending Account. Remote or Hybrid work. Our teams are spread globally. 15 days of vacation, 7 company holidays plus an additional 3 floating holidays and 5 sick days. 401(k) plan with company match. 100% Company paid short term disability, long term disability, basic life insurance and AD&D. Paid parental leave (12/6 weeks). Please note: All official correspondence from Fundraise Up will exclusively originate from the @fundraiseup.com domain. Exercise caution and ensure the authenticity of emails claiming to be from our company. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4267605997/"
    },
    {
      "job_title": "Vice President, Strategy & Analytics",
      "company": "Influential",
      "description": "We are seeking a VP, Strategy & Analytics to lead and drive a high performance team that delivers best in class strategy and insights to ensure our clients’ business goals are achieved. This role will bring operational and strategic excellence across a variety of verticals targeting Fortune 500 brands. This role will partner across functions to bring the very best innovation, intelligence and strategies for overall team and client success. This role demands a leader with a robust blend of strategic thinking and executional excellence, capable of transforming data and insights into compelling strategic plans that fulfill upon our high standards for growth. In general, a typical day will include: Lead the Strategy & Analytics vision, setting the standard for and driving the impact of the function in campaign and client excellence. Develop and implement a strategic planning process that is scalable and adaptable to our clients goals and ensures effective and consistent standards across all portfolios. Contribute to brand strategy, developing relationships with clients across all levels and functions, leading and developing the strategic competency of the team. As the recognized expert and leader in the space, drive innovation and Thought Leadership both as a new business asset and across our team to drive modern and effective solutions for our clients. Utilize your exceptional data storytelling and problem solver skills to present powerfully to high profile clients and stakeholders, driving current and new business opportunities. Write and deliver strategies and POV’s that support and drive client recommendations. Foster a collaborative environment across the immediate department and all teams within the company to ensure cohesive and impactful campaign delivery. Provide vision, direction, coaching and management to individuals within the team to ensure their work aligns with our mission, goals and values. Be a resource to support and develop the internal teams overall competency, presence and technical expertise to expand and grow the impact across the business and our clients results. Stay ahead of industry trends, emerging technologies, and best practices to continually push the boundaries of strategy & insights. Being a Vice President, Strategy & Analytics requires: At least 10 years of experience in strategy with progressive levels of responsibility 5+ years of previous management experience, established skillset in creating a team culture that fosters collaboration and high performance Adept and interested in proactively leading and elevating strategic thinking across a portfolio of brands and leading projects Competent in identifying meaningful, useable, and impactful insights Able to translate data into viable business solutions to enhance strategies and meet deliverables. Ability to anticipate and quickly assess continually changing client needs and adapt resources and strategies accordingly. Proven track records of strategically aligning plan campaigns with client strategic goals and KPIs Well versed in client pitches, exceptional communication and presentation skills and able to command a room and influence Excellent written communication, organizational, interpersonal and analytical skills A proactive action oriented mindset with the ability to create and implement processes to enhance strategic output The ability to operate effectively within the unknown and lead the charge Experience at agency, marketing tech or media start up desirable Salary range: $170,000 $210,000 show less",
      "date_posted": null,
      "location": "New York City Metropolitan Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319272804/"
    },
    {
      "job_title": "Sr. Manager, Marketing Science",
      "company": "Apex Systems",
      "description": "Apex Systems is currently hiring for a Sr. Manager Marketing Science with a large retail client. Qualified candidates will have the following experience and skills: 8+ years of experience in data science, measurement, or analytics, with a preference for experience in retail, ecommerce, CPG, retail media, or media agencies. Experience working with a wide range of audience and measurement methods, including attribution, incrementality, as well as control, media mix modeling, propensity etc. Excellent communication and presentation skills, with the ability to present complex concepts and technical information to diverse audiences. Experience working in a fast paced, dynamic environment, managing multiple stakeholders, and competing priorities. Knowledge of retail media would be nice to have! Please note: this in an individual contributor role. Location: Remote in the US Pay range: $70 85/hour. If you are interested, please apply here! Apex Benefits Overview: Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide. EEO Employer Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystems.com or 844 463 6178. Apex Systems is a world class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319914697/"
    },
    {
      "job_title": "Senior Manager, Sales Operations and Planning",
      "company": "Zillow",
      "description": "About The Team Zillow Home Loans (ZHL) provides customers with a streamlined option for their home financing needs. By utilizing Zillow's home buying expertise and cutting edge technology, we’re working to create an easier, smoother ‘check out’ experience for real estate transactions. The Business Operations (“BizOps”) team serves as the central nervous system of ZHL, responsible for defining and delivering ZHL’s next phase of evolution and growth. This team focuses on our most critical and strategic cross company projects, ranging from overall company strategy to owning key strategic projects in partnership with senior most leaders across Zillow Group. About The Role Zillow Home Loans is seeking a highly analytical, strategic, and collaborative Senior Manager to build and lead the Sales Operations and Planning team within Sales Operation. This team will be focused on data driven decision making to optimize performance for our sales organization. This role is pivotal in driving business insights, shaping sales strategies, and enabling data fluency across sales leadership, broader Business Operations, and our support functions. You will lead a team of analysts and work cross functionally to deliver high impact analyses, business recommendations, and frontline reporting that enhance our mortgage sales effectiveness and support Zillow’s broader mission to simplify real estate transactions. What you’ll do: Team Leadership: Build a high performing Sales Analytics function within ZHL’s Sales Operations team & partner with Sales leadership to optimize sales performance and drive adoption of frontline reporting and tooling Senior Stakeholder Management:: Develop and present impactful analyses, dashboards, and strategic recommendations to senior executives and stakeholders Cross functional Leadership: Act as a strategic partner to Sales, Finance, Marketing, and Product teams to align on initiatives, share insights, and drive operational excellence. Sales Performance: Own and be accountable for driving sales productivity improvements across core sales metrics; lead business review meetings with frontline sales leaders to ensure reinforcement of core sales metrics and sales motion improvements Sales Tooling: Partner with Business Analytics and Data Engineering to design and maintain scalable reporting solutions on core KPIs including lead conversion, pipeline velocity, rep performance, and partner engagement Headcount & Territory Planning: Own the analytical framework for capacity management, including regional headcount and territory planning to enable load balancing and business growth This role has been categorized as a Remote position. “Remote” employees do not have a permanent corporate office workplace and, instead, work from a physical location of their choice, which must be identified to the Company. U.S. employees may live in any of the 50 United States, with limited exceptions. In California, Connecticut, Maryland, Massachusetts, New Jersey, New York, Washington state, and Washington DC the standard base pay range for this role is $144,800.00 $231,200.00 annually. This base pay range is specific to these locations and may not be applicable to other locations. In Colorado, Hawaii, Illinois, Minnesota, Nevada, Ohio, Rhode Island, and Vermont the standard base pay range for this role is $137,500.00 $219,700.00 annually. The base pay range is specific to these locations and may not be applicable to other locations. In addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location. Actual amounts will vary depending on experience, performance and location. Employees in this role will not be paid below the salary threshold for exempt employees in the state where they reside. Who you are 10+ years of relevant experience, preferably within high growth startups, fintech, investment banking and/or management consulting 5+ years of experience as a sales operations manager with experience working with a high velocity, high volume sales team 3+ years of people management experience Expertise in sales analytics or revenue operations; experience in the mortgage, fintech, or high growth SaaS industries preferred Experience partnering with front line sales leaders to drive sales performance and operational excellence Strong program management skills with experience leading end to end execution of projects/programs that have transformed company operations and delivered quantifiable business impact Advanced knowledge of SQL, Excel, and data visualization tools (e.g., Tableau, Power BI); familiarity with Python or R is a plus Solid understanding of CRM systems (e.g., Salesforce), contact center metrics, and customer lifecycle analytics. First principles thinker (e.g., ability to question how we are working rather than simply executing) Excellent written and verbal communication with strong executive presence An ability to execute with minimal guidance, and in contexts with a high degree of ambiguity Bachelor’s degree required, MBA preferred Get to know us At Zillow, we’re reimagining how people move—through the real estate market and through their careers. As the most visited real estate platform in the U.S., we help customers navigate buying, selling, financing and renting with greater ease and confidence. Whether you're working in tech, sales, operations, or design, you’ll be part of a company that's reshaping an industry and helping more people make home a reality. Zillow is honored to be recognized among the best workplaces in the country. Zillow was named one of FORTUNE 100 Best Companies to Work For® in 2025, and included on the PEOPLE Companies That Care® 2025 list, reflecting our commitment to creating an innovative, inclusive, and engaging culture where employees are empowered to grow. No matter where you sit in the organization, your work will help drive innovation, support our customers, and move the industry—and your career—forward, together. Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact your recruiter directly. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable state and local law. Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271016390/"
    },
    {
      "job_title": "Revenue Analytics Manager",
      "company": "Stripe",
      "description": "Who we are About Stripe Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career. About The Team Our Revenue Analytics team is on a mission to maximize revenue by providing insightful analyses and reporting to our partners across Sales and GTM (go to market) Operations. The team sits within GTM Analytics, which is situated within the broader Data Science organization at Stripe. It is home to a diverse team of data analysts, data scientists, and engineers that span their focus across Sales, Marketing, and Growth. Revenue Analytics leverages sales, customer, and product data to build observability into Stripe’s business for users across our Sales organization from account executives through leadership. What you’ll do As a manager within our GTM Analytics team, you will lead and inspire a high performing team of data analysts to build and deliver data products to our key leaders across Sales and GTM Operations. You are a holistic thinker, are eager to create solutions, and like to continuously find ways for your team to improve. You will play a crucial role in driving revenue growth and operational efficiency through data informed strategies, ultimately impacting key business decisions that enhance performance across Sales and GTM Operations. We are committed to fostering a culture of continuous learning, and while you should already have a proven track record of building and leading teams, you will also have avenues to develop your leadership skills and industry knowledge further. Responsibilities Manage a team of diverse data analysts, acting as a player coach and partnering with them to go deep in developing expertise in Stripe’s business and GTM data. Collaborate with stakeholders across Sales, Marketing, and Finance teams to develop and execute on a robust roadmap that aims to arm our business partners with the data, analyses, and insights needed to run the business. Partner with the GTM Analytics Manager to create a long term strategy to evolve the maturity of Stripe’s GTM analytics tools, dashboards, and other data products. Encourage a culture of experimentation and innovation in data analytics practices to optimize performance and uncover new insights. Develop processes and norms that provide structure and elevate the work within the GTM Analytics team. Act as a thought leader in areas of data analysis, manipulation, visualization, and storytelling. Who you are We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement. Minimum Requirements Based outside of the Greater NYC, SF, or SEA metro areas At least 3 years of people management experience leading teams of 5 or more data analysts, as well as 5+ years of data analytics experience Experience building a team, defining its mission, and executing on its goals Bachelor’s degree in Statistics, Economics, Mathematics, Engineering, Sciences or a related quantitative field Proficiency in SQL Experience building and maintaining data pipelines using a distributed data framework (e.g. Hadoop, Spark) Experience building self serve dashboards or other scalable analytical tools for partner teams Strong knowledge of statistics Expertise in data storytelling and visualization, using data driven insights to deliver actionable recommendations and drive business goals Demonstrated experience of and interest in the public discussion of economic trends (whether as a data scientist, writer, researcher, or in another capacity) Demonstrated ability to lead and deliver on multiple projects with a high attention to detail Outstanding written and verbal communication skills Preferred Qualifications Master’s degree in Statistics, Economics, Mathematics, Engineering, Sciences or a related quantitative field and/or experience in working on data analytics in the tech field Proficiency in Python Hybrid work at Stripe This role is available either in an office or a remote location (35+ miles or 56+ km from a Stripe office). In office expectations Office assigned Stripes spend at least 50% of the time in a given month in their local office or with users. This hits a balance between bringing people together for in person collaboration and learning from each other, while supporting flexibility about how to do this in a way that makes sense for individuals and their teams. Working remotely at Stripe A remote location is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on sites, meet ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently live or plan to live. Pay and benefits The annual US base salary range for this role is $185,400 $278,200. For sales roles, the range provided is the role’s On Target Earnings (\"OTE\") range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process. Additional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends. Hybrid work at Stripe This role is available either in an office or a remote location (35+ miles or 56+ km from a Stripe office). In office expectations Office assigned Stripes spend at least 50% of the time in a given month in their local office or with users. This hits a balance between bringing people together for in person collaboration and learning from each other, while supporting flexibility about how to do this in a way that makes sense for individuals and their teams. Working remotely at Stripe A remote location is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on sites, meet ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently live or plan to live. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4277252374/"
    },
    {
      "job_title": "Senior Manager, Performance Marketing & Automation",
      "company": "Sears Home Services",
      "description": "We’re seeking a Senior Manager, Performance Marketing & Automation to lead strategy and execution across paid search, shopping, and programmatic channels for our In Home Appliance Repair and D2C Parts business units. This is an opportunity to shape the future of performance marketing at one of the most recognized household brands in America — and to build next generation automation and AI frameworks that drive measurable growth across 400+ markets. What You’ll Do Own end to end strategy and execution for paid search, product listing ads, Meta Shopping, and programmatic campaigns Manage lead generation programs with a focus on quality, volume, and cost efficiency Partner with Operations, Analytics, and Finance to translate insights into measurable outcomes Leverage AI, automation, and advanced bidding tools to scale campaign performance Analyze funnel data to uncover drop off points and optimize conversion at every stage Lead forecasting, budget management, and ROI analysis for a $20M+ portfolio Develop and implement testing roadmaps across creative, audience, and messaging Introduce and scale automation to drive efficiency and improve marketing impact What You’ll Bring 7+ years of hands on experience in paid search, PLAs, Meta Shopping, and programmatic media Proven success in AI driven performance optimization and automation Strong background in lead generation marketing — ideally in home services or multi location businesses Experience managing large scale budgets ($1M+/month) and forecasting with Finance partners Analytical mindset and a deep understanding of full funnel conversion performance Hands on expertise with Google Ads, Meta Ads Manager, DV360 (or similar DSPs), and analytics tools Why Join Us At Sears Home Services, we’re combining a legacy brand with modern marketing innovation. You’ll have the opportunity to: Work with a national footprint and AI first approach Shape a high impact, scalable performance marketing engine Drive real business outcomes and lead automation transformation across teams Ready to lead the next evolution of digital performance marketing? Apply now and help shape the future of a trusted American brand. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4314684046/"
    },
    {
      "job_title": "Growth Marketing Manager",
      "company": "Thoropass",
      "description": "Working at Thoropass Thoropass makes it as easy to do the right thing as it is to check a box. Our team members believe that partnership lightens the load. Not everyone can be an expert at everything – lending each other support in areas of weakness strengthens everyone’s offering. We collaborate openly and enthusiastically; without ego. What We Do At Thoropass, we’re compliance experts, so you don’t have to be. Pairing easy software that’s always getting smarter with expert guidance and continuous monitoring, we integrate into your process to prepare you to pass any audit, every year, with flying colors. Hundreds of growing companies use Thoropass’s compliance automation platform, expert services, auditors, and partner ecosystem to get and stay compliant over the lifetime of their business. We are a rapidly expanding team based in New York. We were founded in May 2019 and raised our Series C funding in November 2022. Our top investors include J.P. Morgan, PayPal Ventures, Fin Capital, Centana, and Bain Capital. We're growing customers and revenue dramatically, and we’re poised for continued break out growth in 2025 and beyond. About The Role Thoropass is seeking a results driven Growth Marketing Manager to lead the execution of a comprehensive, multi channel strategy to fuel our growth. As part of our Growth team, you’ll collaborate cross functionally with Sales, Product Marketing, and Content to generate pipeline from target mid market and enterprise prospects. This role requires a builder mindset and thrives in ambiguity. You’ll join a high performing, AI forward team transforming how marketing drives outcomes—from zero to one. This is a hybrid strategy and execution role where you’ll shape campaigns, analyze performance, and drive revenue impacting initiatives across paid, email, events, SEO, the Web and more. This role will report to the Director of Demand Generation and may manage 1–2 reports over time. What You’ll Do Own and Execute Demand Generation Strategy Lead integrated campaigns across paid media (Google Ads, LinkedIn, Bing), SEO, email nurtures, events, content syndication, and webinars. Design and optimize a range of inbound programs that convert MQLs to SQLs at an improved rate. Build and manage top of funnel acquisition strategies to generate high intent leads. Execute and analyze dedicated sends, segment based newsletters, and nurture campaigns and sequences. Campaign Performance & Reporting Oversee lead lifecycle management, campaign attribution and analysis. Present weekly campaign updates to GTM leadership including Sales and Finance. Build dashboards and lead attribution reporting in HubSpot and Salesforce. Review inbound SQLs to validate attribution and lead quality. Collaborate with RevOps to maintain campaign tracking infrastructure, UTM hygiene, and attribution logic. Cross functional Collaboration Align with Product Marketing to create content and campaigns that resonate with target personas and industry segments. Partner with SDRs and Sales to execute signal based outreach and gifting strategies. Participate in marketing planning to align demand gen with broader GTM efforts. Share insights and content with Sales Enablement to support pipeline acceleration. Innovation & Channel Optimization Lead CRO testing initiatives, from ideation to execution on landing pages and emails. Stay on the cutting edge of demand gen tactics, AI tools, and martech to improve efficiency and performance. Collaborate with our SEO agency and internal SMEs to optimize content and improve search visibility. About You Proven Demand Generation Expertise: You have 4 6 years of experience leading B2B SaaS demand generation programs that measurably increase qualified pipeline and revenue. You’ve owned multi channel campaigns across paid media, SEO, events, webinars, and email. Strategic and Execution Oriented: You thrive in both strategic planning and hands on campaign execution. You know how to build scalable demand programs from scratch and continuously improve them based on performance. Analytical and Performance Driven: You love working with data and use it to optimize campaigns, improve conversion rates, and influence pipeline outcomes. You have strong experience with HubSpot, Salesforce, and marketing attribution models. Collaborative and Cross Functional: You work well with Sales, Product Marketing, Content, and RevOps. You know how to translate marketing strategy into campaigns that Sales can act on—and you actively seek their feedback to improve. Adaptable Builder Mentality: You’re energized by change and excited to help build a modern demand generation function in a fast scaling company. You’re proactive, resilient, and comfortable navigating ambiguity and iteration. Audience Led and Customer Centric: You bring a deep curiosity for understanding our target customers, their segments, and their journey. You tailor programs that resonate across verticals and deliver value at every touchpoint. Qualifications 5 7 years of B2B SaaS demand generation experience with clear ownership of multi channel programs Track record of driving pipeline growth and improving MQL to SQL conversion through targeted, data driven campaigns Hands on expertise with key tools: HubSpot, Salesforce, Google Ads, LinkedIn Campaign Manager, Google Analytics Experience managing and optimizing paid media, GEO and SEO initiatives, including agency collaboration Familiarity with lead lifecycle definitions, scoring, and automation workflows Strong analytical skills—comfortable building and interpreting campaign dashboards and attribution models Experience building or refining programs in evolving, high growth environments Bonus: Experience with tools such as Keyplay, Clay, Opensense, or Qualified is a plus Compensation Base Salary: $110,000 $140,000 plus performance based bonuses, based on experience Immediate access to health, vision, and dental benefits Equity in a fast growing company Remote work opportunity Unlimited PTO Equal Opportunity Thoropass provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Even if you feel you don’t meet every requirement, consider applying! Thoropass acknowledges the research which shows that women and people of color are less likely to apply for jobs when they don’t meet all of the stated qualifications. However, we’re looking for authentic innovators to blaze new trails and you just may be the right person for this or another role. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4265694976/"
    },
    {
      "job_title": "Reporting & Analytics Manager",
      "company": "Hale International",
      "description": "Reporting & Analytics Manager $165,000 + Bonus Fully Remote I'm partnered with a fast growing technology company who are seeking a Reporting & Analytics Manager to join their expanding team. This is a brand new role, created to enhance and scale their Workday reporting and analytics capabilities as they continue their impressive growth across the US. This company has built a culture where speed is a habit, empowering creative problem solvers who thrive in fast paced, high impact environments. Job Responsibilities: You will take ownership of Workday reporting across the full HCM suite, including Core HCM, Compensation, Benefits, Payroll, Talent, Performance, Absence, and Time Tracking Lead all Workday reporting across HCM, including Basic, Advanced, Matrix, Composite, and Dashboards Partner with stakeholders to gather requirements and translate them into scalable Workday solutions Support the upcoming Workday PRISM implementation You’ll work closely with a tight knit, high performing HR tech and operations team who value pace, accountability, and collaboration Key Requirements: 6+ years of reporting experience, including at least 4 years of Workday experience Experience creating Advanced, Matrix, Composite, and Dashboard reports PRISM experience is advantageous, but not essential This is a rare opportunity to join a fast moving technology company with a genuine culture of innovation and empowerment. You’ll have the freedom to shape how data is used across HR and will have the opportunity to learn Workday Extend and PRISM. If you feel that your experience aligns with this opportunity, I would love to hear from you! show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4309270084/"
    },
    {
      "job_title": "Director of Performance Marketing",
      "company": "Future-Able",
      "description": "Future Able is looking for a Director of Performance Marketing (Paid Media & Acquisition) to work for: Naked & Thriving A fast growing, mission driven skincare brand rooted in clean, high performance ingredients and purposeful sustainability. The Role Naked & Thriving is seeking a Director of Performance Marketing to build and scale our acquisition engine. As a high growth DTC brand with premium, naturally derived skincare products, we’ve built a loyal community and we’re now looking to take customer acquisition to the next level. This role will lead the next phase of growth by owning our performance marketing strategy, diversifying channels, and turning data driven insights into action. This is a hands on leadership role. You’ll not only set the strategy but also partner with internal creative and external partners to test, optimize, and scale paid campaigns. You’ll build the roadmap, frameworks, and reporting discipline needed to maximize ROI today while laying the foundation for sustainable growth tomorrow. Reports to: CEO (works closely with Creative Director, Director of Brand, Director of Retention, Fractional CFO, and COO.) Key Responsibilities: Own paid media strategy across Meta, Google, Amazon, TikTok, YouTube, and emerging channels. Drive disciplined testing, attribution, and funnel optimization to scale customer acquisition and balance efficiency (CAC, ROAS, MER, etc.) Partner with the Brand Director, Creative Director and Performance Creative Lead to ensure ads are data driven, and brand aligned. Collaborate with analytics support to develop dashboards, cohort analysis, and audience segmentation; translate insights into action. Oversee internal acquisition team and external partners holding them accountable for measurable results. Create testing roadmap and forecasts for emerging channels Align cross functionally with brand, creative, and retention teams to maximize CAC/LTV efficiency. Qualifications: 6–10+ years in performance marketing, with proven experience scaling a DTC e commerce brand. Deep expertise in Meta and Google ads; experience diversifying into TikTok, YouTube, affiliate. Strong command of growth KPIs: CAC, LTV, ROAS, CTR, CPM, thumbstop rate, AOV. Hands on experience with creative testing frameworks and performance driven creative strategy. Strong vendor management skills; proven ability to drive results through agencies and partners. Collaborative leader, fluent in data and creative, with entrepreneurial drive. What Success Looks Like: Scale paid acquisition on existing and emerging channels with sustainable KPIs Testing roadmap and reporting cadence are in place, consistently executed, and evolved based on learnings. Meta, Google, and Amazon campaigns are optimized through systematic testing. Meaningful channel expansion into YouTube, TikTok, Pinterest, etc. Leadership team has clear visibility into forecasting and results. What We Offer: Base Salary Range: $140K – $170K (commensurate with experience, location, and qualifications) Bonus: Performance based bonus tied to topline growth and profitability goals Benefits: Health, vision, dental, PTO, product allowance, remote first culture Opportunities to grow with a rapidly scaling company that’s redefining clean beauty Explore the brand at: www.nakedandthriving.com #PerformanceMarketing #CustomerAcquisition #GrowthMarketing #PaidMedia #PaidSocial #EcommerceMarketing #DigitalAdvertising #DTC #Skincarejobs #marketingjobs #MetaAds #GoogleAds Follow Future Able on LinkedIn for more mission driven growth and marketing roles. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4308701708/"
    },
    {
      "job_title": "Growth Lead",
      "company": "Mechanism Ventures",
      "description": "Department: Growth Location: Remote United States Compensation: $160,000 $200,000 / year Company Description In 2019, we started building profitable startups from scratch. We brought together top engineering minds from places like Princeton and MIT to drive the highest success rate in the industry and turn company building into a science. During that time, we’ve built ten high growth companies, driving $200M+ in revenue. Along the way, we’ve developed an engineering approach to entrepreneurship rooted in algorithms and advanced mathematics. Now, we’re working to automate company building to the point that we can press a button to launch profitable companies—ventures that can reinvest their own resources to become enterprises that help millions, or even billions, of people. Position Description We are seeking a Growth Lead to serve as a high impact operator and strategic thought partner across the Mechanism portfolio. Your mission is to act as a 'special operator' for growth—deploying into our portfolio companies to solve their most complex challenges and unlock non linear EV growth. This is a hybrid role. You will alternate between acting as a hands on operator (stepping in to lead growth during a critical 0 to 1 phase or a high stakes turnaround) and a systems architect (codifying your learnings into reusable, compounding playbooks that make the entire Mechanism OS smarter). This is not a fit for a specialist. We are looking for a true growth generalist who thinks like a founder, operates with a clear understanding of business fundamentals (unit economics, P&L), and is obsessed with generating measurable, compounding results. Three Key Missions Drive Growth Through Strategic Experimentation & Analysis: Design, execute, and analyze high impact growth experiments across portfolio companies. Apply advanced quantitative and attribution models to uncover causal drivers, optimize performance, and deliver measurable outcomes. Operate & Scale Portfolio Businesses: Step into leadership roles when needed, bringing entrepreneurial judgment and operational rigor. Leverage expertise in unit economics, monetization, retention, and performance marketing to stabilize operations and drive sustainable growth. Build Growth Systems & Leverage AI Innovation: Develop reusable playbooks, testing frameworks, and scalable models that elevate growth across multiple startups. Harness AI tools for automation, predictive modeling, creative testing, and performance insights to accelerate portfolio wide impact. What You’ll Do Act as a Deployed Operator: Step into portfolio companies as an interim growth leader to solve their most critical problems—whether it's cracking a new acquisition channel, fixing broken unit economics, or navigating a high stakes pivot. Engineer Compounding Impact (Portfolio Enterprise Value): Design and execute high velocity, rigorous experiments across the portfolio to find and scale new growth levers. Your focus is not on one off wins, but on discovering repeatable, high leverage strategies. Build the Playbook: Codify every learning from your engagements into reusable frameworks, systems, and playbooks. Your primary output is not just the result of your work, but the system you leave behind that makes the entire portfolio smarter. Serve as a Strategic Advisor: Act as a trusted thought partner to our portfolio CEOs, helping them deconstruct complex growth problems, identify leverage points, and make high consequence decisions with intellectual honesty. What You’ll Bring Proven Growth Leadership: 5+ years operating in startups and high growth environments with direct P&L ownership, stabilizing businesses at inflection points, and driving sustainable scale. Full Stack Growth Expertise: Fluency across acquisition, lifecycle/CRM, product led growth, and performance marketing, with end to end CRO rigor and comfort across major channels. Analytical Depth: Mastery of measurement frameworks (MTA, incrementality, geo lift), statistical testing, and revenue reconciliation—paired with strong modeling skills (LTV, CAC/payback, forecasting, retention). AI First Operator: Hands on experience using AI to accelerate experimentation, automation, personalization, and predictive insights. Playbook Builder: Habit of codifying learnings into frameworks, systems, and operating cadences that scale across companies. Entrepreneurial Mindset: Bias to action, accountability, and continuous improvement—paired with curiosity, humility, and drive to build enduring companies. Time Commitment This role is full time and requires significant overlap with US Eastern Time hours. It demands dedication beyond the standard 9 to 5 — we need someone eager to drive impact and outcomes in a fast moving environment. Location We are fully remote — work wherever you are most productive. Please note: we are unable to provide visa or work permit sponsorship at this time. Compensation Our compensation packages are designed to make this your dream job for both the short and long term. Packages include: Competitive base salary Equity in all active portfolio companies and any launched during your tenure For candidates located in New York, Washington, Colorado, California, and Illinois, the base salary range is $160,000–$200,000. Compensation may vary outside this range based on qualifications, experience, and location. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4289164249/"
    },
    {
      "job_title": "Director, Acquisition Marketing",
      "company": "NinjaTrader",
      "description": "Disclaimer: Please be advised that the most accurate and up to date information about our open roles—including job descriptions, compensation, and benefits—can only be guaranteed on our official job board. For the latest listings and details, please visit: https://job boards.greenhouse.io/ninjatrader. JOIN US ON OUR MISSION TO BECOME THE #1 RETAIL TRADING PLATFORM IN THE WORLD Welcome to the dynamic world of NinjaTrader! As an industry leading trading platform and futures broker, we're on a mission to empower traders to take control of their financial destiny. How do we do it? We provide cutting edge products and services that enhance the trading journey. Whether a seasoned pro or just starting out, NinjaTrader equips traders with award winning software and brokerage services to navigate the world's leading financial markets with confidence. Our growth story is nothing short of exhilarating. Over the last 20 years, NinjaTrader has been dedicated to understanding and supporting traders on their journey toward trading triumph. In the last five years alone, our user base has grown by 400% to over 1.9 million users and we have become the number one rated futures brokerage worldwide. But we're not stopping there. We're constantly evolving, pushing boundaries, and modernizing the futures industry. Our commitment to innovation means users will always have access to dynamic tools, real time support, and a community of like minded traders. So, why work at NinjaTrader? Here, you're not just part of a team; you're part of a movement. We empower employees to reach new heights in their careers by providing a dynamic culture focused on social connection, professional development, and employee recognition initiatives. Sounds too good to be true? Take it from our employees. Join us as we redefine what's possible in trading, advocate for our customers, and continue our journey toward becoming the world's top retail focused trading platform in the world. What you’ll do: As Director, Acquisition Marketing at NinjaTrader, you will lead a high performance acquisition engine and be at the tip of the spear for efficient core growth. You will manage and mentor a team, drive existing channels, and develop new ones. This is a highly impactful role where you will be key to delivering ongoing customer expansion and bottom line results. In this role you will: Oversee paid channels to build a diversified, efficient, scalable, and high performing B2C growth engine Oversee a robust channel mix including Digital, Mobile, Social, Partner, and Affiliate channels Own execution of paid marketing support for product launches, competitions, promotions, and other major company initiatives Manage a large budget and ensure Growth Marketing hits acquisition targets with deep fluency in CPA, CAC, and LTV Optimize marketing mix using marginal CAC analysis Use marketing results, market trends, competitive intelligence, and user insights to inform sharp, data driven decisions Foster a culture of rigorous experimentation Manage a high performing marketing team and external agencies by providing strategic guidance, coaching, and clear accountability Ensure Growth Marketing has strong relationships with key platform and vendor partners while staying abreast of new ideas, developing tactics, and emerging technologies What you’ll need: 10 years of experience in growth or performance marketing roles, ideally in D2C subscription based or fintech businesses Highly analytical and data driven Proven track record of scaling customer acquisition programs with strong unit economics Proven ability to leverage data to drive measurable results and track accountabilities to ensure desired outcomes and ROI Deep expertise across desktop and mobile paid marketing (e.g., Google, Meta, iOS, Android) Strong understanding of CAC, LTV, ROAS, incrementality, and media mix modeling Strong business management experience including full responsibility and accountability for managing a substantial budget Experience managing and mentoring teams and working cross functionally across Product, Content, Sales, and Compliance Excellent strategic thinking with the ability to prioritize, make trade offs, and communicate clearly with stakeholders Bonus points for: Previous experience in B2C marketing for fintech companies Previous experience in the futures industry Compensation: The salary range for this role is $160,000 $180,000. In addition, this position will also receive an annual target bonus of up to 15%. Bonus pay at NinjaTrader is based on individual performance (50%) as well as company/team performance (50%). Salary and bonus earnings are only two components of the total compensation package offered by NinjaTrader. NinjaTrader offers a 401K plan through ADP under which the company will match up to 3.5% of employee contributions. Annual PTO allowance begins at 20 days per year (some positions may qualify for more) plus seven paid holidays. Additional details on our total compensation package and benefits are listed below. Our Core Benefits Include: Generous PTO 7 Paid Holidays Annually + 5 Conditional Holidays Annually 1 Service Day Annually 401k with 3.5% Company Match Paid Parental Bonding Leave Health, Vision, Dental Coverage Life and Disability Insurance Covered 100% by NinjaTrader We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4275389931/"
    },
    {
      "job_title": "Senior Product Manager PRM, Reporting & Insights",
      "company": "Muck Rack",
      "description": "Muck Rack is the leading SaaS platform for public relations and communications professionals. Our mission is to enable organizations to build trust, tell their stories, and demonstrate the unique value of earned media. Muck Rack’s AI powered, comprehensive, and integrated platform streamlines the PR workflow to help businesses generate positive media coverage, monitor mentions to manage brand reputation, and analyze PR’s impact on business outcomes. By combining media database, monitoring, and reporting into one dynamic platform, we empower teams to collaborate seamlessly, pitch effectively, and analyze results faster and more efficiently. Founder controlled, fully distributed, and growing sustainably, Muck Rack has received several awards for its unparalleled culture and product from organizations like Inc., Quartz, G2, and BuiltIn. We value resilience, transparency, ownership, and customer devotion, and infuse these values into everything we do. We’re looking for an experienced and collaborative Sr. Product Manager PRM, Reporting & Insights to join our Reporting team, which is primarily responsible for the suite of experiences that enable customers to effectively report on their coverage and PR efforts.. Reporting to our Sr. Director of Product, you’d join a 20 person Product team consisting of product managers, product operations, and product designers, all motivated to build a best in industry solution. As a Sr. Product Manager, you will collaborate cross functionally with our tech teams to build industry changing projects for how brands and agencies measure their impact in an evolving internet landscape. What you’ll do: Partner with product leadership to establish, validate, and sell a strategy for Reporting & Insights at Muck Rack, ensuring customers can effectively report on their coverage Project manage all Reporting & Insights projects, from scope to release, partnering with UX, go to market, product marketing, and revenue stakeholders Explore innovative solutions for a market that’s ripe for innovation, advocating for new possible approaches to old PR problems, and demonstrate an openness for leveraging AI to shape workflows in ways that provide clear value Identify, track, and report back on key product health metrics to showcase the effectiveness of our roadmap and build decisions, and prioritize necessary follow up work to close gaps Write clear requirements, and acceptance criteria to ensure tech teams have the clarity they need to deliver high quality outcomes for users and internal stakeholders Maintain the day to day backlog with the engineering teams, ensuring all tickets are prioritized and planned to meet targeted milestones Inform and manage project plans on more major projects to ensure cross functional dependencies are known and tracked, and define and track progress against project OKRs Communicate effectively with team members and key stakeholders to achieve project goals and to identify and mitigate risks as they arise Analyze and monitor qualitative and quantitative data on Muck Rack to identify product opportunities or gaps that help us to develop world class user experiences How success will be measured in this role: Successful roadmap delivery: In collaboration with others, the right projects are built in an effective way, as demonstrated by key feature adoption metrics and impactful movement on health metrics Customer First: communicate effectively with customers and have an understanding of how to synthesize across multiple sources of user data and feedback, and creatively connect it to product strategy and development Relationships: build strong relationships cross functionally and cross departmentally to ensure successful feature adoption If the details below describe you, you could be a great fit for this role: 4+ years product management, or equivalent professional SaaS experience in customer success, UX research, product operations, product marketing, or data analytics roles Proficiency in contributing to product development teams, from solution requirements to execution, and asynchronously breaking down product and technical requirements. Past experience with hybrid or distributed teams is a plus Experience in using product development tools (ex. JIRA, Shortcut or Linear), navigating product analytics (ex. Heap, Pendo), and collaborative tools (ex. Miro, FigJam, LucidCharts, etc.) Experience making sound and challenging prioritization decisions, and getting buy in from all stakeholders related to that decision. Experience working on a reporting suite of tools in some capacity, understanding the complexities of data visualizations, building effective dashboards, underlying data cleanliness, and more Strong self management practices with attention to detail Experience partnering strongly with customer success teams, and building up a strong knowledge of key pain points and opportunities Ability to distill business needs to support the product to meet those needs Experience working on a complex, data rich platform Familiar with SQL queries with exploratory data analysis Experience performing quality assurance (QA) testing to evaluate functionality and catch issues before they reach production Interview Overview Below you'll find an outline of the interview plan for this role. Please note that this is what we expect the process to look like; we may ask you for supplemental information or require an additional step before making a final decision. 30 min interview with a member of our Talent Team A 45 minute zoom interview with the hiring manager Peer interviews with several Product team members Final call(s) with executive team member(s) Salary In the US, the base salary for this role is $131,000 $147,000+, depending on skills and experience. We take a geo neutral approach to compensation within the US, meaning that we pay based on job function and level, not location. For all other countries, we have competitive pay bands based on market standards. For roles based in Canada, we offer a competitive salary range aligned with local market value. The base salary for this role in Canada is between $148,000–$165,000 CAD. Individual compensation decisions are based on a number of factors, including experience level, skillset, and balancing internal equity relative to peers at the company. We expect the majority of the candidates who are offered roles at our company to fall healthily throughout the range based on these factors. We recognize that the person we hire may be less experienced (or more senior) than this job description as posted. If that ends up being the case, the updated salary range will be communicated with you as a candidate. Why Muck Rack? Remote Work, Forever Fully distributed team with a permanent remote setup Home office stipend, phone and internet reimbursement, coworking membership Virtual and in person team bonding (lunches, events, competitions) Transparent & Fair Compensation Competitive geo neutral pay in the U.S. Annual reviews to ensure equity and market alignment Standardized bonus or commission structure 401(k) with employer contributions Equity opportunities Health & Wellness Comprehensive medical, dental, vision, disability, and life insurance for employees and dependents 100% premium coverage for individuals on high deductible plans 24/7 Virtual Care and Employee Assistance Program Employer funded HSA contributions and other pre tax benefits Quarterly wellness stipend and free Headspace subscription Time Off & Family Benefits 4+ weeks of PTO, plus paid sick and mental health days 13 paid holidays with the option to swap for personal days Up to 16 weeks of fully paid parental leave Learning and Development Transparent pathways for internal mobility and promotion Bi annual performance reviews, team workshops, and leadership training Unlimited access to Coursera and O’Reilly 2 additional PTO days annually for learning and development Inclusive, Customer First Culture Commitment to equity and valuing diverse perspectives Agile, founder led company focused on collaboration and innovation Trusted by 3,000+ companies worldwide Note: Benefits and compensation reflect offerings for U.S. based employees. Support is provided for employees in other locations, in compliance with local laws and regulations. While we are a fully distributed team, we do have limitations on where we can hire and maintain a list of acceptable working locations based on job function. If we are unable to hire in your current location for the role for which you applied, you will be notified via email. While we enjoy many benefits as a permanently distributed and remote company, we cannot always support relocation or extended travel and have guidelines in place to ensure compliant work away from your designated permanent residence. Please note: For detailed information regarding our GDPR and/or CCPA compliance policies, including how we handle personal data and privacy rights, kindly refer to the email correspondence accompanying this application. Muck Rack does not accept unsolicited resumes from search firms or any other third parties. Any unsolicited resume sent to Muck Rack will be considered Muck Rack property, and Muck Rack will not pay a fee should it hire the subject of any unsolicited resume. Muck Rack considers applicants for all positions on the basis of merit, qualifications, and business needs, and without regard to race, color, national origin, religion, sex, age, disability, sexual orientation, gender identity, alienage or citizenship status, ancestry, marital status, genetic predisposition or carrier status, veteran status, familial status, status as a victim of domestic violence, or any other status or characteristic protected by applicable federal, state, or local law. Note to applicants/job seekers: We have recently been made aware of scams impersonating Muck Rack’s HR team. Please be cautious of these attempts to elicit banking or other financial or sensitive information. Muck Rack will never request financial information during the interview process, and follow ups for interviews or next steps will always come from an ‘@muckrack.com’ email address. If you are contacted by anyone from a different domain who claims to be from Muck Rack, please forward the communication to legal@muckrack.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4212512897/"
    },
    {
      "job_title": "Senior Director of Marketing Operations and Analytics",
      "company": "24 Seven Talent",
      "description": "Senior Director, Marketing Operations & Analytics (Remote – Eastern/Central time zones preferred) Our client is hiring a Senior Director of Marketing Operations & Analytics to build the systems, processes, and insights that make marketing more intelligent, efficient, and accountable to growth. This is a newly created role for a strategic yet hands on leader who can connect marketing, data, and business performance. The ideal candidate thrives at the intersection of strategy and analytics — translating numbers into decisions, designing processes that scale, and ensuring marketing investments deliver measurable impact. What You’ll Do Establish the foundation: Create a unified marketing operations and analytics function that connects data, tools, and performance measurement. Develop insights that drive action: Build dashboards, KPIs, and frameworks that reveal what’s working, what’s not, and where to scale. Enable smarter investment decisions: Partner with stakeholders across marketing, revenue, and analytics teams to guide where to spend and how to optimize. Own the marketing tech stack: Oversee key tools such as Salesforce Marketing Cloud, Google Analytics, and BI platforms to ensure accuracy and visibility. Streamline operations: Design processes that improve data quality, reporting consistency, and cross team collaboration. Influence at the executive level: Present clear, data backed insights that shape marketing and business strategy. What You’ll Bring 10+ years in marketing operations, analytics, or performance marketing strategy within tech, SaaS, or consumer driven companies. Expertise in marketing automation, CRM, and analytics platforms (Salesforce Marketing Cloud, Google Analytics, Tableau/Power BI, etc.). Strong track record using analytics to inform strategic marketing and investment decisions. Proven ability to design and implement scalable processes across complex organizations. Strategic thinker who’s comfortable working hands on with data, dashboards, and tools. Excellent communication skills — able to translate insights into clear business recommendations. Highly analytical, collaborative, and commercially minded. Why This Role This is a rare opportunity to shape how an organization measures, manages, and maximizes marketing performance. You’ll create the operational and analytical backbone that helps leadership make smarter decisions, scale efficiently, and accelerate growth. If you’re a marketing operations and analytics leader who thrives on building clarity from complexity — this is the role for you. show less",
      "date_posted": null,
      "location": "Greater Boston",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4309789586/"
    },
    {
      "job_title": "Revenue Analytics Manager",
      "company": "Harnham",
      "description": "Revenue Analytics Manager Remote (U.S. Based) $130,000–$160,000 Base + Bonus Not hiring in: Washington State, Washington D.C., Massachusetts, Illinois, Vermont, Maine, Rhode Island, New Mexico, Puerto Rico, Ohio, Alaska, Montana, South Dakota, West Virginia, Wyoming, or Louisiana. About the Company: We’re partnered with a leading consumer financial services organization helping people improve financial wellness through data driven solutions. The company is scaling rapidly and investing heavily in analytics, martech, and customer acquisition optimization. Their mission driven environment combines financial impact with empathy, backed by strong executive support for analytics led decision making. About the Role: This position sits within the Revenue Operations Analytics group and plays a key role in driving insights across sales, finance, and marketing. The Revenue Analytics Manager will own forecasting, revenue performance reporting, and optimization of key growth levers across multiple business units. What You’ll Do: Build and maintain SQL based data pipelines and dashboards to support revenue forecasting and lead optimization. Develop BI visualizations (Tableau, Sigma, Power BI) to monitor performance across campaigns and customer segments. Analyze key revenue metrics (ARPU, LTV, churn, ROI) to identify growth and efficiency opportunities. Deliver insights and recommendations to leadership across Sales, Finance, and Strategy. Partner with cross functional teams to ensure data consistency and improve forecasting models. Conduct experimentation and A/B testing to optimize lead flow and conversion rates. What We’re Looking For: 6+ years of experience in analytics, revenue management, or pricing/forecasting. Strong SQL proficiency Advanced experience in BI tools (Tableau, Power BI, Looker, Sigma, etc) Excellent business acumen and communication skills — comfortable presenting insights to senior leadership. Background in financial services, subscription based tech, or consumer services highly preferred. Experience in lead routing, sales funnel, or conversion analytics is a big plus. Leadership experience is not required as this role will be an individual contributor show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4313270486/"
    },
    {
      "job_title": "Director, Strategy & Analytics",
      "company": "Influential",
      "description": "Influential, is looking for a Director of Strategy and Analytics to provide oversight and drive the planning and execution of our campaigns with a focus on delivering a best in class campaign strategy. This role is responsible for identifying and driving account growth opportunities while fostering innovation that delivers on our clients’ business goals. This role works with our portfolio of Retail clients and will be responsible for delivering a variety of quick turn campaigns within this vertical. In general, on a typical day you will: Partner with Creative, Revenue, and Client Solutions leads to develop insight driven strategies for a portfolio of accounts focused on driving new business and scaling existing accounts Provide a sound business justification for investments in influencer marketing based on market trends, audience insights, past campaign data, and experience Drive the strategic direction for accounts by working directly with client and account team focusing on audience targeting, creative, and media distribution Answer client objectives by leveraging a deep understanding of the marketing funnel Ensure account media plan, messaging and measurement approach aligns with the account strategy and client’s business goals Present/pitch the strategic approach and associated media strategy to the client along with Revenue and Client Solutions with the goal of aligning the client’s KPIs to achieve successful business outcomes Work with the account team to interpret and present campaign data, providing recommended adjustments and optimizations leading to improved performance and account success Develop a strategic roadmap for each account with buy in from the Revenue lead, Client Solutions and execution leads that outlines short and long term strategies with tactical plans for driving business growth Leads the campaign recap process by translating campaign data into actionable insights and future optimizations across audience targeting, creative, planning, and media Elevate the team’s skill level and knowledge in strategy by creating frameworks and mental models that can be replicated across portfolio teams Being a Director of Strategy and Insights requires: Bachelor’s degree or equivalent experience 8+ years agency experience in media buying/planning, omni channel marketing, or previous strategy roles Deep understanding of end to end influencer campaigns, including creative strategy, creator frameworks, and measurement strategies Experience working closely with Creative teams to lead data driven campaign concepts Forward thinking with a balance of strong analytical skills and creative thinking. Strong proficiency in Microsoft Excel (i.e. spreadsheet formatting, pivot tables, vlookups) and Google Suite Expertise in media planning tools such as YouGov, GWI, Helixa, and Simmons Experience constructing Boolean queries and using social listening tools (i.e. Brandwatch, Infegy, etc.) to analyze mentions, sentiment, consumer cohorts, and trends Experience with survey design and quantitative survey analysis for audience segmentation and insights Knowledge of leveraging social content data and providing actionable insights and recommendations on content strategies driven by culture A highly collaborative team leader with a proven track record in effectively managing their own workload and proactively communicating with key stakeholders Knowledge of leveraging social content data and providing actionable insights and recommendations on content strategies Proven ability to successfully work with and guide senior level clients and internal portfolio teams Self motivated and driven, enthusiastic about the digital space and multi channel marketing Solid understanding of media buying and channel allocation best practices Strong presentation skills and the ability to articulate and apply strategic thinking Excellent written and verbal communication skills including the ability to interact professionally with external and internal clients Knowledgeable of all major social platforms including Instagram, Facebook, Pinterest, TikTok, Twitter, YouTube Stay up to date on the latest trends and innovations in the social realm Thrives within a dynamic and evolving environment, competent at generating process and structure where none exists Bonus points if: Experience at an integrated marketing organization or creative agency You’re passionate about social media and/or influencer marketing Salary range: $120,000 $160,000 show less",
      "date_posted": null,
      "location": "New York City Metropolitan Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319133831/"
    },
    {
      "job_title": "Sr. Marketing Manager",
      "company": "Insight Global",
      "description": "Must Haves: • Sits in FL, GA, NC, SC • Expertise in SEO, AIO, and search engine marketing (Google Ads, organic ranking strategies). • Familiarity with modern marketing tools: Google Suite, ChatGPT, Claude, and other AI driven platforms. • Strong visual and creative sense; ability to ensure marketing outputs are aesthetically aligned with brand standards. • Proven ability to lead, mentor, and inspire teams. • 7+ years in marketing leadership roles, preferably in B2B SaaS or tech environments. • Demonstrated success in demand generation and multi channel campaign management. • Strong analytical skills with experience in KPI tracking and ROI reporting. Day to Day: We’re looking for a dynamic Senior Mattering Manager to drive growth and brand impact for one of our clients. This role requires a strategic thinker with hands on execution skills across multiple marketing channels, a passion for innovation, and the ability to lead and mentor a high performing team. Key Responsibilities • Lead Multi Channel Marketing Initiatives: Oversee campaigns across digital, social, events, and partnerships to strengthen brand presence. • Demand Generation Leadership: Manage and mentor the Demand Generation team, while supporting broader marketing efforts, especially in SEO and AIO (AI Optimization). • Campaign Ownership: Plan, implement, and deliver end to end marketing campaigns, projects, events, and promotional activities. • Growth Strategies: Develop and execute lead generation, retention, and customer lifetime value strategies to drive measurable ROI. • Content Strategy: Lead content creation and ensure cohesive messaging and brand alignment across platforms. • Sales Enablement: Build tools and resources that empower commercial teams and enhance the customer journey. • SEO & AIO Execution: Own strategies to maximize visibility and performance across digital channels. • Social Media Management: Drive organic social initiatives to build community and engagement. • Brand Expansion: Identify growth opportunities through outreach, partnerships, and sponsorships. • Team Leadership: Manage two direct reports, set priorities, approve deliverables, and monitor KPIs. • Stakeholder Collaboration: Work closely with global teams and manage agencies, contractors, and partners. • Innovation & ROI: Experiment with new channels and tactics while maintaining focus on measurable outcomes. Success Metrics • Global brand growth and engagement. • Increased lead generation and conversion rates. • Improved organic search rankings and digital visibility. • Positive team development and performance outcomes. show less",
      "date_posted": null,
      "location": "Florida, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4320063926/"
    },
    {
      "job_title": "Vice President, Data & Analytics",
      "company": "-",
      "description": "Vice President, Data & Analytics Location: Remote (U.S. Only) | Hybrid Optional in Southern California Compensation: Competitive Executive Package About the Opportunity We’re partnering with a high growth consumer technology company transforming how digital audiences connect with the products and content they love. With over 15 years of success in data driven marketing and product innovation, the organization is now expanding its leadership team with a Vice President of Data & Analytics a pivotal role shaping the company’s data vision and strategy. Reporting directly to the Chief Marketing Officer, this executive will lead the data organization, setting the foundation for scalable analytics, actionable insights, and a data first culture. This is a hands on leadership role where strategic vision meets technical depth perfect for a data leader who thrives on turning complexity into clarity and insights into growth. Key Responsibilities Lead the company’s enterprise data strategy and roadmap, aligning analytics initiatives with business objectives. Build, mentor, and scale high performing data and analytics teams that empower decision making across marketing, product, and operations. Oversee the design and optimization of data infrastructure, pipelines, and governance frameworks to support a self service analytics environment. Partner with marketing and product leaders to uncover insights that drive customer engagement, retention, and monetization. Champion advanced analytics from predictive modeling to experimentation to evaluate marketing effectiveness and uncover new opportunities. Collaborate cross functionally to integrate AI, automation, and visualization tools that deliver faster, smarter insights. Translate complex data findings into clear business narratives for executive and cross functional audiences. Stay ahead of data and technology trends, continuously identifying innovative ways to leverage information for competitive advantage. What You Bring Master’s degree in Computer Science, Statistics, Mathematics, Data Science, or a related technical discipline. 10+ years of progressive leadership experience in data and analytics, ideally within consumer tech, mobile, or digital marketing environments. Proven experience leading the design and deployment of modern, cloud based data platforms. Advanced proficiency in SQL, data visualization (Tableau, Mixpanel, or similar), and statistical modeling. Strong ability to translate technical insights into strategic business recommendations. Demonstrated success driving measurable impact through data driven decision making and experimentation. A collaborative leadership style balancing strategic oversight with a willingness to roll up your sleeves. What’s in It for You Join a fully remote organization that believes work should complement life not compete with it. Collaborate with a dynamic, creative leadership team in an innovative, fast paced environment. Enjoy autonomy, flexibility, and a culture that values curiosity, experimentation, and growth. For Southern California based candidates: Optional access to a modern, beachfront workspace for in person collaboration and connection. Why This Role Matters This isn’t just about data it’s about shaping how millions of users discover and engage with digital experiences they love. The right leader will help redefine what data can do for marketing, product, and customer experience at scale. Interested candidates may inquire confidentially. All applications and conversations will be handled with the highest level of discretion. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316935866/"
    },
    {
      "job_title": "Director of Growth and Acquisition Marketing",
      "company": "Future-Able",
      "description": "Future Able is looking for a Director of Growth & Acquisition Marketing to work for: Naked & Thriving A fast growing, mission driven skincare brand rooted in clean, high performance ingredients and purposeful sustainability. We’ve built a loyal DTC following and a strong Amazon presence and we’re seeking a Director of Growth & Acquisition Marketing to lead our next phase of expansion. The Opportunity We’re looking for a strategic, data driven growth leader to own customer acquisition and full funnel performance across DTC (Shopify) and Amazon. You’ll oversee paid media strategy, execution, and optimization across Meta, Google, Amazon Ads, and emerging channels while also shaping lifecycle performance in partnership with the Retention, Brand, and Creative teams. This is a high impact, hands on leadership role that blends performance marketing, growth strategy, and creative testing discipline. You’ll report directly to the CEO and collaborate closely with senior leadership to drive sustainable, profitable growth. What You’ll Do Own and optimize paid acquisition across Meta, Google, Amazon Ads, YouTube, TikTok, and new channels. Develop and scale a holistic customer acquisition strategy balancing CAC efficiency, LTV, and ROAS/MER. Oversee both the Acquisition and Retention functions, ensuring cross channel alignment and messaging consistency. Partner with Creative and Brand teams to develop and test high performing ad concepts, landing pages, and funnels. Drive A/B testing, conversion optimization, and creative iteration to improve site and ad performance. Build and manage media budgets, forecasts, and reporting dashboards; analyze data to surface insights and growth opportunities. Lead and mentor a small, high performing team and external partners, fostering a culture of learning, accountability, and experimentation. Stay ahead of platform changes, privacy updates, and best practices in performance and lifecycle marketing. Qualifications 7+ years of experience in growth, acquisition, or performance marketing roles at high growth DTC or omnichannel brands. Proven success managing 7 figure budgets across Meta, Google, and Amazon Ads. Hands on experience with Shopify, Google Analytics (GA4), and attribution tools. Experience partnering with or leading Retention (Email, SMS, Subscription) programs. Strong analytical skills ability to interpret data, model LTV:CAC, and translate insights into strategy. Collaborative, entrepreneurial mindset with the ability to zoom out on strategy and dive into execution. Deep understanding of how creative drives performance; comfortable briefing, testing, and iterating ads. Passion for building brands that balance purpose, performance, and profit. What We Offer Base Salary Range: $150K – $180K (commensurate with experience, location, and qualifications) Bonus: Performance based bonus tied to topline growth and profitability Benefits: Health, vision, dental, PTO, product allowance, remote first culture Growth: Opportunities to expand with a rapidly scaling company redefining clean beauty #GrowthMarketing #PerformanceMarketing #CustomerAcquisition #RetentionMarketing #EcommerceMarketing #DigitalAdvertising #DTC #BeautyJobs #SkincareJobs #MarketingLeadership #MetaAds #GoogleAds #CleanBeauty Follow Naked & Thriving at www.nakedandthriving.com Follow Future Able on LinkedIn for more opportunities with high growth consumer brands in eCommerce, digital, marketing, and leadership roles. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331729066/"
    },
    {
      "job_title": "Senior Demand Generation Manager",
      "company": "Brisk Teaching",
      "description": "ABOUT US: At Brisk Teaching, we’re on a mission to help teachers harness the power of AI to lighten their workload and accelerate student learning. Used by over 1 million teachers, Brisk helps educators save time, differentiate instruction, and align classroom work to district priorities. We’re growing quickly, and we’re looking for a Senior Demand Generation Manager to join our marketing team to help build a repeatable, measurable engine for pipeline creation. THE OPPORTUNITY: As Senior Demand Generation Manager, you’ll design, write, and execute campaigns that drive demand among K–12 districts and schools. This role will be central to turning Brisk’s marketing investments into qualified meetings, opportunities, and pipeline. You’ll partner closely with Sales, RevOps, and Marketing to ensure campaigns are built with conversion in mind from the start. This is not a “plug and play” role. Many of these programs are brand new, and we’re looking for someone who is both energized by building from the ground up and confident running proven playbooks. You’ll balance execution of foundational demand gen programs with experimentation and creative tests to find new ways to generate demand in this emerging market. YOU WILL: Support campaign strategy and own execution across outbound email, digital, webinars, events, paid ads, and paid sponsorships, with a focus on generating qualified district pipeline. Create compelling campaign content including email copy, ad creative, gated assets (eBooks, guides, templates), and landing pages that drive awareness and conversion. Write and edit your own materials for demand generation campaigns; you know what “great” looks like and can independently craft content that resonates with K–12 decision makers. Design full funnel campaigns that connect the dots from top of funnel awareness through mid funnel nurture and bottom of funnel conversion. Tell the story of the funnel clearly articulating how leads move through each stage, how campaigns influence opportunities, and how pipeline connects back to revenue. Partner with Marketing to align events and webinars to demand gen motions, ensuring every program has a clear path to conversion. Collaborate with Sales on lead handoff and follow up strategies that maximize conversion to meetings and opportunities. Work with RevOps to measure and optimize campaigns using Salesforce and HubSpot, with accurate attribution and ROI reporting. Run proven programs and test new ones from ABM campaigns to creative outbound experiments balancing scale with innovation. Continuously optimize campaigns based on performance data, cost to pipeline benchmarks, and feedback from Brisk’s Revenue Teams. YOU HAVE: 4–6 years of B2B SaaS or EdTech demand generation experience with measurable pipeline results. Proven ability to create and execute content driven demand generation campaigns from writing emails and ads to developing gated assets and landing pages. Experience running integrated demand programs that tie directly to qualified opportunities and pipeline. Hands on experience with HubSpot and Salesforce, and ability to translate funnel data into clear insights and recommendations. Deep understanding of the funnel and comfort telling the pipeline story to stakeholders. Analytical mindset with creativity to test new demand gen approaches. Collaborative approach—you thrive in partnership with Sales, Field Marketing, and RevOps. A builder’s mindset: scrappy, resourceful, and excited to create new programs from the ground up. BONUS: Work experience in a venture backed startup. Equal Employment Opportunity & Diversity At Brisk, we believe that diverse perspectives make better teams and stronger products. We are an equal opportunity employer and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, disability, or any other legally protected status. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319167292/"
    },
    {
      "job_title": "Director, Global Market Insights",
      "company": "PENTAX Medical",
      "description": "Position Opening: Director, Global Market Insights Why JOIN Us? We are an established medical device leader that is preparing for high growth. This means that we looking to invest in its team and provide a collaborative and encouraging work environment. Our company proud of its comprehensive benefits program and generous Paid Time Off and Holiday policy. Want More INFO? The Director of Market Insights is responsible for leading the Market Insights team and to drive a better understand of our customers, market trends and validate our value propositions/messaging. This role will lead our Global team to support all regions and provide objective data to support strategic and day to day decisions. Responsibilities of Director, Global Market Insights: Increase the international intellect across marketing and the wider business from a market and consumer outlook, at a global/regional perspective, through identifying and leveraging of actionable insights surfaced from both existing and primary research Serve as the primary point of contact for Senior Leadership for Client, Product Channel and Marketing analytics and insights and provide deep analytical expertise as it relates to clients, prospects, markets, channel and products (beyond scope of product manager) Partner with the commercial team to identify business issues and research objectives Conduct / oversee customer and marketing analytics providing strategic and tactical business decision support and develop a fully integrated competitive picture and provide insight/foresight to support effective messaging and positioning Strategic decision support – Conduct business analytics to structure, inform, and drive critical business decisions Working closely with Global Product Marketing Manager on the development of segmentation and messaging ensuring a clear target and validated message Contributing to the profitable top line growth by uncovering behaviors and insights that result in breakthrough insights Conduct continuous analysis of all commercial campaigns and programs with a comprehensive review and analysis of results Marketing lead for all external research and internal performance analytics reports Challenge the traditional research method status quo Manage the Insights and Analytics team Requirements of the Director, Global Market Insights: The successful candidate will have at least 10 years of experience as a hands on, market research professional at strategic research consulting agencies or commercial role in the medical device field Deep understanding of qualitative and quantitative data and how to interpret, report and craft into actionable insights The ideal candidate will thrive on wanting to know why consumers act and feel the way they do, loves sharing this understanding with others, and is known for accurately predicting consumer behavior and reaction Ability to work closely with others across functions & with external agencies Translate business requirements / information needs into a project that will deliver actionable insights and inform marketing or strategic plans Analyzes business problems for routine or specialized decision making Ability to translate business questions into research objectives Effective at presenting data in a clear and meaningful way A high degree of comfort with Excel modelling and statistical analysis Excellent organizational, multi tasking skills with the ability to work in a fast paced environment Must be comfortable interacting with the highest levels of the company It is the ongoing policy and practice of The Company to provide equal opportunity in employment to all employees and applicants. No person shall be discriminated against in any condition of employment because of age 40 and over, color, disability, gender identity, genetic information, military or veteran status, national origin, race, religion, sex, sexual orientation or any other applicable status protected by state or local law. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4268425752/"
    },
    {
      "job_title": "Senior Analytics Consultant",
      "company": "Iceberg",
      "description": "I’m working with a well established legal technology provider that’s expanding its analytics team. They’re looking for a Senior Analytics Consultant to take the lead on complex Relativity aiR workflows and help clients use analytics more effectively across their eDiscovery projects. It’s a hands on, client facing role where you’ll be involved from start to finish designing workflows, managing TAR/CAL models, validating searches, and making sure everything stands up defensibly. You’ll also get to collaborate closely with review managers, project teams, and legal stakeholders to turn analytics into real world results. Remote USA, Full time, permanent …show more",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4311963758/"
    },
    {
      "job_title": "Marketing Lead",
      "company": "The Cake",
      "description": "Job Title: Senior Marketing Leader Type: Full Time Start: Immediate / Targeting October 2025 Location: Remote (U.S. based) Compensation: Up to $180K + Benefits We’re looking for a hands on marketing leader to drive measurable growth for one of the most ambitious AI and hyperautomation companies in the world. This is not a “big brand résumé” role — it’s for someone who can prove impact through data, creativity, and execution. You’ll lead digital marketing strategy, build campaigns from concept to ROI, and transforms category leadership through content, community, and credibility. What You’ll Actually Be Doing: Lead Generation: Design and execute digital campaigns that build measurable pipeline — not just impressions. LinkedIn Dominance: Create and grow presence with daily content, thought leadership, and engagement. Content Engine: Oversee blogs (500–800 words), social, and newsletters that translate complex AI into compelling narratives. Campaign Execution: Plan, execute, and optimize data driven multi channel campaigns across LinkedIn, email, and partnerships. ROI Reporting: Own analytics and reporting — show the numbers, not just the effort. Cross Functional Collaboration: Partner with creative, product, and business teams to align growth initiatives. Must Haves (Don't Apply Without These): 8+ years in enterprise technology marketing, growth, or demand generation Proven track record of measurable ROI and pipeline creation through digital channels Hands on experience executing campaigns — not just managing teams Strong LinkedIn presence (10K+ followers ideal) with visible content and engagement Experience producing or overseeing blogs, campaigns, and content strategy Familiarity with AI, SaaS, or tech innovation spaces Comfort thriving in fast paced, high innovation environments Financial discipline and ability to clearly tie marketing activity to business outcomes You’ll Stand Out If You Have... Publications, patents, or awards demonstrating thought leadership and innovation Hybrid experience across both enterprise and startup environments Recognized credibility in AI or marketing tech communities Strong personal content footprint with examples of viral or high engagement posts Proof of leading campaigns that drove quantifiable growth — show the metrics This is a direct hire role with competitive compensation and benefits. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4308799626/"
    },
    {
      "job_title": "Sr Manager, Growth Marketing & Paid Search",
      "company": "California Closets",
      "description": "We are seeking a strategic Senior Growth Marketing Manager with a strong focus on Paid Search including Bing and Google Paid Search, Demand Gen, Performance Max, and YouTube campaigns. This role will be responsible for using data driven insights to develop and own paid search strategies, manage media budgets, drive campaign execution, and work cross functionally to achieve growth and ROI objectives. You understand the full search landscape to identify opportunities where paid and organic search can work together to maximize performance. We are seeking a creatively strategic Senior Growth Marketing Manager with a strong focus on Paid Search including Bing and Google Paid Search, Demand Gen, Performance Max and YouTube campaigns. This role will be responsible for using data driven insights to develop and own paid search strategies, manage media budgets, drive campaign execution, and work cross functionally to achieve growth and ROI objectives. While this role is focused on paid search, we’re seeking a candidate that is aware of the greater paid digital ecosystem including broadcast, streaming and OTT advertising, paid social, affiliate marketing and their potential impacts on paid search performance. The ideal candidate has a passion for problem solving, a data first mindset, and excellent communication skills. You will be part of the Growth Marketing team—a collaborative group of marketers working to expand brand awareness and generate demand for California Closets through conversations with the customer. Optimizing their brand experience from awareness through first contact with us. Base salary for this range is $130k $150k + benefits. Our salary ranges are determined by role, level, and location. This is a remote position, however there is occasionally travel required about 3 5x per year. Responsibilities Ownership role in the planning, management, and execution of all California Closets Paid Search campaigns, including but not limited to account setup, development and implementation of strategies, campaign structure, budget management, bidding strategies and invoice and billing management Experience managing budgets more than $10M, with an aptitude for managing market specific billing details and reporting these charges to internal finance teams Actively direct and manage a digital agency to define, execute and measure marketing campaigns to maximize efficient customer growth for existing and new paid media channels, including paid search (SEM), YouTube video and display, programmatic, and retargeting Actively direct and manage digital agency efforts to conduct keyword research, competitive analysis, and audience targeting to identify growth opportunities and mitigate risks Have a true love of data and problem solving. Know what data to pull to obtain needed insights and be skilled at interpreting the data and knowing where and how to dig deeper to uncover anomalies, unexpected outcomes and key performance insights Review paid search and YouTube campaign performance by market/DMA and work directly with local business owners & managing operators to adjust strategies to align with their business specific objectives Meet and exceed monthly volume and ROAS targets by driving continuous improvement and experimentation of new optimization concepts and tactics Meet regularly with agency and platform account teams to assess account performance, and to ensure optimal solution adoption while continually evolving strategies in tandem with the rapidly shifting paid search landscape Partner with digital agency to monitor new opportunities within the Google and Microsoft Ads platforms to test and optimize accounts As the driving force behind our YouTube efforts, you’ll create a data driven YouTube advertising strategy that compliments California Closets overall business goals Conduct in depth post campaign analysis, test plans for new user acquisition initiatives, and measure performance to identify testing opportunities across paid search and YouTube Collaborate across levels and functions within the Growth, Tech, Operations, Solutions and Brand teams to support company growth initiatives Develop creative and innovative solutions for how to leverage paid search and YouTube for customer acquisition with a willingness to test new strategies and tactics Derive critical insights from data (front end performance metrics from search engine platforms and back end California Closets actions) and synthesize recommendations to deliver improvements to campaign performance Proven ability to seek cross channel insights by conducting attribution analysis to understand how the market specific media mix impacts paid search performance, regarding new/returning visitor volume and quality Proactively seek ongoing education with the very latest industry trends and advancements in paid search, AI and all other aspects of modern digital marketing Ensure that your efforts and those of 3rd party partners adhere to the latest corporate privacy and data governance policies Qualifications 7+ years of Paid Search experience managing and optimizing campaigns in Google Paid Search and Microsoft Ads. Hands on experience managing and optimizing YouTube video campaigns. Google and Microsoft Ads certifications. Advanced proficiency in Google Analytics (GA4). Strong skills in Excel (macros, charts, pivot tables) and Tableau or similar BI platforms for data manipulation and visualization. Proven experience with A/B testing and iterative campaign optimization. Detail oriented with a passion for creating processes to manage multiple campaigns and track location/franchise specific strategies. Ability to use data and metrics to solve problems, support assumptions, and identify opportunities. Track record of exceeding performance goals through analysis, problem solving, and strategic execution. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331341366/"
    },
    {
      "job_title": "Director, Demand Generation (Remote)",
      "company": "runZero",
      "description": "What we do At runZero, we're a team of dreamers and creative thinkers who aren't afraid to shake up the status quo. Fixing what’s broken with legacy vulnerability management and overcoming persistent, decades old problems requires a new approach. Our platform provides a single source of truth for exposure management across the total attack surface. Without requiring agents, authentication, or appliances, runZero delivers the most complete and accurate visibility into every asset and exposure across internal, external, IT, OT, IoT, mobile, and cloud environments — including uncovering unknown and unmanageable devices and broad classes of exposures that evade traditional tools. Founded by HD Moore (creator of Metasploit), runZero is trusted by more than 500 companies and 30,000 users worldwide to find and mitigate risks faster, meet compliance requirements, and improve overall security. See for yourself with a free trial! Role We are looking for a Director of Demand Generation who has a proven track record of generating demand and pipeline in a cybersecurity environment. In this role, you will have the opportunity to develop and execute a comprehensive marketing plan designed to increase awareness of runZero, acquire new customers, build pipeline, and grow revenue. We are looking for someone who is passionate about their craft and loves to develop innovative campaigns, incorporate cross functional input, analyze performance data, and then launch, test, and optimize programs based on the results. The ideal candidate won’t be afraid to roll up their sleeves and be hands on in executing an array of programs, but also has the capacity to hire, mentor, and manage a team that will grow with runZero. Additionally, this candidate will be able to source strategic contract resources and agency partners, and then manage multiple work streams with their support. This role will report directly to our Chief Marketing Officer, and will also collaborate closely with sales, product marketing, content marketing, and other stakeholders across our GTM team. This role goes beyond running campaigns by aligning marketing efforts with business objectives and translating that engagement into revenue. Fluency in data, analytics, and systems is a must. Responsibilities Own the demand generation engine, creating and executing comprehensive, multi channel strategies to acquire and nurture leads that convert to pipeline Design and execute account based tactics and campaigns using intent data, persona research, and personalized multi touch strategies to engage our ideal customer profile Evolve, manage, and scale a broad spectrum of digital marketing channels in collaboration with strategic contractors and agency partners, including email programs, third party programs, content syndication, and digital marketing campaigns Work with operations, the BDR team, and sales leadership to manage the flow of leads and ensure they are properly nurtured and followed up on Oversee and optimize the PLG funnel, focusing on turning trial users into long term customers, ensuring a seamless transition from product engagement to conversion Negotiate sponsorships and manage every aspect of our programs with third party entities Manage the demand generation budget to ensure we achieve our lead generation and cost per lead goals on time and on budget Create a comprehensive email marketing program designed to nurture and engage leads Continually track and optimize the performance of our marketing programs Model, forecast, and measure lead volumes and ROI by channel, leveraging learnings to refine future investments Report on what’s working and what’s not – and make recommendations and improvements to ensure we hit our marketing and sales goals, with a focus on net new pipeline generation Source and manage a small team of contractors to support your overall strategy Hire, mentor, and scale an internal team over time Develop and refine marketing models to inform budgeting, programmatic spend, and hiring Requirements 10+ years of experience in demand generation and revenue marketing, with 5+ years in leadership Experience in a cybersecurity startup environment Hands on expertise with ABM strategies and multi channel digital campaigns, leveraging intent data and personalization Well versed in all of the core digital and PLG channels, including email marketing, lead nurturing, digital advertising, third party programs, and content syndication Strong data and analytics skills, with fluency in Marketo, Salesforce, Google Analytics, and ABM platforms Demonstrable mastery of tracking KPIs, campaign ROI, and attribution Ability to thrive in an environment where processes and functions are still being refined, with a desire to be part of the building process itself Proven experience in leadership and collaboration, building and scaling marketing teams while aligning with stakeholders A strategic mindset that blends creativity with data driven decision making Strong ability to multi task and scope, manage, and successfully execute complex programs across multiple channels Great communication skills, including the ability to present demand generation programs and results to sales and executive leadership Salary runZero values transparency in the hiring process. Based on market data, we expect this role to have a salary of $185,000 $215,000. We know that the talent market is always in flux, so please let us know if you believe we have advertised this role in the wrong salary band. We also provide equity to all employees. Interview process Skills We value your time and see the interview process as a critical two way street, allowing us to assess your skills, strengths, and cultural fit while simultaneously providing you with a clear understanding of our company, our ways of working, and the expectations specific to the role you’re seeking. To this end, our interview process incorporates a combination of: Initial one on one interviews with a recruiter and manager Panel interviews with the team Candidate challenge a role specific challenge designed for you to showcase your strengths and allow us to assess your skills in a hands on exercise A final interview, conducted either remotely or in person if we haven't yet met face to face in previous rounds How we take care of you 🏡 Fully remote: runZero is a 100% remote company! While we aim to gather annually for kick offs, our team thrives in the flexibility and freedom that remote work provides. 🥕 Benefits: We prioritize the well being of our team members, which is why runZero pays for 100% of the premium platinum level medical, vision, dental, life, and short term disability coverage for you and your dependents. 🔐 401k: We match 4% of 401K contributions 🏝️ Time off: We offer unlimited PTO, 11 official company holidays, and a recharge week at the end of the year 🍼 Paid parental leave: We offer 12 weeks of paid parental leave 🎉 Culture of collaboration: Our team is diverse, representing various backgrounds and perspectives, which fosters an inclusive and vibrant environment. With flexible schedules and supportive coworkers who listen to one another, runZero promotes a culture of collaboration. And more! For more information on what it's like to work at runZero, please visit our employee spotlight page! Applications runZero positions are currently restricted to the United States and the United Kingdom. All other International applications will not be considered. runZero is an Equal Opportunity Employer and does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, disability, national origin, veteran status, marital status, ancestry, nationality or any other basis covered by applicable law. We encourage under represented applicants to apply, even if you don’t think you fit 100% of the criteria (nobody ever does)! show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4266781119/"
    },
    {
      "job_title": "Demand Generation Manager",
      "company": "Altura Partners Ltd",
      "description": "Demand Generation Manager Cybersecurity start up vendor 📍 Remote (U.S.) | Full time | Senior Level Overview We’re partnering with a rapidly growing technology cybersecurity start up that’s searching for an experienced Demand Generation Manager to build and scale their marketing engine from the ground up. This is an ideal opportunity for a data driven marketer who thrives in fast paced startup environments and wants the freedom to shape how demand generation is done. You’re analytical yet creative — equally comfortable designing automation flows in HubSpot as you are brainstorming compelling campaign ideas. You have opinions on topics like gating content, know how to measure pipeline impact, and love collaborating closely with sales to drive measurable results. If you’ve ever wanted to “own” demand gen — to design, test, and optimize programs your own way — this role offers exactly that. Key Responsibilities Lead the company’s account based marketing (ABM) initiatives — partnering with sales, RevOps, and leadership to identify key accounts and develop targeted campaigns. Manage and optimize the marketing tech stack, primarily HubSpot, alongside RevOps. Develop and maintain a full funnel lead generation framework with clear reporting and performance insights. Design and implement email and nurture strategies in collaboration with the SDR team. Coordinate with field marketing to align digital campaigns with events and broader brand strategy. Create and manage paid media programs (LinkedIn Ads, programmatic, and other digital channels). Continuously test, iterate, and improve demand generation programs in a dynamic, fast moving environment Experience 4+ years of experience in demand generation or digital marketing, ideally within cybersecurity or B2B SaaS. Start up experience currently, or previously essential. Proficient in HubSpot and Salesforce (or similar CRM/automation tools). Strong project management skills — you can handle multiple campaigns and moving parts without missing details. Confident communicator who can translate performance data into actionable insights. Curious and proactive — you’re eager to understand the product deeply and connect marketing efforts to sales outcomes. Hands on with technology; you enjoy exploring and mastering new marketing tools. Why This Role You’ll join an ambitious, innovative team where experimentation is encouraged, and your ideas won’t get stuck in approval loops. If you’ve ever wanted to build the demand engine you know works — this is your chance. $170 200k + bonus + equity show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4315915620/"
    },
    {
      "job_title": "Web3 Growth lead (Backed by 5b+ VC fund, blockchain-based infrastructure project and ecosystem, 150k - 300k annually))",
      "company": "Second Talent",
      "description": "About the Platform We’re pioneering a next gen Web3 membership ecosystem that unifies digital identity, reputation, with access across gaming and consumer applications. Backed by a leading blockchain investor, our platform empowers communities to earn rewards and build long term loyalty. Role Overview You’ll own growth in the US market through creative hacking, strategic partnerships, and community driven campaigns. Your mission is to turn early adopters into evangelists and unlock a vibrant network of developers, gamers, and brands. Responsibilities Design and execute high impact growth experiments (A/B tests, viral loops, referral programs) tailored to US audiences Source, pitch, and secure partnerships with gaming studios, influencers, accelerators, and Web3 communities Craft and launch collaborative activations (NFT drops, co branded events, AMAs, Twitter Spaces) that generate buzz Develop and maintain a growth dashboard to track key metrics (acquisition cost, activation rate, LTV) and iterate rapidly Evangelize our vision at industry events, podcasts, and virtual panels to build credibility and pipeline Qualifications 5+ years in growth marketing or biz dev, with 2+ years in Web3, gaming, or crypto adjacent roles Proven success driving user acquisition through partnerships and viral campaigns in North America Deep understanding of US gaming culture, influencer ecosystems, and on chain communities Data driven mindset: comfortable with analytics tools, cohort analysis, and funnel optimization Self starter who thrives in ambiguity, moves fast, and celebrates small wins on the road to big goals Nice to Haves Experience scaling an NFT project or tokenized membership program Established network within esports, gaming media, or Web3 accelerators Hands on familiarity with Discord, Telegram, Twitter, and Discord bot integrations Basic grasp of tokenomics, staking models, or DAO governance show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4312746276/"
    },
    {
      "job_title": "Freelance Associate Data Director",
      "company": "Saatchi X",
      "description": "Associate Data Director Company Description Saatchi & Saatchi X partners with our clients to create dynamic solutions rooted in shopper know how. We are a different kind of creator. We elevate the expected, and embrace the new, the next, and the complex. Our ideas deliver real results for our clients to drive their business and help them evolve. It’s simply what happens when strategy, creative, and execution fearlessly collaborate to create the future. We partner with our clients to provide marketing programs focused on driving results. Our approach isn’t actual rocket science, but there’s a reason no other agency can execute ideas like we do. Talent is at the heart of everything we do. We’ve put together a team of talented and passionate individuals from around the globe. Check out our work at saatchix.com Job Description As an Associate Data Director, you will play a pivotal role in driving data strategy, analytics innovation, and actionable insights across client engagements. You’ll collaborate with cross functional teams—including strategy, media, creative, and account—to ensure data is leveraged effectively to inform marketing decisions, optimize performance, and deliver measurable business outcomes. Responsibilities Data Strategy & Tools Understands how to approach complex problems by outlining several ways to approach the challenges, is able to structure the approach from a cost / benefit perspective and confidently guide a team through execution Considered a \"thought leader\" within the Data team for strategic insight and ability to apply insights to multiple client situations Able to lead cross capability initiatives effectively Able to synthesize how to measure performance in an increasingly noisy environment Recommends and understands various applicable data tools and platforms to address and identify both internal and external strategic needs Able to integrate long term implications of insights and recommendations across several channels Ensures that the team maintains high analytical output, including, but not limited to, distribution of reporting or advanced analytics work that drives towards a specific business goal while maintaining data hygiene and governance Communication Skills & Client Interaction Effectively able to guide strategy, resolve issues, and identify new opportunities through constructive dialogue with internal and client teams Respects others' opinions and takes feedback into deliverables constructively Ability to either condense and simplify or detail out the specifics, depending upon the audience Sought out by clients for subject based opinions and project recommendations Able to lead, with guidance, the development of medium sized client strategic agenda Understands how to document and respond to client feedback and recognizes when to escalate issues or push back on a client Brings client ideas for leveraging broader capabilities when applicable Qualifications 6+ years of previous experience in a marketing analytics or business intelligence role, including experience managing direct reports. Hands on experience or working knowledge of data visualization and analytic dashboard development with Tableau (preferred), Domo, Power BI, Shiny, Looker, or other platforms. Excellent communicator & collaborator between multiple clients and internal teams. Willingness to dive in and conduct analyses across various data sources to find insights and provide actionable recommendations to client and internal teams. Deep experience in commerce data, preferably RMN experience Ability to lead a team of analysts to construct, execute, and analyze measurement plans. show less",
      "date_posted": null,
      "location": "Rogers, AR",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4313108838/"
    },
    {
      "job_title": "Data Analytics Manager - (Consulting & Modern Data Stack)",
      "company": "ON Data Staffing",
      "description": "Consulting Manager Data Analytics & Modern Data Stack About Our Client Our client is a fully remote data consulting firm dedicated to helping organizations unlock the full potential of their data. They specialize in solution architecture, data engineering, business intelligence (BI) implementations, AI enablement, and application integration across leading cloud technologies. Their clients range from fast growing startups to established Fortune 500 enterprises. Why Join Our Client 100% remote role within the United States Collaborate with exceptional professionals in data engineering, analytics, and AI Be part of a high impact organization driving digital transformation across diverse industries Work in a culture that values innovation, collaboration, and measurable success About the Role Our client is seeking an Consulting Manager to lead cross functional consulting teams in delivering transformative data and analytics strategies. This position requires a blend of strategic leadership, technical understanding, and relationship management to achieve impactful business outcomes for enterprise clients. The ideal candidate is both a strategist and an executor—someone who can connect complex data architectures to tangible business results, inspire high performing teams, and drive client growth through actionable insights. Key Responsibilities Strategy & Account Growth Lead enterprise level data and analytics engagements that deliver measurable business impact Develop and implement scalable roadmaps for analytics and BI transformation Identify new opportunities within existing accounts and collaborate with business development teams to expand partnerships Client Leadership Serve as a trusted advisor to executive stakeholders on analytics modernization and data driven decision making Manage expectations, communication, and outcomes to ensure consistent client satisfaction Present insights, strategies, and recommendations that influence executive initiatives Project & Team Leadership Oversee multiple concurrent analytics and BI projects, ensuring operational excellence across teams Mentor and coach consultants to foster professional growth and maintain a culture of excellence Implement delivery frameworks that enhance efficiency and quality across engagements Risk & Resource Management Anticipate and mitigate risks to ensure smooth project execution Align the right expertise and resources to deliver maximum value for each engagement Who You Are Experience & Expertise 8+ years of experience in data consulting, analytics engineering, or strategic delivery roles, with at least 3 years serving enterprise clients MUST HAVE Strong knowledge in Looker, dbt & Google Cloud/Big Query Proven experience leading multi million dollar, cross functional analytics programs that combine strategy and execution Education & Certifications Bachelor’s degree in Business, Data Science, Computer Science, or a related field (MBA or advanced degree preferred) Relevant certifications such as PMP or Cloud Professional credentials are highly desirable Thought Leadership Actively engaged in the analytics and BI community through conferences, publications, or professional forums Membership in relevant organizations (e.g., PMI, IIBA) is a plus show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4333517634/"
    },
    {
      "job_title": "Head of Social & Brand",
      "company": "Hirewell",
      "description": "The Role This is both a creative and strategic leadership role. You'll own the voice, look, and feel of the brand across all touchpoints, from social to partnerships to community. You'll architect data driven strategies, foster creator collaborations, and ensure the brand shows up with authenticity, clarity, and impact. Key Responsibilities Brand Leadership Define and evolve the brand identity, tone, and storytelling across platforms and campaigns. Build and execute brand campaigns that drive awareness, trust, and affinity. Ensure brand consistency across every channel and touchpoint (social, web, content, partnerships, PR). Social Strategy & Execution Develop and oversee the organic and paid social media strategy to grow our reach and influence. Lead content direction — from creative concepts to production — ensuring bold, on trend, and platform native storytelling. Identify emerging formats and trends to keep the brand at the forefront of culture. Creator & Community Ecosystem Build deep relationships with creators, influencers, and brand advocates. Oversee partnerships and campaigns that authentically integrate the brand into the creator ecosystem, e.g., events, webinars, parties. Foster a strong community presence through engagement, social listening, and interactive programs. Leadership & Collaboration Build and manage a team of social strategists, content creators, and contractors. Collaborate cross functionally with Product, Growth, and Comms to align messaging and campaigns. Serve as a key brand steward internally — ensuring everyone understands and embodies the brand vision. Data & Insights Use analytics to inform strategy, optimize content, and demonstrate impact. Present performance reports and insights to leadership regularly. Requirements 6–10 years in social media, brand, or creative leadership roles (startup or creator/AI space a plus). Proven track record of building and scaling brand presence across platforms. Exceptional storytelling and communication skills. Deep understanding of creator culture, digital trends, and social platforms. Experience managing teams and agency or contractor relationships. Strategic mindset paired with hands on creative instincts. Nice to Haves Experience in AI, SaaS, or creator tools. Strong creative direction skills (writing, design, or video). Prior startup or early stage brand building experience. What You’ll Gain Ownership of one of the most exciting intersections in tech: AI x creators. A chance to build a brand that defines a generation of creators. Growth potential to evolve into VP/Head of Marketing as the company scales. show less",
      "date_posted": null,
      "location": "Los Angeles Metropolitan Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317700930/"
    },
    {
      "job_title": "Senior Marketing Manager",
      "company": "Island Staffing",
      "description": "Senior Marketing Manager, DTC Performance 120 140K Remote Company HQ in Denver, CO Job Summary Senior Manager, DTC Performance will lead the planning, execution, and optimization of paid media programs across digital channels that include paid social, paid search, affiliates and programmatic channels. DTC Performance Manager will scale customer acquisition for Company's wellness product business, manage a performance budget, and drive efficient CAC while increasing new customer revenue. Key Responsibilities Plan, launch, and optimize paid campaigns across social, search, affiliate, and programmatic channels to drive customer acquisition and revenue. Monitor daily performance metrics, managing bids, budgets, and pacing to ensure channel efficiency and target KPIs. Analyze campaign data and generate actionable insights to improve ROI, reduce CAC, and enhance overall performance. Deliver weekly and monthly performance reports including CAC, ROAS, spend efficiency, and LTV by channel Develop audience strategies and run A/B tests to improve conversion rate, ROAS, and LTV Collaborate with internal stakeholders, including creative, analytics, influencer and retention teams, to align messaging and funnel strategies. Optimize landing pages and funnel performance in collaboration with web and creative teams Partner with affiliate networks and display platforms to identify new opportunities and negotiate effective placements. Key Qualifications & Skills Required Bachelor’s degree in Marketing, Business, Communications, or a related field. 3+ years of experience managing performance marketing campaigns across multiple digital channels. Proficiency with paid social (Meta, TikTok), paid search (Google Ads), affiliate, and display platforms. Strong analytical skills with hands on experience using data to optimize campaign performance. Comfort with marketing attribution, GA4, and third party tools (e.g., Triple Whale, Northbeam) Experience collaborating with creative teams and iterating on ad performance Familiarity with DTC ecommerce KPIs and platforms. Preferred Experience using tools like Google Analytics, Meta Ads Manager, TikTok Ads Manager, and affiliate networks (e.g., ShareASale, Impact). Knowledge of feed management tools (e.g., Feedonomics, Channable) and experience integrating with ecommerce platforms like Shopify. Success Metrics / KPIs Customer Acquisition Cost (CAC) Return on Ad Spend (ROAS) by channel Conversion Rate (CVR) Click Through Rate (CTR) Number of New to Brand Customers Budget adherence and pacing accuracy show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319263187/"
    },
    {
      "job_title": "SVP, Insights",
      "company": "InMarket",
      "description": "Job Title: SVP, Insights Location: Remote United States only About InMarket Since 2010, InMarket has been the leader in 360 degree consumer intelligence and real time activation for thousands of today’s top brands. Through InMarket's data driven marketing platform, brands can build targeted audiences, activate media in real time, and measure success in driving return on ad spend. InMarket's proprietary Moments offering outperforms traditional mobile advertising by 6x.* Our LCI attribution platform, which won the MarTech Breakthrough Award for Best Advertising Measurement Platform, was validated by Forrester to drive an average of $40 ROAS for our clients. Source: Wordstream US Google Display Benchmarks for Mobile Media About The Role At InMarket, we’ve experienced a wonderful period of growth as the direct result of increased efficiency and productivity. We are seeking a SVP, InSights who will be a catalyst to achieve innovative, company wide informatics and analytics. Leading our organization’s data analytics strategy, including governing our first party proprietary data and evaluating third party data with a view to improving our existing products and creating new ones, while continuing to delight our customers. The ideal candidate will have a proven track record in data acquisition and management, finding insights from large data sets, and product innovation, with a special focus on interdepartmental collaboration. Your daily impact as a SVP, Insights Provide leadership and oversight for measurement client strategy, and insights teams including management of staff, budget and department policies Lead a highly effective, innovative team focused on conceptualizing and implementing a company wide strategy for leveraging data and analytics to provide products that will WOW our customers and prospects Develop and implement a company wide organizational strategy for data and analytics Understand industry trends and how to utilize information effectively, improving and streamlining data systems within the company, driving innovation. Using market research to develop innovative ideas for the Company’s products Advises team on technical, descriptive, and statistical approaches to solve complex business problems Work closely with Marketing and client strategy team to develop product marketing objectives Oversee research needed to determine the needs and wants of our customers Work closely with Marketing and client strategy team to develop product marketing objectives Working closely with Chief Legal & Privacy officer to ensure adherence to all privacy laws regarding data Your Expertise And Experience Master’s degree in Data Science, Product Management, or similar field 15+ years in a business or executive management role Proven experience organizing and directing multiple teams and departments Excellent communicator in written and verbal form Extremely versatile, dedicated to efficient productivity Analytically minded Experience planning and leading strategic initiatives Knowledge of effective change management for culture, systems and practices Skilled at re envisioning, building, and managing a team, especially in a time of growth and change; excellent at identifying talent and leveraging each person’s skills and contributions Moves groups to consensus and resolves conflicts; exhibits willingness to have difficult conversations Builds coalitions and works collaboratively with diverse stakeholders at all levels Establishes clear expectations, deliverables and deadlines Sets clear agendas and facilitates effective meetings Experience with data analysis Experience with budget management Consulting experience with a focus on operations management Nimble business mind with a focus on developing creative solutions Strong project reporting skills, with a focus on interdepartmental communication Compensation & Benefits Summary: Competitive salary, stock options, flexible vacation Medical, Dental and Flexible Spending Account (FSA) Company Matched 401(k) Unlimited PTO (Within reason) Talented co workers and management Agile Development Program (For continued learning/professional development) Paid Paternity & Maternity Leave Title contingent on years of relevant experience. For candidates in California, Colorado, and New York City, Illinois, Minnesota, New Jersey, Vermont, Washington and Massachusetts, the Targeted Base Salary Range for this role is $194,526 to $245,000. Actual salaries will vary depending on factors including but not limited to work experience, specialized skills and training, performance in role, business needs, and job requirements. Base salary is subject to change and may be modified in the future. Base salary is just one component of InMarket’s total rewards package that also may include bonus, equity, and benefits. Ask your recruiter for more information! At InMarket, diversity is not just a value, it’s the very essence of who we are. It’s about recognizing and celebrating the unique perspectives each of us brings, from our colleagues to the communities we serve.We are committed to embracing the full spectrum of backgrounds, beliefs, abilities, and life experiences, knowing that this diversity strengthens us. At InMarket, our commitment to Diversity, Equity, and Inclusion means valuing each individual’s unique contributions. Together, we thrive. InMarket is an Equal Opportunity Employer (EOE). Qualified applicants are considered for employment without regard to age, race, color, religion, sex, national origin, sexual orientation, disability, or veteran status. Privacy Notice for California Job Applicants: https://inmarket.com/ca notice for job applicants/ show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4153093912/"
    },
    {
      "job_title": "Director, Slate Strategy",
      "company": "Scopely",
      "description": "Scopely is looking for a Director of Slate Strategy to join the Slate Development Group. The position will be responsible for in depth analyses of Casual genre games across platforms to provide clear market based theses for investment and game development. The location is flexible, and some travel will be required. At Scopely, we care deeply about what we do and want to inspire play, every day whether in our work environments alongside our talented colleagues or through our deep connections with our communities of players. We are a global team of game lovers who are developing, publishing and innovating the mobile games industry, connecting millions of people around the world daily. Slate Development Group owns Scopely’s editorial and content strategy, including the company’s greenlighting, Game Development Framework (GDF), studio strategy (organic and inorganic) and slate wide budget and investment strategy. What You Will Do Your work will drive the entire Scopely slate organization to seize market opportunities through organic development, acquisition and/or investment. You will also partner deeply with Scopely’s development teams to provide actionable, KPI driving improvements across our games in development. You will be the thought leader in forming the core forward looking hypotheses of the company slate and product strategy. You will set the priority and the tempo of the organization’s product strategy. This includes but is not limited to What the key market trends are telling us in terms of our slate & product strategy What are the key success factors to maximum chance for success How do we build confidence in our hypothesis through innovative ways to get data You will be responsible for assessing some of our opportunistic acquisition and investment opportunities and act as the key voice of product strategy. Manage a pipeline of product strategy needs to make sure the development slate is on the cutting edge of design practice, surfacing the most impactful KPI lifting product insights from the market to the game teams. Ensure ruthless prioritization and alignment with business priorities, both urgent and strategic. Partner with Game Teams to make sure your team’s insights are driving maximum impact on the development and investment slate What We’re Looking For A deep understanding and perspective on the gaming market and landscape, ideally working at the portfolio level, though not required. An analytical mind driven always to understand why successes happen and can consistently come up with new hypotheses and frameworks to capture success & failure patterns A strong quantitative background and ability to do hands on work with data to generate key strategic hypotheses Been part of successful game making teams as a leader and know how to create influence with creative leadership A very strong set of communication skills, both in person and written. Oftentimes, you need to convince others of your point of view through influence and rallying cross functional teams to deliver results. You deeply understand free to play design, execution, and the rigors of live game operations. You know what it is to run a live game and know how to help teams make the hard prioritization decisions necessary to grow LTV without infinite resources Infectious passion and love for games For candidates in CA, CO, NJ, NY, and WA, the annual salary range is provided below. In addition to base pay, employees may be eligible for equity, bonuses, and a comprehensive benefits package, including healthcare benefits, retirement benefits, pet insurance, paid holidays, paid Scopely free days, and unlimited paid time off. Base pay offered may vary depending on job related knowledge, skills, and experience. CA, CO, NJ, NY, and WA Annual Salary Range $186,300 $244,600 USD About Us Scopely is a global interactive entertainment and mobile first video game company, home to many top, award winning experiences such as \"MONOPOLY GO!,\" “Star Trek™ Fleet Command,” “Stumble Guys,” “MARVEL Strike Force,” and “Yahtzee® With Buddies,” among others. Scopely creates, publishes, and live operates immersive games that empower a directed by consumer™ experience across multiple platforms from mobile, web, PC and beyond. Founded in 2011, Scopely is fueled by a world class team and a proprietary technology platform Playgami that supports one of the most diversified portfolios in the games industry. Recognized multiple times as one of Fast Company’s “World’s Most Innovative Companies,” Scopely is a multi billion dollar business due to its ability to create long lasting game experiences that players enjoy for years. Scopely has global operations in more than a dozen markets across Asia, EMEA, and North America, and is home to many internal game development teams, referred to as Scopely Studios, with additional game studio partners across four continents. Scopely was acquired by Savvy Games Group in July 2023 for $4.9 billion, and is now an independent subsidiary of Savvy. For more information on Scopely, visit: scopely.com Notice to candidates: Scopely, Inc and its affiliates will never request payment or ask for financial information as a condition for applying to a position or receiving an offer of employment. All official Scopely, Inc. recruiters only use email domains that end with @scopely.com. Our official website is www.scopely.com. Please only apply to positions posted on our official website and ensure the recruiter only communicates via the official email domain. Should you have any questions or encounter any fraudulent requests/emails/websites, please immediately contact recruiting@scopely.com. Our job applicant privacy policies are available here: California Privacy Notice and EEA/UK Privacy Notice. Employment at Scopely is based solely on a person's merit and qualifications. Scopely does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), or any other basis protected by law. We also consider qualified applicants with arrest or conviction records, consistent with applicable federal, state and local law. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4253230383/"
    },
    {
      "job_title": "Senior Product Marketing Manager",
      "company": "DigitalOcean",
      "description": "Dive in and do the best work of your career at DigitalOcean. Journey alongside a strong community of top talent who are relentless in their drive to build the simplest scalable cloud. If you have a growth mindset, naturally like to think big and bold, and are energized by the fast paced environment of a true industry disruptor, you’ll find your place here. We value winning together—while learning, having fun, and making a profound difference for the dreamers and builders in the world. We want people who are passionate about marketing products that millions of developers will love. We are looking for a motivated, creative, and results oriented self starter to join our Developer Marketing team. This is a strategic team within DigitalOcean that owns the messaging and positioning for the entire company, drives the Go To Market strategy for all products and also works on accelerating the product usage and revenue. As a Senior Product Marketing Manager, you will have the opportunity to define how we communicate the value of DigitalOcean platform and our various products to growing businesses who rely on cloud computing services. You will have a deep understanding of DigitalOcean’s target customer base and will own the positioning and messaging for the DigitalOcean platform. This role will develop compelling content to help customers understand the value, and drive marketing programs to spread the message globally. You will have a lot of visibility and opportunities for close collaboration with numerous cross functional teams like product management, sales, revenue marketing, brand, developer relations, marketing programs. What You’ll Be Doing. Successfully take to market key products aligned to the key developer products like Kubernetes and Application Platform. As a team we focus on multiple projects and prioritize as needed. Comfortable working with senior level stakeholders across product and sales organizations in defining and executing GTM strategy. Work with product team(s) to support service launches by distilling key functionality and benefits into crisp product marketing messages targeting technical personas Develop product messaging, positioning, and detailed launch execution plans for successful GTM Work closely with Growth and Product teams to define programs (cross sell / up spell) which will drive meaningful product adoption Work closely with our revenue organization to help our sales and solution architect team understand the value proposition and how to sell these products Create enablement assets to serve sales, demand gen, and the partner channel Have a solid understanding of cloud infrastructure pricing and packaging methodology and apply in practice to optimize product pricing tiers Implement creative tactics for enhanced product launch traction Determine the types of business customers and use cases that are best served by DigitalOcean products Continuously test and refine the messaging via web updates, new landing pages, and targeted emails campaigns Craft an overall cloud platform narrative that includes developers, and best fit business customers and how DigitalOcean uniquely helps them Create compelling content for various mediums like product pages, blogs, emails, social media, press releases Be the go to person for all things related to the overall product and platform narrative whether it is events, keynotes, customer/partner engagements etc. What We’ll Expect From You Bachelor's degree in a technical field, such as computer science, engineering or mathematics. MBA is a plus. 7+ years of experience in technical product marketing or product marketing as a product marketing manager or product manager Experience in Kubernetes and developer platform products is preferred Understanding of the cloud landscape and ability to position products uniquely for business use cases Research oriented and analytical mindset that uses data to inform both internal stakeholders (all the way to Executives) as well as marketing tactics Extraordinary communication skills with track record of navigating complex unstructured cross functional environments Comfortable interacting with executives and using your voice to influence outcomes, share insights, and challenge ideas constructively OR Confidently engage with senior leadership, using strong communication skills to influence decision making and provide well informed opinions. Excellent storytelling and writing skills Compensation Range $110,000 $158,000 This is a remote role. Why You’ll Like Working for DigitalOcean We innovate with purpose. You’ll be a part of a cutting edge technology company with an upward trajectory, who are proud to simplify cloud and AI so builders can spend more time creating software that changes the world. As a member of the team, you will be a Shark who thinks big, bold, and scrappy, like an owner with a bias for action and a powerful sense of responsibility for customers, products, employees, and decisions. We prioritize career development. At DO, you’ll do the best work of your career. You will work with some of the smartest and most interesting people in the industry. We are a high performance organization that will always challenge you to think big. Our organizational development team will provide you with resources to ensure you keep growing. We provide employees with reimbursement for relevant conferences, training, and education. All employees have access to LinkedIn Learning's 10,000+ courses to support their continued growth and development. We care about your well being. Regardless of your location, we will provide you with a competitive array of benefits to support you from our Employee Assistance Program to Local Employee Meetups to flexible time off policy, to name a few. While the philosophy around our benefits is the same worldwide, specific benefits may vary based on local regulations and preferences. We reward our employees. The salary range for this position is based on market data, relevant years of experience, and skills. You may qualify for a bonus in addition to base salary; bonus amounts are determined based on company and individual performance. We also provide equity compensation to eligible employees, including equity grants upon hire and the option to participate in our Employee Stock Purchase Program. DigitalOcean is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service. show less",
      "date_posted": null,
      "location": "Boston, MA",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4257474478/"
    },
    {
      "job_title": "Head of Marketing - Agentic AI Data Agent Start-Up",
      "company": "Zearch",
      "description": "About the Company Our client is a fast growing, innovation led technology business redefining what’s possible with artificial intelligence. Their cutting edge solutions help organizations harness AI to automate data, enhance decision making, and transform industries. As the company scales globally, they’re looking for a Head of Marketing to lead their marketing function, shape go to market strategy, and elevate brand presence across international markets. This is an opportunity to join a category defining AI company at an exciting stage of growth. What’s on Offer Competitive compensation + stock options Unlimited PTO Comprehensive health benefits (Medical, Dental, Vision, Life) Remote first flexibility Choice of equipment Fast moving, collaborative culture Opportunity to shape the growth of a high impact AI brand The Role As Head of Marketing, you’ll own and scale the marketing function — from brand strategy to demand generation. You’ll develop and execute integrated campaigns that drive pipeline, accelerate revenue, and position the company as a global AI leader. You’ll lead a growing team across brand, product marketing, and demand generation, partnering closely with Sales, Product, and Engineering to align marketing strategy with business goals. Key Responsibilities Define and execute a global marketing strategy aligned with growth objectives Lead brand, product, and demand generation initiatives Build and mentor a high performing marketing team Partner with Sales to drive pipeline through integrated campaigns, ABM, and digital programs Translate technical capabilities into clear, value driven messaging Manage and optimize marketing budgets for maximum ROI Champion customer advocacy and thought leadership initiatives About You Strategic marketing leader with 7+ years’ experience, including 3+ in a senior leadership role Proven success in AI, SaaS, or data driven technology sectors Experienced across brand, demand generation, and product marketing Analytical, creative, and data driven — with a track record of measurable results Strong communicator and cross functional collaborator Passionate about AI and shaping how the world understands its impact Why It Matters AI is transforming how businesses operate, innovate, and grow. This role offers the chance to define the voice, vision, and marketing strategy of a pioneering AI company shaping the next generation of technology. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4320181614/"
    },
    {
      "job_title": "Director of Marketing",
      "company": "Barkbus",
      "description": "About Barkbus Barkbus is the nation's premier mobile dog grooming company. We are dog loving creatives, operators, technologists, and entrepreneurs taking a Silicon Valley startup approach to disrupt and modernize the fragmented legacy pet grooming industry. Driven by our mission to deliver joy to pets and their people, we're proud to operate across AZ, CA, CO, CT, FL, GA, IL, NC, NV, NJ, NY, PA, SC, TX, and VA. We’re the fastest growing pet health & wellness startup in the country and would love for you to join us in building the nation’s beloved pet brand. Who We Are We’re a collaborative, high quality team of dog lovers that solves problems with thoughtfulness, empathy, and speed. We have a big dream: to build a generational company that remakes the pet health & wellness industry nationally. We’re a fun, ambitious group that is working to build something new in pet care. We move with high velocity, collaborate closely, and deliver results faster than anyone in the market. We want your time at Barkbus to be the greatest time of your career. If you’re ready to build the future of pet care with high standards and speed, come on board. We need exceptional people to help us build something new in the world. About This Role The Director of Marketing will own and scale customer acquisition at Barkbus. This role is both strategic and hands on. You’ll lead performance marketing efforts that drive profitable growth, optimize the full acquisition funnel, and expand Barkbus’ reach across new and existing markets. You’ll manage all paid digital channels, including Google Ads, Local Service Ads, and Meta, while testing new high ROI channels to fuel demand. As a hybrid operator leader, you’ll balance data driven precision with creative experimentation to continually improve performance, efficiency, and return on investment. This role is ideal for a technical, analytical marketer who thrives in fast paced, capacity constrained, service based environments and wants to directly shape how Barkbus acquires and converts new customers. Role & Responsibilities Growth Strategy & Leadership Own Barkbus’ overall performance marketing strategy across Google Ads, LSAs, Meta, and emerging channels. Build scalable, profitable frameworks for customer acquisition and market fulfillment. Manage and forecast marketing budgets ($5M+), ensuring efficient spend and ROI. Establish KPIs, infrastructure, and repeatable processes that drive measurable growth. Report regularly on KPI results and strategy to company leadership and board. Performance Marketing & Optimization Run and optimize paid campaigns across core and test channels (Google, Meta, TikTok, YouTube, Yelp, etc.). Leverage data and AI tools to automate workflows, improve targeting, and enhance performance. Ensure accurate tracking, attribution, and funnel analysis through CRM and analytics tools. Analytics & Insights Define and track key metrics (CAC, ROAS, LTV, conversion rates) to guide decision making. Deliver insights and recommendations to improve efficiency and scale profitability. Work with data engineering team to maintain dashboards and reporting through tools like GA4, Looker, or Tableau. Creative & Experimentation Oversee testing of creatives, copy, and landing pages to improve conversion. Build a test and learn culture through structured A/B and geo based experiments. Leadership & Collaboration Lead and mentor team members or agencies to execute high impact campaigns. Partner cross functionally with Finance, Product, and Operations to align on goals and performance. Stay ahead of trends, tools, and best practices in growth marketing. Qualifications & Experience 7 10 years of performance or growth marketing experience, ideally in a service based or multi location business. Proven success scaling acquisition channels profitably and managing $5M+ annual budgets. Expert in Google Ads and Meta Ads Manager, with mastery of CAC, ROAS, and LTV levers. Strong analytical and technical skills with experience in GA4, Looker, Tableau, or similar tools. Experience leveraging AI for automation and efficiency. Demonstrated experience managing marketing P&L, budgets, and forecasts. Startup experience and ability to thrive in fast paced environments. General understanding of lifecycle and social marketing. Bonus: Experience in the pet industry, DTC, or local consumer services. Compensation & Benefits $175k 190k salary based on experience. Stock options upon required tenure. Comprehensive medical, dental, and vision insurance. Retirement Savings Plan to support your future. Pet Insurance to keep your furry friends healthy. Monthly cell phone stipend to stay connected. ClassPass membership to support your fitness and wellness goals. Equal Opportunity Barkbus is an equal opportunity employer who celebrates diversity. Come as you are. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4312177794/"
    },
    {
      "job_title": "Lead Data Analyst - Analytics Enablement",
      "company": "PURE Insurance",
      "description": "About The Role As a Lead Data Analyst, you’ll be a key player in our data modernization effort, how we build and use data across the company. You’ll focus on developing well structured, reliable data models in dbt and Databricks, specifically the gold and platinum layers of our medallion architecture. This role sits at the intersection of analytics and engineering ideal for someone who’s comfortable writing production grade SQL, building modular dbt models, and shaping how data is organized for analysis. You’ll work closely with our Data Analytics team, Analytics Engineering, and business teams to ensure data is accurate, consistent, and ready for insight. What You’ll Do Partner with the Analytics Engineering team to align silver layer and develop gold and platinum layers in dbt Build and document reusable, production grade data assets to support analytics and reporting Drive best practices in dbt development, including modularization, testing, and Git based version control Implement data validation and quality checks to ensure trustworthy datasets Mentor analysts on SQL, dbt workflows, and data modeling best practices Collaborate with key business partners (e.g., Product, Underwriting, Claims) to ensure analytical outputs meet needs What We’re Looking For 4–6+ years of experience in data analytics or analytics engineering, preferably within Property & Casualty (P&C) insurance or another data rich industry Expert level SQL skills and hands on experience building dbt projects (macros, testing, documentation, Jinja) Familiarity with Databricks SQL or similar cloud data platforms Strong understanding of medallion architecture and experience shaping gold/platinum data models Experience with Git based workflows, CI/CD, and collaborative development using dbt Cloud or dbt Core Ability to work independently and deliver high quality data models with minimal supervision Solid communication skills and a willingness to partner with business teams when needed Bonus Points For Experience mentoring or leading analytics professionals Familiarity with Hex or other data visualization tools A passion for clean design, data modeling, and building maintainable systems Location & Work Environment This is a full time, fully remote position. You can work from anywhere in the United States or choose to work from one of PURE Insurance’s office locations, including White Plains (NY), Warren (NJ), Chicago (IL), Boston (MA), Charleston (SC), Atlanta (GA), Fort Lauderdale (FL), Scottsdale (AZ), and San Diego (CA). The base salary for this role can range from $120,000 to $140,000 based on a full time work schedule. An individual’s ultimate compensation will vary depending on job related skills and experience, geographic location, alignment with market data, and equity among other team members with comparable experience Want to Learn More? [Our Values] [Our Benefits] [Our Community Impact] [Our Leadership] show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4267025330/"
    },
    {
      "job_title": "Senior Database Marketing Analyst",
      "company": "Robert Half",
      "description": "Position: CDP DATA ANALYT ENTERPRISE DIGITAL TEAM Location: REMOTE Salary: UP TO $140,000 BASE + BENEFITS *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume.My email can be found on my LinkedIn page. *** Join a greenfield digital initiative backed by a Fortune 500 parent company. Help design and build a Customer Data Platform (CDP) from scratch to deliver unified customer insights and enable personalization at scale. Key Responsibilities: Define CDP data requirements and design data models for a 360° customer view. Integrate data from CRM, ERP, web, and mobile sources. Implement data quality checks, governance, and compliance standards. Build dashboards and reports for segmentation and analytics. Required Skills & Experience: 5+ years in data analysis with customer data focus. Advanced SQL and Python for data manipulation. Experience with ETL/ELT pipelines and tools (dbt, Airflow). Familiarity with CDP platforms or custom built solutions. Knowledge of cloud data architectures (AWS, Azure, GCP). Nice to Have: Identity resolution, customer journey analytics, personalization strategies. *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume.My email can be found on my LinkedIn page. Also, you may contact me by office: 515 303 4654 or mobile: 515 771 8142. Or one click apply on our Robert Half website.No third party inquiries please.Our client cannot provide sponsorship and cannot hire C2C. *** show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318886274/"
    },
    {
      "job_title": "Head of Marketing",
      "company": "Kismet Search",
      "description": "TL;DR: Head of Marketing Retained Search for Series A Tech Company (backed by Circle Ventures, $25M raised) building infrastructure to make digital trust scalable through its verification platform. You’ll own GTM, product marketing, and growth—defining ICPs, messaging, and analytics systems that turn early traction into adoption and revenue. Ideal for a data driven marketer who can blend strategy with hands on execution. $150K–$200K base (or competitive) + equity | Remote (US preferred). About Our Client Company: Our retained client is a Series A technology company building category defining infrastructure to make trust scalable. They are launching a B2B2C verification platform that helps enterprises and developers verify anything — from user authenticity and credentials to transactions and partnerships — without exposing personal data. The company is backed by top tier investors including Circle Ventures, with over $25M raised and significant existing revenue streams. Their Mission: To rebuild trust between people, brands, and platforms in an Internet that has forgotten what’s real, by verifying anything. The Role: We’re hiring a Head of Marketing — a strategic yet hands on marketer who thrives at the intersection of GTM strategy, product positioning, analytics, and growth execution. You’ll own the go to market foundation for both the enterprise facing Truth Engine product and its developer ecosystem. This means defining the story, systems, and metrics that turn early traction into measurable adoption and revenue. You’ll bring structure, focus, and data driven execution to a fast moving startup that’s ready to scale. What You’ll Do: Build the Foundation Architect the marketing infrastructure from the ground up (CRM, analytics, attribution, lifecycle tools). Define clear KPIs, OKRs, and dashboards that measure funnel health, CAC/LTV, engagement, and retention. Implement lightweight, scalable systems that support multi audience GTM. Lead Product Marketing & GTM Develop messaging, positioning, and GTM strategy for enterprise verification and developer platform products. Define ICPs, personas, and use cases across verticals like AdTech, loyalty, and identity verification. Create enablement materials for sales, product, and partnerships to ensure alignment across launches. Translate complex technology into clear value propositions for both enterprise and developer audiences. Drive Growth & Lifecycle Marketing Design and execute full funnel campaigns across web, search, events, social, and partner ecosystems. Run experiments to improve acquisition, onboarding, and retention across B2B and developer funnels. Develop growth playbooks that can be scaled and repeated across new markets and products. Oversee or collaborate with agencies for content, brand, and performance execution. Analyze, Report & Optimize Build reporting frameworks that connect spend to pipeline, adoption, and revenue growth. Analyze data to uncover bottlenecks and new opportunities for conversion and retention. Present actionable insights to leadership with clear business impact. What You Bring: 8+ years of experience in marketing roles within high growth tech companies in player coach type of dynamic. 5+ years and proven track record in product and growth marketing, ideally in B2B2C or enterprise SaaS environments (FinTech, AdTech, MarTech, identity verification, or developer tools). Expertise defining ICPs, personas, and GTM strategies for multi audience products. Hands on experience building and managing marketing systems (CRM, lifecycle automation, attribution, analytics). Strong command of data and metrics — you make decisions grounded in CAC, LTV, conversion, and retention analysis. Comfort working cross functionally with product, sales, and engineering. Experience with developer marketing, SDK adoption, or ecosystem storytelling is a plus. Tools: HubSpot, GA4, Looker Studio, Figma, Asana, or similar. Mindset: Resourceful, analytical, and relentlessly focused on clarity, accountability, and results. You love structure, but you move fast and think like an owner. Why This Role: Rare opportunity to define and scale the marketing engine for a well funded Series A company tackling one of the Internet’s biggest problems — trust and identity verification. High visibility: work directly with the founding team on strategy, positioning, and growth. Culture built on creativity, transparency, and execution, not bureaucracy. Fully remote or hybrid (if in NYC). Flexible hours based on location. show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319255869/"
    },
    {
      "job_title": "Lead Business Intelligence Analyst",
      "company": "Thryv",
      "description": "About the Position At Thryv, we are a team that lives by teamwork. However, it’s not the work that drives us, it’s the respect, trust, and care for each other that defines us as a team. We’re a diverse community of trendsetters who do our best work in a fun, relaxed environment. Technology never stops evolving and neither do we. We’re always looking for the best and brightest team players to join us. We’re looking for a Lead Business Intelligence Analyst to partner with Finance Operations, Marketing, and Product to drive real time decision making. This is a strategic insights role, not a dashboard building position. This role will work directly with raw, often imperfect data sets to surface what matters most—translating data into KPIs, visual narratives, and actionable guidance for the business. This role is ideal for someone who is analytically sharp, business minded, and obsessed with turning noise into clarity. Responsibilities Analyzes large, multi source datasets to uncover business insights that support GTM, product pricing, and financial strategy. Partners with Finance Ops to connect business performance with financial metrics including CAC, LTV, funnel velocity, and retention. Defines and refines KPIs that align execution with company objectives and partners with cross functional teams to implement strategy. Supports campaign performance analysis, segment behavior trends, pricing elasticity, and product monetization strategy. Summarizes insights into concise, visual presentations with bullet points, charts, and storyboards that speak directly to business leaders. Drives cross functional analysis by blending marketing, product, and financial data into cohesive performance stories. Influences C level decisions with strategic insight and crisp communication. Who We’re Looking For Bachelor’s Degree (or international equivalent), required. 9+ years of related experience, required. Experience in Business Intelligence, Strategic Analytics, or similar roles in a B2B SaaS environment, required. Proven experience working with Finance, Marketing, and Product teams, required. 12+ years of related experience, preferred. Hightly proficient in SQL, with comfort working across modern data stacks (e.g., Snowflake, BigQuery, Domo, AWS, GCP). Strongly skilled in consolidating and interpreting data from multiple fragmented datasets from numerous systems. Strong understanding of digital and traditional marketing strategies, user acquisition funnels, engagement metrics, and customer lifetime value modeling. Experienced with traffic metrics, Google Analytics, HubSpot, Salesforce, and similar platforms. Skilled at communicating findings through brief bullet points and compelling visuals no fluff, just insight. Deep understanding of core SaaS performance metrics, including but not limited to CAC, LTV, ARR, churn, user adoption, and pricing strategy. Proven ability to think both creatively and critically while thriving in a fast paced, dynamic, and often ambiguous work environment. Scrappy, proactive, and results oriented, with a bias for clarity and action.Collaborative and team oriented, proactively supporting team members to achieve goals. Ability to travel less than 5% of the time. Must be 18 years of age or older. Must successfully complete pre employment screening process, as required. Must successfully complete any required training or orientation courses, as needed. What We Offer Life requires balance. So we provide benefits around health and wellness, continued education, and work/life balance to help you live your best life when you’re working…and when you’re not. Medical, dental, and vision plans, plus a wellness program with added incentives 401(k) savings plan with company match and employee stock purchase plan Continuing education benefits with tuition assistance programs Paid time off including holidays, vacation, sick, personal, and winter close Who We Are At Thryv, we’re a team fiercely devoted to the success of local businesses. We’ve been around for over 100 years, always with one goal in mind — helping small businesses compete, win and succeed. We provide the technology, software and local business automation tools small business owners need to better manage their time, communicate with clients, and get paid, so they can take control of their business and be more successful. We support businesses across the U.S. and we have team members all around the country (even internationally). In fact, we’re a work from anywhere company, because that’s how we get work done. Culture is vital at Thryv because it shapes our identity and, therefore, our measurements for growth. We have an identified set of values that hold all of us accountable paving the way for our company success and our legacy. All of this helps us deliver results for our clients and creates success for our employees. At Thryv, making a positive impact within our team and in our local community is the reason we get out of bed every morning. Thryv Core Values: · Client Devoted – Be humble with a servant mentality. Understand the uniqueness of each interaction while being flexible, knowledgeable, and genuine. · Under Promise, Over Deliver – Deliver expectations and exceed them, have accountability, listen and understand the ask. · Act Like You Own the Place – Taking ownership and accountability in your day to day decisions empowers you to act like you own the place. · Invest in our People – Hire people that are aligned with Thryv’s core values. Provide learning opportunities to enable all of us to adapt, belong, and create a lifelong career. · DONE3 – Define what you say (Done), Do what you say (Done), Follow up and ensure completion (Done). · Making $$ is a Byproduct of Helping People – Always be devoted to people, act with integrity. · Think Long Term, Act with Passion & Integrity – Focus on making every interaction exceptional. Bring enthusiasm and devotion to every act. This includes doing the right thing, even when no one is looking. Think five years out or think for the long play. Find out more at corporate.thryv.com/careers/ Belonging at Thryv We believe in a work environment where all individuals are treated fairly and respectfully, have equal access to opportunities and resources, and can contribute fully to the organization’s success. We want our employees to feel a part of something big and we encourage the sharing of ideas and collaboration across the organization. We strive to ensure our work environment reflects diversity, fairness and meritocracy. We believe all employees should have the opportunity to perform effectively in their position. We value every employee and the authenticity they bring to their role and to the organization. As a result, our employee policies and internal practices focus on ability and merit as the standards for success. Requisition Detail and Process This information indicates the general nature and level of work performed by employees in this job. It is not designed to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. The duties and responsibilities in this job description may be subject to change at any time due to reasonable accommodation or other reasons. The final job level offered may vary based on the applicant’s competencies and qualifications such as experience and education, and other job related reasons. Our Commitment to Equal Opportunity Thryv is proud to provide equal employment opportunities to all employees and applicants, without regard to gender, color, race, religion, sexual orientation, national origin, citizenship, age, disability, veteran status, pregnancy, genetic information, or any characteristic protected by law. Thryv is committed to provide equal employment opportunities throughout the employment relationship including recruitment, hiring, discharge, compensation, benefits, discipline, development, and advancement or other aspects of employment. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4297905492/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4260632597/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4313290145/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4255865540/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319932409/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4308589703/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4044344773/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4244901850/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271772940/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4261637006/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4246037078/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4265384662/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317459561/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4293132606/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4231763028/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4270110552/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318370522/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4257479133/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4311668024/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4309047598/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317112170/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319155852/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4299244222/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316771520/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318384723/"
    }
  ]
}