{
  "metadata": {
    "job_title": "analytics",
    "timestamp": "2025-11-17 19:47:11",
    "total_jobs": 75
  },
  "jobs": [
    {
      "job_title": "Vibe Growth Marketing Manager",
      "company": "Ramp",
      "description": "About Ramp At Ramp, we’re rethinking how modern finance teams function in the age of AI. We believe AI isn’t just the next big wave. It’s the new foundation for how business gets done. We’re investing in that future — and in the people bold enough to build it. Ramp is a financial operations platform designed to save companies time and money. Our all in one solution combines payments, corporate cards, vendor management, procurement, travel booking, and automated bookkeeping with built in intelligence to maximize the impact of every dollar and hour spent. More than 45,000 businesses, from family owned farms to e commerce giants to space startups, have saved $10B and 27.5M hours with Ramp. Founded in 2019, Ramp powers the fastest growing corporate card and bill payment platform in America, and enables over $100 billion in purchases each year. Ramp’s investors include Thrive Capital, Sands Capital, General Catalyst, Founders Fund, Khosla Ventures, Sequoia Capital, Greylock, and Redpoint, as well as over 100 angel investors who were founders or executives of leading companies. The Ramp team comprises talented leaders from leading financial services and fintech companies—Stripe, Affirm, Goldman Sachs, American Express, Mastercard, Visa, Capital One—as well as technology companies such as Meta, Uber, Netflix, Twitter, Dropbox, and Instacart. Ramp has been named to Fast Company’s Most Innovative Companies list and LinkedIn’s Top U.S. Startups for more than 3 years, as well as the Forbes Cloud 100, CNBC Disruptor 50, and TIME Magazine’s 100 Most Influential Companies. We’re looking for a Vibe Growth Marketing Manager who is a builder who prototypes and ships faster than most teams can spec a brief. You’ll use AI tools, LLMs, no code/low code platforms, and smart automation to rapidly unlock new growth channels, improve operational efficiency, and experiment with new marketing ideas end to end. You’ll be embedded within the growth team, sitting across paid, lifecycle, and product led growth but your toolkit will be unique: GPTs, Python notebooks, Make/Zapier workflows, APIs, and fast scrappy builds. This is a high leverage, high autonomy role for someone who thinks in distribution, speed, and scale. What You’ll Do Prototype and launch AI powered workflows to improve speed, personalization, and targeting across marketing channels (e.g. GPTs for ad copy, agents for segmentation, auto generated landing pages). Build and ship MVPs of growth experiments using tools like Retool, Bubble, Zapier, Vercel, or custom scripts without needing support from Engineering. Automate repetitive marketing workflows from campaign QA to performance reporting to lead enrichment. Leverage APIs, webhooks, and LLMs to stitch together growth infrastructure that scales smarter. Act as an internal multiplier, sharing tools, playbooks, and internal agents that help marketing and GTM teams move faster. Collaborate with design, product, and data science to test and refine ideas that unlock new growth levers. You’ll Thrive If You Think like a growth marketer but move like a hacker. You know what drives outcomes and how to build just enough to prove value. Love working with AI, APIs, and automation tools. Bonus if you've built internal agents, custom GPTs, or soloed internal tools. Are fluent in Zapier/Make/Tray/N8N, GPT 4, Retool, Notion, Airtable, Python, Javascript, SQL, LangChain, Vercel, or equivalent without being precious about the stack. Bias toward shipping over spec’ing. You believe a working prototype today is better than a polished deck next week. Have a strong product sense and design instincts, even if you're not a designer or engineer. Communicate clearly, operate with ownership, and don’t wait to be told what to do. Nice to Haves Prior experience working in a B2B SaaS or fintech growth team. Familiarity with GTM systems like HubSpot, Segment, Amplitude, etc. Comfort working with structured and unstructured data—cleaning, transforming, and piping it into useful workflows. Benefits (for U.S. based Full time Employees) 100% medical, dental & vision insurance coverage for you Partially covered for your dependents One Medical annual membership 401k (including employer match on contributions made while employed by Ramp) Flexible PTO Fertility HRA (up to $5,000 per year) WFH stipend to support your home office needs Wellness stipend Parental Leave Relocation support to NYC or SF (as needed) Pet insurance Referral Instructions If you are being referred for the role, please contact that person to apply on your behalf. Other Notices Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Ramp Applicant Privacy Notice show less",
      "date_posted": 