{
  "metadata": {
    "job_title": "analytics",
    "timestamp": "2025-12-08 19:03:20",
    "total_jobs": 5
  },
  "jobs": [
    {
      "job_title": "Analytics Consultant",
      "company": "Cypress HCM",
      "description": "Description: The Trust Experience and Analytics team is looking for a data analyst with a strong delivery record of working with several data sources for identifying, analyzing, visualizing and interpreting trends for solving high priority business problems. In this role, you will be working within a cross functional team of highly technical stakeholders to drive impactful results for Airbnb, and be involved in the end to end project lifecycle right from problem definition to creating dashboards for sharing insights. Duties: Partner with the business to understand the organization and its goals in order to ensure prioritization of highest impact initiatives. Define, create and visualize metrics for problem definition for tracking project success/workstream health. Collaborate with technical owners to deliver on impactful insights. Create dashboards for weekly reporting. Build strong relationships and trust with stakeholders, keeping them and their teams engaged in the project Requirements: 5+ years in a data analyst or similar role High proficiency in Advanced SQL and Airflow for developing queries and data pipelines Working knowledge and understanding of Experiments, Causation & Correlation, and Statistical models (eg. regression, Chi square etc.) Experience with Superset, Tableau, or similar BI platform to develop reports and dashboards Ability to work independently with stakeholders, write requirements, and solve analytical problems in fast paced, ambiguous environments Able to serve as a liaison between business and technical teams to drive effective, timely solutions, insights to actions, that fulfill both strategic and operational needs Able to team effectively with others and build relationships at all levels, both within the team and with stakeholders Highly Preferred: Experience with Trust & Safety domain, ML models, and metrics Experience with Big Data/Analytics platforms/languages like Hive, Python, R is a big plus Strong written and verbal communication Compensation: $77.50 – 82.76/hr W—2 Req ID: 36656848 show less",
      "date_posted": "2025-12-02 19:00:17",
      "location": "United States",
      "remote": "Remote",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4325398329/",
      "days_since_posted": 6,
      "application_url": "Easy Apply (LinkedIn)"
    },
    {
      "job_title": "Director, SEO Data Analytics & Insights",
      "company": "Raptive",
      "description": "Raptive is seeking an analytically driven professional with deep expertise in data analysis and SEO to power our data, insights, and tooling efforts across one of the internet’s largest creator networks. This is a senior, hands on role: you’ll work directly with large datasets, write SQL/Snowflake queries, QA pipelines, and run advanced statistical analyses, while also shaping methodologies, guiding peers, and partnering with product and engineering teams to scale our SEO products and creator recommendations. We’re looking for someone who thrives at the intersection of data rigor and SEO impact—a player coach who can dig into the data, but also ensure insights translate into scalable recommendations that improve creator outcomes and business growth. Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. What you’ll be doing Hands on analytics: Dive into SEO datasets with SQL/Snowflake, Python, and scripts to uncover opportunities, validate data quality, and inform recommendations. QA and trust: Build and maintain frameworks for validating data pipelines, ensuring accuracy and confidence in SEO tooling outputs. Data to action: Translate analyses into actionable insights that improve creator outcomes, audience growth, and product performance. Cross functional partnership: Collaborate with product and engineering to define, test, and refine SEO tools, dashboards, and recommendation engines. Guidance & best practices: Provide technical and analytical mentorship to teammates, setting standards for excellence. Innovation: Introduce automation, AI (e.g., ChatGPT prompting), and advanced statistical methods to accelerate and deepen insights. Stakeholder communication: Clearly articulate findings to SEO leadership, product managers, and other stakeholders—bridging technical details with business outcomes. The skills and experience you bring to the job 7+ years of experience in a data analytics or data science role, preferably within digital media, publishing, or SEO driven industries. Passion for and proficiency in data, reporting, and business growth. Strong hands on skills in SQL (Snowflake preferred), Python (pandas, forecasting/statistics), and data QA. Solid foundation in statistics and experimental design, with proven ability to validate and interpret results with accuracy and attention to detail. Experience in an SEO or data related role, with a genuine interest in understanding audience content consumption habits. Proficiency in data visualization tools (Sigma, Looker, Tableau, Power BI, advanced Excel). Comfort working with APIs, web scraping, and automation scripts. Strong verbal and written communication skills; able to bridge technical and non technical audiences. Creativity, self sufficiency, and eagerness to learn; methodical and logical in approach. Bonus points: Experience with data science techniques such as NLP, machine learning models, or advanced forecasting. About Raptive Raptive is a new kind of media company built for creators and home to one of the largest and most diverse audiences on the internet. Raptive combines its position as the world’s largest ad management platform with a comprehensive suite of monetization, audience and business solutions that enable creators to turn their passions and talents into thriving independent companies and enduring brands. We stand for the future of a diverse, open internet powered by the creativity and entrepreneurship of the independent creators and publishers it serves. To date, Raptive has paid over $2.5 billion to thousands of independent creators. Join us in creating a more equitable and inclusive future for media. Raptive was recognized as a Fortune 100 Best Places To Work for 2024 2025. The base salary range for this position is $130,000 $180,000. The range provided is Raptive’s reasonable estimate of the annualized base compensation for this role. The actual amount may be higher or lower, based on non discriminatory factors such as experience, geographic location, knowledge, skills and abilities. This role is eligible for additional incentive compensation that isn’t included in the posted range. For more information, visit www.Raptive.com or follow us on LinkedIn or Instagram. Raptive is committed to diversity, equity, and inclusion. We believe we are most impactful when people with a wide range of backgrounds, experiences, and identities come together with a common purpose. We encourage candidates from all backgrounds to apply. Raptive is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please reach out to a member of our recruiting team. show less",
      "date_posted": "2025-12-02 19:00:53",
      "location": "United States",
      "remote": "Remote",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4341214091/",
      "days_since_posted": 6,
      "application_url": "Easy Apply (LinkedIn)"
    },
    {
      "job_title": "Supervisor of Analytics Reporting",
      "company": "Credit Acceptance",
      "description": "Credit Acceptance is proud to be an award winning company with local and national workplace recognition in multiple categories! Our world class culture is shaped by dedicated Team Members who share a drive to succeed as professionals and together as a company. A great product, amazing people and our stable financial history have made us one of the largest used car finance companies nationally. Our Engineering and Analytics Team Members utilize the latest technology to develop, monitor, and maintain complex practices that help optimize our success. Our Team Members value being challenged, are encouraged to express their ideas, and have the flexibility to enjoy work life balance. We build intrinsic value by partnering with all functions of our business to support their success and make strategic business decisions. We focus on professional development and continuous improvement while enjoying a casual work environment and Great Place to Work culture! The purpose of the Supervisor, Analytics Reporting position is to actively monitor and report on the performance of models in production. In addition, to coach and support a team in developing an increased knowledge of the systems and internal methodologies. Outcomes and Activities: This position will work from home; occasional planned travel to an assigned Southfield, Michigan office location may be required. However, this position is permitted to work at a Southfield, Michigan office location if requested by the team member. Develop complex programming to extract and manipulate data Create reports regarding key performance indicators (KPI’s) Investigate reporting trends Run ad hoc data requests for key business users Provide fraud related triggers reporting Automate recurring reports Models and strategies: Monitor and maintain complex statistical models with the goal of optimizing high volume decisions to add intrinsic value to Credit Acceptance Reporting: Develop, produce, and support reporting to measure the performance of processes, models, and strategies Ad hoc data analysis: Support and perform data analysis to solve business problems and drive better decisions Translate business requirements: Translate high level business goals into the tasks and technical specifications needed to accomplish the goal Provide reoccurring training, coaching, and mentorship to less senior level team members. Knowledge and Skills: Possess knowledge of the auto lending industry and related analytical tools Ability to apply analytical skills to solve problems creatively Act promptly and effectively when assigned tasks Communicate complex information to others in a way they can understand Work well with others in a team environment Be proactive and make recommendations as opportunities arise Be self motivated and able to perform with minimal supervision Requirements: Bachelor’s degree or higher (Computer Science, Economics, Mathematics, Statistics, Business Analytics, Finance, etc. preferred) 5+ years professional experience with SAS, SQL, R, Python or other statistical programming language (SAS/SQL highly preferred) 3+ years of recent experience creating reports, reviewing for trends, and performing deep dive analysis in an analytical tool or in a business intelligence setting 2+ years of recent experience leading or mentoring an analytics team Experience developing reporting to monitor predictive models Ability to work on multiple competing priorities Experience achieving objectives with minimal supervision Strong analytical problem solving skills Strong attention to detail and a focus on accuracy Experience mentoring or providing guidance to less senior team members Apply analytical skills to solve problems creatively Ability to extract and manipulate large data sets Communicate complex information to others in a way they can understand Demonstrated ability to work on projects with broad requirements Preferred: 3+ years’ experience in auto lending analytics Recent small company experience. Targeted Compensation: $115,000 $153,000 base salary + an annual bonus plan This position is not currently open to individuals who require sponsorship now or in the future to work legally for Credit Acceptance, such as H 1b / H 4 or F 1 OPT visa holders. #zip INDCSMP Benefits Excellent benefits package that includes 401(K) match, adoption assistance, parental leave, tuition reimbursement, comprehensive medical/ dental/vision and many nonstandard benefits that make us a Great Place to Work Our Company Values: To be successful in this role, Team Members need to be: Positive by maintaining resiliency and focusing on solutions Respectful by collaborating and actively listening Insightful by cultivating innovation, accumulating business and role specific knowledge, demonstrating self awareness and making quality decisions Direct by effectively communicating and conveying courage Earnest by taking accountability, applying feedback and effectively planning and priority setting To create an environment where people do their best work, we focus on the dimensions of Organizational Health. All leaders must: Identify the Right People by recognizing top talent Set Clear Expectations by managing change and directing others Train team members and focus on developing talent Performance Manage by ensuring accountability and driving results Create the Right Environment by establishing trust and managing conflict Maintain the Right Number of team members needed to build an effective team Expectations: Remain compliant with our policies processes and legal guidelines All other duties as assigned Attendance as required by department Advice! We understand that your career search may look different than others. Our hiring team wants to make sure that this would be a fit not just for us, but for you long term. If you are actively looking or starting to explore new opportunities, send us your application! P.S. We have great details around our stats, success, history and more. We’re proud of our culture and are happy to share why – let’s talk! Required degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent. Credit Acceptance is dedicated to providing a safe and inclusive working environment for all. As part of our Culture of Compliance, we are proud to be an Equal Opportunity Employer and value our culturally diverse workforce. All qualified applicants will receive consideration for employment regardless of the person’s age, race, color, religion, sex, gender, sexual orientation, gender identity, national origin, veteran or disability status, criminal history, or any other legally protected characteristic. California Residents: Please click here for the California Consumer Privacy Act (CCPA) notice regarding the personal information Credit Acceptance may collect from you. Play the video below to learn more about our Company culture. show less",
      "date_posted": "2025-11-24 19:01:29",
      "location": "United States",
      "remote": "Remote",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4044344773/",
      "days_since_posted": 14,
      "application_url": "https://creditacceptance.wd5.myworkdayjobs.com/Credit_Acceptance/job/USA--Remote/Supervisor-of-Analytics-Reporting_R11860-1?source=LinkedIn"
    },
    {
      "job_title": "Sr Mgr Forecasting & Business Analytics",
      "company": "Arcutis Biotherapeutics, Inc. (Nasdaq: ARQT)",
      "description": "The Senior Manager, Forecasting & Business Analytics will lead the US and Global forecasting for both inline and pipeline assets and commercial analytics. The role will also be responsible for integrating insights into forecasts and business analytics for the Arcutis portfolio of products. Roles & Responsibilities Leadership and Management Ownership of Key Forecast Deliverables and Presentations including Long Range Plan (LRP) & Latest Estimate (LE) forecasts, Weekly Forecast tracking across multiple indications vs plan, and ad hoc forecasting requests. Development and management of a process to update forecasts to critical stakeholders across the organization throughout the calendar year, ensuring on time and accurate deliverables. Partnership with 3rd party and external partners to ensure quality and accuracy of forecast assumptions Build Relationships throughout the organization (finance, marketing, supply chain etc.) to support partnership, consistency and alignment on forecasting inputs Demonstrate strong project management, prioritization and timeline execution across projects when working independently as well as when working with the vendors or internal teams. Ensure all forecasts are developed with detailed rationale, assumptions and storyboarding. Collaborate within the Commercial Operations team to convey to Commercial team and executive leadership holistic, actionable learnings. Modeling and Analysis Perform analyses estimating disease area revenue potential, sales coverage, market size, class penetration, marketing practices and future trends Incorporate working knowledge of payer and contracting landscape into forecasting. Lead and own Patient Journey Analytics: Analyze patient level data (e.g., prescription, claims, and hub data) to understand patient behavior, adherence, and therapy switching Marketing analytics: Evaluate the effectiveness of marketing campaigns, optimize promotional efforts, and assess the return on investment (ROI) of marketing programs. Market Access Analytics: Assess the impact of pricing, reimbursement, and formulary changes on brand performance. Patient Journey Analytics: Analyze patient level data (e.g., prescription, claims, and hub data) to understand patient behavior, adherence, and therapy switching Assess critical trends in business performance, performing ad hoc analysis on key emerging market trends Identify appropriate innovative forecasting methodologies/techniques to uncover growth opportunities both at the brand level, as well as the overall portfolio. Competitive/Category Assessments and Pipeline Progress Play an active role in interpreting and applying insights from Competitive Intelligence and Market Research to integrate it with high quality forecast models and analytics at asset and portfolio level. Tools & Technologies: Demonstrate excellent communication, presentation, MS PowerPoint & Excel skills. Strong experience with SQL, R/Python Experience working with IQVIA LAAD, XPO, XPD, RisRX, MMIT datasets Education & Licenses and Experience Typically requires a Bachelor’s degree in a related field and 5 or more years of relevant market research, marketing, commercial operations, or other relevant experience, certificates in /Advanced analytics/R/SQL/Python/modeling. Previous experience in a consultative role is a plus. Competencies & Skills Strong experience with advanced Excel, R/or python and Tableau, patient based forecast modeling and patient flows and advanced analytics Experience with quantitative techniques including smoothing, regression, time series analysis Experience working with secondary datasets such as IQVIA, Symphony, Flatiron EMR, DRG etc. to conduct custom analysis Working knowledge of forecasting inputs including global pricing, access and reimbursement policies, and competitive environment and potential impact on product development and commercialization strategy Ability to work in a fast paced, dynamic environment with little supervision Ability to adapt well under pressure Strong collaboration skills Possess an expert understanding of research methodologies. Possess a curiosity and openness to new insight methodologies and a drive to expand the toolkit to better serve the business Excellent strategic thinking capabilities and equally excellent tactical execution skills Analytical reasoning abilities, intellectual curiosity, strong business acumen, and creativity in problem solving Ability to interact effectively with/present to (verbally and in writing) all levels of the organization, from Product Managers to Senior Executives Expert knowledge of custom research methodologies Proven experience as a high performer and thought leader Excellent project management skills with demonstrated ability to lead multiple projects and priorities Ability to effectively organize and prioritize tasks to achieve established deadlines Travel may be required up to 20% of time worked Why Join Us? Arcutis is a pioneering medical dermatology company dedicated to revolutionizing the treatment of serious skin diseases and our pipeline is one of the more robust and exciting in the industry. Our vision is to revitalize the standard of care for dermatological diseases and conditions through novel therapies that simplify disease management for physicians and patients. We are focused on filling the innovation gap in medical dermatology drug development by applying our deep clinical, product development and commercial expertise in dermatology to develop best in class therapies against biologically validated targets. Arcutis is uniquely positioned to become the preeminent innovation driven medical dermatology company, and we are looking for top talent to join our team. We are nimble, collaborative, and passionate about achieving our mission! All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, or other legally protected status. show less",
      "date_posted": "2025-12-08 18:02:14",
      "location": "United States",
      "remote": "Remote",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4342773736/",
      "days_since_posted": 0,
      "application_url": "Easy Apply (LinkedIn)"
    },
    {
      "job_title": "Manager, Data - Retail & eCommerce Analytics",
      "company": "a.k.a. Brands",
      "description": "Overview a.k.a. Brands is seeking a Manager, Data Retail & eCommerce Analytics to join our growing Data & Analytics team. In this role, you’ll leverage data to uncover insights that drive strategy and decision making across our portfolio of next generation fashion brands. You’ll partner closely with teams in Merchandising, Planning, Marketing, Finance, and Operations to analyze performance across digital and retail channels. The ideal candidate combines strong technical skills with business acumen and a passion for retail and fashion. You’re a self starter who thrives on solving complex problems, optimizing performance, and transforming data into clear, actionable insights that create measurable business impact. Key Responsibilities Conduct advanced analyses on sales, inventory, pricing, and customer performance across DTC and retail channels to identify trends and opportunities. Partner cross functionally to deliver insights that support forecasting, planning, and strategic decision making. Lead deep dive analyses into brand, channel, and customer behavior to uncover growth and efficiency opportunities. Collaborate with the data engineering team to develop new metrics, data streams, and data structures that enhance data accessibility and reporting capabilities. Collaborate with data engineering to enhance data quality, streamline pipelines, and build scalable data models that improve access and reliability. Develop and maintain dashboards, visualizations, and reports (Tableau or similar) to track key business metrics. Ensure accuracy, consistency, and governance of data across analytics and reporting systems. Translate complex data findings into concise, business friendly presentations and recommendations for stakeholders. Support continuous improvement of analytical frameworks, metrics, and processes across the organization. Qualifications Bachelor’s degree in Data Analytics, Business, Economics, Statistics, or a related field. 4–7+ years of experience in data or business analytics, ideally in retail, fashion, or consumer goods. Strong proficiency in SQL, Excel/Google Sheets, and at least one BI tool (Tableau strongly preferred). Deep understanding of retail and eCommerce performance metrics (sales, conversion, inventory, margin, customer segmentation). Excellent storytelling and communication skills — able to distill data into clear insights and influence decisions. Experience working with omnichannel data from platforms such as Shopify, NetSuite, or similar systems is a plus. Detail oriented with strong problem solving skills and the ability to work independently in a fast paced environment. Location Hybrid in San Francisco or fully remote. show less",
      "date_posted": "2025-12-01 19:02:51",
      "location": "United States",
      "remote": "Remote",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4324580637/",
      "days_since_posted": 7,
      "application_url": "Easy Apply (LinkedIn)"
    }
  ]
}