{
  "metadata": {
    "job_title": "analyst",
    "timestamp": "2025-10-28 14:43:10",
    "total_jobs": 75
  },
  "jobs": [
    {
      "job_title": "Research Analyst - CEO Strategic Communications",
      "company": "Section",
      "description": "Company Overview Section is an AI transformation company that helps organizations get real value from generative AI. AI powered workforces will have a sustained competitive advantage over the next decade, but most of the workforce is unprepared. We help organizations plan their AI transformation, upskill their workforce, and integrate AI into their workflows and business processes – all with the goal of driving real productivity gains and ROI. Our goal is to bring a million workers into the “AI class” by 2026. Position Overview We are seeking a strategic Research Analyst to partner closely with our CEO, Greg Shove, to elevate his thought leadership and grow awareness of his personal and company brand. This role combines rigorous business analysis with strategic communications, requiring someone who can translate complex insights into compelling executive level content across multiple channels. Key Responsibilities Research and analysis Be the expert source on AI business news at Section, consuming everything from news and newsletters to podcasts and earnings reports Conduct smart, fast time to value research on the business landscape of AI Analyze reports, data, and market intelligence for insights others would miss Work with Greg to brainstorm new ideas and develop nuanced points of view on industry events Content development and strategy Develop high impact presentation decks for speaking engagements and executive meetings Write and edit newsletter content for Greg’s AI newsletter Create scripts and content frameworks for YouTube videos and other video content Draft submitted posts, articles, and other written materials for publication Strategic communications support Collaborate with Greg Shove to understand his perspectives and translate them into various content formats Support preparation for speaking engagements, including research, talking points, and presentation materials Required Qualifications Experience and background 5+ years of professional experience in analysis, writing, and presentation development Background in consulting, business analysis, or similar research intensive roles preferred Demonstrated experience creating executive level presentations and strategic content Core competencies Regular user of AI with deep curiosity about AI/business – having tried ChatGPT once or twice is not enough Exceptional research and analytical skills with ability to synthesize complex information Strong business acumen and understanding of market dynamics Excellent written and verbal communication skills Proficiency in Google Slides Ability to adapt writing style to match an executive’s specific voice Working style Detail oriented with strong project management skills Ability to work independently while maintaining close collaboration with CEO Comfortable in fast paced environment with competing priorities Strategic mindset with focus on outcomes and impact What We’re Looking For The ideal candidate is research driven and business minded, not simply a copywriter. You should be someone who can engage with Greg's strategic thinking, challenge ideas constructively, and enhance them through research and analysis. This role requires someone who can seamlessly move between deep analytical work and creative content development. Compensation Competitive salary range of $110,000 $150,000, commensurate with experience and qualifications. This role offers the opportunity to work directly with executive leadership while building expertise in executive research, strategic communications, and thought leadership development. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4270336759/"
    },
    {
      "job_title": "Senior Data Analyst",
      "company": "SimplePractice",
      "description": "About Us At SimplePractice, we are improving access to quality care by equipping health and wellness clinicians with all the tools they need to thrive in private practice. More than 250,000 providers trust SimplePractice to build their business through our industry leading software with powerful tools that simplify every part of practice management. From admin work to clinical care, our suite of innovative solutions work together to reduce administrative burden—empowering solo and small group practitioners to thrive alongside their clients. Recognized by MedTech Breakthrough as the Best Practice Management Solution Provider in 2024 and the Digital Health Awards in 2023, SimplePractice is proud to pave the future of health tech. The Role As a Senior Data Analyst, you’ll play a key role in shaping our data driven culture. Your day to day will blend technical problem solving with strategic thinking—developing metrics frameworks, optimizing reporting pipelines, and uncovering insights that guide Product, Design, Engineering and other key business areas. Using SQL, Tableau, and advanced analytics techniques, you’ll transform raw data into actionable insights, empowering stakeholders with the clarity they need. You’ll collaborate cross functionally to define success, measure impact, and drive continuous improvement. You’ll have the opportunity to mentor others and foster a culture of innovation by using data to drive product enhancements and business improvements. Whether designing experiments, optimizing user experiences, or translating insights into action, your work will directly contribute to better business outcomes and customer experiences. Responsibilities Develop automated reports and dashboards to support product and business operations, ensuring data accessibility and efficiency. Analyze complex datasets using SQL and Tableau to uncover trends, drive actionable insights, and influence product roadmaps and executive decisions. Collaborate with Product, Engineering, and Design teams to deliver data driven solutions that align with business goals. Apply advanced analytics and statistical methods to identify key business trends and optimize decision making. Design and implement scalable data models that integrate multiple sources, ensuring accuracy, reliability, and accessibility. Effectively communicate insights and analysis results to stakeholders across SimplePractice, highlighting opportunities to better serve both the business and its customers. Mentor team members and act as a data subject matter expert, driving best practices in analytics and reporting. Desired Skills & Experience 7+ years of experience in data analysis and analytics, with a proven track record of mentoring team members. Advanced knowledge of data analysis tools and programming languages such as SQL and Python. Experience building dashboards and visualizations in Tableau or similar BI tools. Ability to interpret complex data using advanced analytics, such as predictive modeling, to forecast trends and optimize business outcomes. Excellent verbal and written communication skills, with the ability to convey technical information to multiple stakeholders. Proven ability to manage multiple projects and effectively collaborate with multiple stakeholders. Enthusiastic about data and analytics, learning new techniques and skills, and working with data scientists and engineers. Bonus Points Experience with dbt Cloud or similar tools Knowledge of ETL pipelines and data warehouse best practices Knowledge of techniques such as regression analysis, hypothesis testing, and multivariate analysis. Base Compensation Range $140,000 $173,000 annually Base salary is one component of total compensation. Employees may also be eligible for an annual bonus or commission. Some roles may also be eligible for overtime pay. The above represents the expected base compensation range for this job requisition. Ultimately, in determining your pay, we’ll consider many factors including, but not limited to, skills, experience, qualifications, geographic location, and other job related factors. Benefits We offer a competitive benefits program including: Medical, dental, vision, life & disability insurance 401(k) plan with company match Flexible Time Off (FTO), wellbeing days, paid holidays, and summer Fridays Mental health resources Paid parental leave & Backup Care Tuition reimbursement Employee Resource Groups (ERGs) California Job Applicant Privacy Notice Thank you for your interest in opportunities at SimplePractice LLC (“SimplePractice” or “us” or “we” or “our”). Please note that when you submit your resume or application materials to us for employment purposes, you are subject to the SimplePractice California Job Applicant Privacy Notice. For more information about our privacy practices, please contact us at privacy@simplepractice.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4270542488/"
    },
    {
      "job_title": "Senior Database Marketing Analyst",
      "company": "Robert Half",
      "description": "Position: CDP DATA ANALYT ENTERPRISE DIGITAL TEAM Location: REMOTE Salary: UP TO $140,000 BASE + BENEFITS *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume.My email can be found on my LinkedIn page. *** Join a greenfield digital initiative backed by a Fortune 500 parent company. Help design and build a Customer Data Platform (CDP) from scratch to deliver unified customer insights and enable personalization at scale. Key Responsibilities: Define CDP data requirements and design data models for a 360° customer view. Integrate data from CRM, ERP, web, and mobile sources. Implement data quality checks, governance, and compliance standards. Build dashboards and reports for segmentation and analytics. Required Skills & Experience: 5+ years in data analysis with customer data focus. Advanced SQL and Python for data manipulation. Experience with ETL/ELT pipelines and tools (dbt, Airflow). Familiarity with CDP platforms or custom built solutions. Knowledge of cloud data architectures (AWS, Azure, GCP). Nice to Have: Identity resolution, customer journey analytics, personalization strategies. *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume.My email can be found on my LinkedIn page. Also, you may contact me by office: 515 303 4654 or mobile: 515 771 8142. Or one click apply on our Robert Half website.No third party inquiries please.Our client cannot provide sponsorship and cannot hire C2C. *** show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318886274/"
    },
    {
      "job_title": "Sr. Director, Analyst, Enterprise Marketing Leadership and Strategy (Remote US)",
      "company": "Gartner",
      "description": "Senior Director Analyst, Marketing Leadership and Strategy Gartner is seeking an Analyst that will change how CMOs deliver business impact. About This Role: Gartner Analysts are thought leaders who deliver actionable, objective insight through must have research and advice that drives smarter decisions and stronger performance against the mission critical priorities of world leading organizations. A Senior Director serves as a leader within Gartner’s Research and Advisory business, establishing themselves as a credible voice within their designated market at local, regional, and global levels. Utilizing exceptional research and analytical skills, a Senior Director plays a significant role in producing pragmatic and provocative research which Gartner clients consume and apply to propel their business toward key objectives. They are a trusted source of advice for clients, reinforcing Gartner’s value every day by engaging clients via in person meetings, virtual meetings, sales support visits and Gartner conferences to discuss complex client challenges and offer appropriate recommendations. This role sits within Gartner’s Marketing & Communications practice and will address the needs of CMOs and their key leaders in transforming the marketing function for maximum business impact. As disruptive forces inside and outside the enterprise are resetting the expectations and objectives of CMOs, this role will focus on Marketing Leadership and Strategy. The leader in this role will guide CMOs in addressing challenges and seizing opportunities related to Marketing Strategy Development, Functional Leadership and Collaboration, and Marketing led Innovation and Transformation, as connected levers to harness disruptions to their advantage. Successful candidates will use a deep understanding of the CMO role and responsibilities and the unique challenges and opportunities facing marketing, particularly against a backdrop of volatility, uncertainty, complexity and ambiguity, to advise CMOs and marketing leaders on how to: Marketing Strategy Development Lead the development and delivery of marketing strategic plans that align marketing strategies, objectives, activities and resources to the enterprise vision, goals and strategic outcomes Prove and articulate the value of marketing to the enterprise to increase CxO understanding of marketing’s role, show its impact on enterprise priorities, and secure budget and resources Build and execute marketing strategies that are reflective of—and resilient to—market changes and deliver value, demonstrating CMO accountability for and marketing impact on business growth Functional Leadership and Collaboration Define the role of the CMO and the marketing function inside the enterprise, balancing an ability to identify and fulfill unmet customer needs with the capabilities to lead the marketing function Define and establish the role of marketing in cross functional initiatives, including fostering effective partnership and trust based relationships with other CxO, functions or departments Drive effective coordination and collaboration in and outside of marketing, identifying and taking action to avoid pitfalls that lead to dysfunctional collaboration or serve as obstacles to collaboration Marketing led Innovation and Transformation Define and establish marketing’s role in leading or contributing to the organization's innovation or transformation initiatives, including aligning resources and ensuring a sustainable approach Use marketing led innovation to fuel growth and long term business health by making marketing a forward looking insights engine for the enterprise Manage innovation projects, building marketing’s ability to identify relevant trends, evaluate their potential impact, and sense and respond to growth opportunities What You Will Do Deliver high quality, impactful advice to an executive client audience through a variety of media Create evidence based content, taking strong positions and delivering actionable recommendations Create and deliver presentations for webinars and other client facing Gartner events Deliver outstanding sales and service support to retain and grow the Gartner business Build credibility as an industry expert to represent Gartner research, methodology and strategy. Actively participate in innovation, ideation, and research discussions and collaborate effectively with peers in our research community Identify research process improvements or develop new processes that help the team and Research & Advisory provide excellent service delivery Serve as a mentor and a coach by supporting peers, colleagues and junior team members What You’ll Need Bachelor's degree or equivalent experience; Graduate degree preferred 12+ years of relevant marketing experience; CMO or equivalent experience preferred An informed understanding of the challenges facing CMOs as leaders within the enterprise and drivers of business impact Extensive experience leading a marketing team, department or function and/or advising CMOs or senior marketing executives Extensive experience leading development and execution of marketing strategies and aligning resources that drives enterprise growth Experience successfully building the business case for marketing strategies or plans, resources and budgets and demonstrating measurable results and marketing’s impact on business outcomes Experience as a leader in marketing led innovation and transformation efforts that impact people, process and technology Demonstrated ability to quickly establish credibility with executives and key stakeholders Strong organizational and time management skills; ability to work under tight deadlines, manage expectations, and produce high quality deliverables Demonstrate excellence in research and writing ability Strong written and verbal proficiency, analytical and presentation skills; ability to engage clients and respond effectively to questions Proficient in analyzing and synthesizing data; can effectively apply patterns and frameworks while drawing and defending conclusions to client challenges Strong communication skills to explain complex concepts concisely and simply Comfort presenting at large and small scale speaking engagements, online and in person Strong business and financial acumen Ability to work independently, while also being intrinsically motivated to collaborate across teams and support the workflow of others, in a multicultural global team Learning agile and adept with navigating highly matrixed environments Ability to represent Gartner's research methodology and strategies effectively at all levels Who are we? At Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world. Our mission relies on expert analysis and bold ideas to deliver actionable, objective insight, helping enterprise leaders and their teams succeed with their mission critical priorities. Since our founding in 1979, we’ve grown to more than 21,000 associates globally who support ~14,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here. What makes Gartner a great place to work? Our sustained success creates limitless opportunities for you to grow professionally and flourish personally. We have a vast, virtually untapped market potential ahead of us, providing you with an exciting trajectory long into the future. How far you go is driven by your passion and performance. We hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients. Our teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work. What do we offer? Gartner offers world class benefits, highly competitive compensation and disproportionate rewards for top performers. In our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring. Ready to grow your career with Gartner? Join us. Gartner believes in fair and equitable pay. A reasonable estimate of the base salary range for this role is 152,000 USD 190,000 USD. Please note that actual salaries may vary within the range, or be above or below the range, based on factors including, but not limited to, education, training, experience, professional achievement, business need, and location. In addition to base salary, employees will participate in either an annual bonus plan based on company and individual performance, or a role based, uncapped sales incentive plan. Our talent acquisition team will provide the specific opportunity on our bonus or incentive programs to eligible candidates. We also offer market leading benefit programs including generous PTO, a 401k match up to $7,200 per year, the opportunity to purchase company stock at a discount, and more. The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to seek to advance the principles of equal employment opportunity. Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964 0096 or by sending an email to ApplicantAccommodations@gartner.com. Job Requisition ID:99813 By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence. Gartner Applicant Privacy Link: https://jobs.gartner.com/applicant privacy policy For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser. show less",
      "date_posted": null,
      "location": "Texas, United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4256382605/"
    },
    {
      "job_title": "Sr. Analyst, Business Analytics",
      "company": "Wisetack",
      "description": "Since 2018, Wisetack has been building transparent and intuitive consumer lending products that help service based businesses thrive (think HVAC companies, veterinarians, or auto repair shops). Our leadership team comes from top fintech companies such as Lending Club, Affirm, and Varo Money. And we’re backed by leading VCs, including Insight Partners, Greylock, Quadrille, and Bain Capital Ventures (investors in Airbnb, LinkedIn, Instagram, Dropbox, and more). Having raised $84M, we’re a well funded startup and have invested in people and technology while growing our partnerships — responsibly. We’re also proud to have received recognition from the fintech world. Awards we’ve won include: Ranked #21 on 2024 Inc. 5000 based on revenue growth Ranked #15 on 2024 Deloitte Fast 500 based on revenue growth 2024 Best Embedded Finance Solution for Banking Tech Awards 2023 Best Consumer Lending Program by Tearsheet 2023 Best Point of Sale Product by Fintech Breakthrough But what you’ll find us gleaming about the most is the recognition from our own customers, particularly our sky high NPS rating of 79. (For reference, the average score is 44 for financial services and 36 for SaaS companies.) As a result of our efforts in building this healthy company culture, we’ve been nominated to several Great Places to Work lists, such as Best Small Workplaces, Best Workplaces in the Bay Area, and Best Workplaces in Financial Services & Insurance. Like any startup, we’re in it for the long haul, and we’re looking for people willing to join our journey of building something special together. This process starts with our company values, which guide us in everything we do — and have played a critical role in our success. We valiantly abide by them, and would expect you to do the same: Put customers first (that’s our M.O.) Act fast (leverage our startup environment). Lead the way (show and tell). Take ownership (everyone is hands on here). Be a good human (no egos, build financial products that do right by people). Learn more about our values here. The Role As a Senior Analyst at Wisetack, you will play a pivotal role in shaping the future of our consumer lending product by developing data driven solutions for key business functions, including growth, operations, and product. You will guide the direction of projects to ensure metrics across teams are consistent, reliable, accurate, and enable data driven strategic and operational decision making. You possess deep technical expertise and business acumen to be able to connect the dots, deliver impactful insights, and identify scalable opportunities that align with our strategic goals. You work autonomously and take proactive ownership of problems, solving them with data driven solutions. Collaboration is key in this role. You will work closely with cross functional teams to ensure solutions are seamlessly integrated into our products and workflows, directly contributing to our mission of building transparent, intuitive consumer lending products. Your ability to communicate complex and technical topics clearly and in an actionable manner will be crucial to your success. In our fast paced startup environment, we value quick thinking, hands on contributions, and a strong sense of ownership. If you are passionate about leveraging data to lead the way in creating innovative financial solutions that make a positive impact, we want to hear from you. Responsibilities Work with business stakeholders to translate business problems into analytics solutions and insights (i.e. deep dive research and analyses, self service dashboards, predictive models). Design and build metrics / dimensions to monitor product and business performance. Communicate and present insights to stakeholders, including executive leadership, of varying degrees of technical expertise in concise, non technical language. Partner closely with data engineering, data science, and product to develop an integrated, scalable analytics ecosystem. Use industry standard data tooling for data ingestion, orchestration, transformation / modeling, visualization, and deployment of solutions. Write clear and thorough documentation of your work, including your thought process, and identify future opportunities for improvement where applicable. Requirements 3+ years of professional experience in business analytics, business intelligence, decision science, or a related field; 2+ Years of professional experience with an MBA. Bachelor's degree in a quantitative field (e.g. Economics, Engineering, Mathematics) Experience working with cross functional teams and building relationships across departments. Proficiency in data analysis tools and statistical computing programs (e.g. SQL and Python or R). Proficiency with data visualization tools (e.g. Tableau). Knowledge of data ingestion, orchestration, and ETL processes and tools (e.g. Airbyte, Dagster, dbt). Strong project management, problem solving, and communication skills. Bonus Points FinTech experience, particularly within embedded finance and consumer lending Conclusion The range of base salary for the position is between $100,000 $140,000, plus equity, and benefits. Please note that the base salary range is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level and competencies. Spend a little time on our About Us page and check out our Press page and our blog for more. If you think this might be a fit, we’d love to hear from you! show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4264271057/"
    },
    {
      "job_title": "Sr Analyst, Data Scientist",
      "company": "EcoMetric",
      "description": "We are seeking a Data Scientist with 3 5 years of experience to join our growing team. This role is ideal for someone who thrives on solving complex problems, enjoys working with large datasets, and is passionate about energy efficiency and sustainability. You’ll work closely with senior consultants and clients to analyze utility program data, develop predictive models, and generate actionable insights that shape energy policy and program design. About EcoMetric EcoMetric Consulting LLC was founded in 2016 with a mission to provide inspired, forward thinking advisory services that inform demand side management (DSM) decision making. We specialize in leveraging data to improve energy efficiency programs and practices across North America. As a Minority Certified Enterprise (MCE) recognized by the National Minority Supplier Development Council (NMSDC), we proudly support supplier diversity and sustainability. Our team of passionate consultants delivers a comprehensive range of DSM advisory services to natural gas and electric utilities, regulatory agencies, and market stakeholders. We are industry leaders in energy efficiency program evaluation, technical reference manual development, and regulatory support. If you're excited about using data to drive meaningful change in energy use and policy, we’d love to meet you. We offer a casual, friendly working environment, and we are dedicated to the quality of our work and our client relationships. We offer competitive salaries, benefits, and vacation package for full time employees. Duties and Responsibilities Clean, prepare, and integrate data from diverse sources for advanced analytics. Analyze large datasets (e.g., energy consumption, financial, market research) to identify trends and causal impacts. Develop predictive and prescriptive models using machine learning and statistical techniques. Conduct econometric modeling and regression analysis to evaluate energy efficiency programs. Collaborate with internal teams and clients to ensure consistency and quality in research methods. Document findings through visualizations, memos, and client reports. Support senior staff in developing presentations, white papers, and technical documentation. Document findings visually and/or verbally for memos and reports to clients and/or internal project teams. Support senior staff with the development of presentations and papers. Qualifications Required: Bachelor's or master's degree in physics, applied mathematics, economics, statistics, environmental policy, or related field. 3 5 years of experience in data science, ideally within energy efficiency, utilities, or sustainability. Strong programming skills in Python, R, SQL, or similar languages. Experience with regression, classification, and time series modeling (e.g., RF, SVM, LR). Proficiency in Microsoft Excel; VBA knowledge is a plus. Demonstrated ability to clean, manipulate, and analyze large datasets (500,000+ records). Strong written and verbal communication skills. Interest in energy policy, building science, or sustainability. Preferred: Experience with energy efficiency program evaluation or DSM analytics. Familiarity with IoT data and API integration. Knowledge of TRMs, M&V protocols, or building energy modeling tools (e.g., EnergyPlus, OpenStudio). Experience with SAS, Stata, or other statistical packages. Bachelor's or master's Degree in physics, applied mathematics, economics, statistics, environmental policy, or a related field What You Will Get in Return: Engaging work environment Competitive salary based on qualifications Flexible personal time off(15 20 days), 10 holidays, two flex holidays Maternity/Paternity paid leave 401(k) Plan Medical, vision, and dental insurance Life insurance, and short term and long term disability insurance Reimbursement for professional development training or certification Mileage reimbursement on personal vehicle use for work related travel show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317478267/"
    },
    {
      "job_title": "Data Analyst with Product Analytics experience",
      "company": "Catalyte",
      "description": "We are looking for a Data Analyst with Product Analytics experience for a 100% remote, 6 month +, W 2 contract with benefits Must be a US Citizen or Green Card Holder. No 3rd Party C2Cs Please. Overview: We are looking for a Data Analyst with product analytics experience, including: Extensive experience with A/B testing, experience using Eppo would be a plus Working with sessions and clickstream data Working with product managers and engineers Experience in web analytics software like Amplitude, Segment, Mixpanel Data Modeling experience is REQUIRED Expert level SQL skills are REQUIRED Strong Python experience is REQUIRED Responsibilities: Improve customer experiences by developing bar raising metrics, self service tools, and deep analyses that drive actionable insights Collaborate with stakeholders to manage a long term analytic roadmap that balances the tactical and strategic needs of the business Proactively identify opportunity areas for improvement including deep dive investigations and processes to better serve our customers Drive the vision, building, and adoption of self service analytic capabilities; develop these capabilities at scale Understand data resources and know when, how, and which best to use for each project Ability to frame and break down complex business problems into key components and recommend practical solutions Monitor key performance metrics and use data to identify actionable opportunities to increase efficiency and make high quality decisions that drive performance improvements Build a collaborative team environment that fosters efficient execution, innovation, and continuous improvement Develop and support the analytical technologies that give our team timely, flexible, and structured access to their data Requirements: 5+ years of relevant experience Advanced SQL and data modeling skills Strong Python experience Proficient using at least one data visualization product (Looker, Tableau, QuickSight, etc.) Extensive experience with A/B testing, experience using Eppo would be a plus Experience working with sessions and clickstream data Experience in web analytics software like Amplitude, Segment, Mixpanel Excellent written and verbal communication skills are required, including experience meeting with and communicating information to senior leadership Highly collaborative, with an ability to optimally secure inputs from many cross functional partner teams Ability to think strategically, formulate appropriate analytical solutions, and execute in order to solve business needs Nice to haves: Report automation experience (e.g. using Python, R) Knowledge of AWS services and cloud computing Experience with descriptive and inferential statistics Experience with financial industry regulations Experience with customer support metrics/data show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4312227028/"
    },
    {
      "job_title": "Senior Product Analyst",
      "company": "SmarterDx",
      "description": "SmarterDx, a Smarter Technologies company, builds clinical AI that is transforming how hospitals translate care into payment. Founded by physicians in 2020, our platform connects clinical context with revenue intelligence, helping health systems recover millions in missed revenue, improve quality scores, and appeal every denial. Become a Smartian and help optimize the way the healthcare system works for everyone. Learn more at smarterdx.com/careers. Role We’re seeking a Senior Data Analyst specializing in product analytics to help shape the future of our revenue cycle management platform. In this highly cross functional role, you'll collaborate with product managers, engineers, and business stakeholders to gauge opportunities, guide strategy, and inform decisions with data. You’ll explore new datasets, build prototypes, monitor performance, and measure the product impact. This role offers a unique chance to take a leading role in delivering on an ambitious product roadmap using data to enhance the operational efficiency of healthcare providers. This role is fully remote within the US** What You'll Do Partner with product managers and engineers to translate business goals into analytical requirements, perform exploratory analyses, and clearly communicate findings to support strategic decisions Design experiments to answer business questions, including defining key metrics and applying appropriate statistical techniques to analyze results Prototype analytics solutions and data products to accelerate product development Translate analytical findings into compelling data stories through clear visualizations that help stakeholders quickly grasp trends, patterns, and implications Becoming an expert in our data stack: how we get the data from customers, how we normalize that data, and how internal teams and customers consume that data Building, maintaining, and testing data models which support reporting and analytics. Uphold high standards for code quality and documentation, while contributing to a culture of peer review and continuous learning What You Bring 3 5+ years' experience as a data analyst or product data scientist (or, if your y intercept is lower, evidence that your slope is super steep) Strong technical skills: querying data with SQL, transforming data with dbt to shorten time to insight, performing analysis with python, and communicating findings with compelling data visualizations Masters in statistics or other relevant fields preferred Ownership: Build and own features from start to finish. Strategic mindset: strong ability to connect analytics to business understanding and provide actionable insights. Scrappiness: Navigate ambiguity effectively, understanding when it’s necessary to piece solutions together on the fly, and be able to do so. Product focus: How can we maximize the utility and value we deliver to our end users? Familiarity with experiment design and statistical analysis Nice To Haves Experience with health system clinical and/or revenue cycle data is preferred Our Tech Stack Data Visualization: Hex and Evidence Analysis: Python & Data Science libraries (numpy, pandas, etc) Pipelines: Snowflake, dbt, airflow, git, and AWS Compensation $150,000 to $180,000 salary + equity incentives Benefits Medical, Dental & Vision – Comprehensive plans with leading insurance providers, covering 90 100% of your premiums and 70 90% for dependents, depending on the plan. One Medical Membership – Free membership included if you enroll in a SmarterDx medical plan. Paid Parental Leave – Generous paid leave to support families through birth or adoption: Up to 12 weeks for birthing parents and 6 weeks for non birthing parents. Remote First Team – Work from anywhere in the U.S. with a $400 home office reimbursement stipend. Unlimited PTO & 10 Holidays – 4 of which include floating holidays so you can recognize the days that matter most to you. Learning & Development Budget – $500 per year (prorated) for courses, books, and resources to expand your skills. 401(k) with Traditional & Roth Options – Tax advantaged retirement savings through Empower. Minimal Bureaucracy – A fast moving, high impact environment where you can focus on what matters. Incredible Teammates! – Work alongside smart, supportive, and mission driven colleagues. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4258565192/"
    },
    {
      "job_title": "Senior Business Analyst",
      "company": "Sapphire Recruitment",
      "description": "Senior Business Analyst – Clean Energy Industry (Remote) $80 150K /yr DOE Sapphire Recruitment is seeking experienced Business Analysts and Senior Business Analysts to support process improvement, system enhancement, and operational excellence initiatives within two key areas of New York’s clean energy mission — Technical Services and Clean and Resilient Buildings. These roles will help streamline workflows, enhance Salesforce functionality, and strengthen the quality and consistency of internal and external stakeholder experiences. What You’ll Do Translate business needs into clear technical requirements and process documentation Support Salesforce design, configuration, and automation (Flows, Approvals, Lightning) Facilitate User Acceptance Testing (UAT) and lead end user training Develop and maintain process documentation, dashboards, and reports Triage bug and enhancement tickets, coordinating resolution and quality assurance Perform systems analysis, data mapping, and reporting across multiple programs Collaborate with technical and program teams to implement process and system improvements What You Bring Bachelor’s degree in Information Systems or related field (or equivalent experience) 3–7+ years of experience in business analysis, process design, or system optimization Strong Salesforce expertise; experience with Jira, SharePoint, and Tableau Understanding of relational databases and SQL queries Proven ability to manage multiple projects and priorities independently Strong communication, documentation, and problem solving skills Highly organized self starter who thrives in a collaborative, fast paced environment Details Remote | Full time (40 hours/week) | Engagement through 2029, renewable Tools: Salesforce, Jira, SharePoint, Tableau Join a forward thinking team driving digital transformation and operational efficiency across New York State’s clean energy initiatives. Submit your resume to energyjobs@hiresapphire.com for immediate consideration. Sapphire Recruitment is an EOE show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4332318494/"
    },
    {
      "job_title": "Senior Business & Data Insights Analyst - Remote / PA",
      "company": "Pinnacle Consulting & Recruitment",
      "description": "Senior Business & Data Insights Analyst Overview The Senior Business & Data Insights Analyst partners with leadership and cross functional teams to transform complex data into clear, actionable intelligence that drives strategy and business performance. This role combines analytical expertise, business acumen, and storytelling to identify strategic needs, determine the most impactful narrative, and communicate insights that guide leaders toward informed, strategically aligned actions. The analyst will play a key role in shaping data driven decision making and advancing the organization’s analytics maturity. Key Responsibilities • Lead all phases of insights projects—from defining business needs and designing data strategies to developing dashboards, reports, and visualizations that inform executive decision making. • Evaluate strategic priorities, identify the right data story to tell, and translate complex findings into concise, actionable insights that resonate with senior leadership. • Create compelling data narratives and visual stories that clearly communicate business implications and support strategic initiatives. • Design, build, and maintain interactive dashboards and reports that monitor key performance indicators across functions such as business development, client strategy, operations, and finance. • Collaborate with data scientists, analysts, and business leaders to advance predictive and prescriptive analytics that anticipate trends and identify growth opportunities. • Analyze internal and external data sources—including CRM, billing, and financial systems—to identify patterns, track client activity, and uncover opportunities for cross selling and market expansion. • Partner with teams across departments (e.g., Finance, Strategy, Client Value, Marketing, HR, IT, and Operations) to deliver customized analytics solutions that address key business challenges. • Ensure data quality, governance, and consistency across analytics platforms by maintaining standards, definitions, and best practices for metrics and reporting. • Stay informed on emerging trends in data visualization, analytics, and AI to continuously enhance insight delivery and storytelling capabilities. • Mentor and support junior analysts, fostering a culture of analytical excellence and innovation. Qualifications • Bachelor’s degree in Business Analytics, Data Science, Economics, or related field; advanced degree preferred. • 5+ years of experience in business analysis, data insights, or analytics roles supporting executive leadership and strategic planning. • Proficiency in data visualization and analytics tools (e.g., Power BI, Tableau, SQL, Python, or R). • Strong ability to translate complex data into actionable recommendations through storytelling and visual design. • Demonstrated success working cross functionally with business and technical teams to deliver impactful, data driven solutions. • Excellent analytical thinking, communication, and project management skills. show less",
      "date_posted": null,
      "location": "Pennsylvania, United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331860711/"
    },
    {
      "job_title": "Senior Data Analyst [Remote-US]",
      "company": "Quanata",
      "description": "To help keep everyone safe, we encourage all applicants to pay close attention to protect themselves during their job search. When applying for a position online you are at risk of being targeted by malicious actors looking for personal data. Please be aware we will only reach out via email using the domain quanata.com. Anything that does not match those domains should be ignored and considered a security risk. About Us Quanata is on a mission to help ensure a better world through context based insurance solutions. We are an exceptional, customer centered team with a passion for creating innovative technologies, digital products, and brands. We blend some of the best Silicon Valley talent and cutting edge thinking with the long term backing of leading insurer, State Farm. Learn more about us and our work at quanata.com Our Team From data scientists and actuaries to engineers, designers and marketers, we’re a world class team of tech minded professionals from some of the best companies in Silicon Valley, and around the world. We’ve come together to create the context based insurance solutions and experiences of the future. We know that the key to our success isn't just about nailing the technology—it’s hiring the talented people who will help us continue to make a quantifiable impact. The Role The Senior Data Analyst will work with teams (product, growth marketing, engineering, data science, CX and business owners, etc.) to measure, understand, and monitor key business metrics across our mobile apps and websites. The ideal candidate will be comfortable working with datasets across a variety of systems (SQL, Firebase,...). Your day to day Deliver ad hoc analysis with actionable insights Translate stakeholders’ priorities into dashboards Maintain data pipeline automation Communicate and collaborate with a variety of stakeholders among different teams (product, growth marketing, engineering, data science, CX,...) About You Bachelor’s Degree or equivalent relevant experience and; 8+ years of relevant experience Web and mobile analytics experience using a variety of tools (ie. Firebase, Mixpanel, Google Analytics, Segment) Experience using SQL Python experience Experience with web and mobile tagging, including tag management system (GTM, DTM,...) Experience with data pipeline and orchestration tools like DBT, Airflow Ability to build and manage dashboarding tools (Redash, Tableau, Snowsight...) Strong analytical skills Team player Highly organized, attention to detail and curious Bonus Points Bachelor’s Degree in quantitative or business fields Previous experience(s) in a startup in an analytics role is a plus. Not everything has been built yet and data is often messy or incomplete. This role is just as much of doing the difficult work to design the core system as it is in getting reliable analytics results. Salary: $150,000 to $185,000* *Please note that the final salary offered will be determined based on the selected candidate's skills, and experience, as well as the internal salary structure at Quanata. Our aim is to offer a competitive and equitable compensation package that reflects the candidate's expertise and contributions to our organization. Additional Details: Benefits: We provide a wide variety of health, wellness and other benefits.These include medical, dental, vision, life insurance and supplemental income plans for you and your dependents, a Headspace app subscription, monthly wellness allowance and a 401(k) Plan with a company match. Work from Home Equipment: Given our virtual environment— in order to set you up for success at home, a one time payment of $2K will be provided to cover the purchase of in home office equipment and furniture at your discretion. Also, our teams work with MacBook Pros, which we will deliver to you fully provisioned prior to your first day. Paid Time Off: All employees accrue four weeks of PTO in their first year of employment. New parents receive twelve weeks of fully paid parental leave which may be taken within one year after the birth and/or adoption of a child. The twelve weeks is applicable to both birthing and non birthing parent. Personal and Professional Development: We’re committed to investing in and helping our people grow personally and professionally. All employees receive up to $5000 each year for professional learning, continuing education and career development. All team members also receive LinkedIn Learning subscriptions and access to multiple different coaching opportunities through BetterUp. Location: We are a remote first company for most positions so you may work from anywhere you like in the U.S, excluding U.S. territories. For most positions, occasional travel may be requested or encouraged but is not required. Some positions might require travel per the job description provided to the employee. Employees based in the San Francisco Bay Area or in Providence, Rhode Island may commute to one of our local offices as desired. Hours: We maintain core meeting hours from 9AM 2PM Pacific time for collaborating with team members across all time zones. Quanata, LLC is an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. If you are a San Francisco resident, please read the City and County of San Francisco's Fair Chance Ordinance notice. https://www.sf.gov/sites/https://www.sf.gov/sites/default/files/2022 12/FCO%20poster2020_0.pdf This role is employed by Quanata, LLC which is a separate company in the State Farm family of companies. If you require a reasonable accommodation, please reach out to your Talent Acquisition Partner for assistance. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4258777392/"
    },
    {
      "job_title": "Lead Business Intelligence Analyst",
      "company": "Thryv",
      "description": "About the Position At Thryv, we are a team that lives by teamwork. However, it’s not the work that drives us, it’s the respect, trust, and care for each other that defines us as a team. We’re a diverse community of trendsetters who do our best work in a fun, relaxed environment. Technology never stops evolving and neither do we. We’re always looking for the best and brightest team players to join us. We’re looking for a Lead Business Intelligence Analyst to partner with Finance Operations, Marketing, and Product to drive real time decision making. This is a strategic insights role, not a dashboard building position. This role will work directly with raw, often imperfect data sets to surface what matters most—translating data into KPIs, visual narratives, and actionable guidance for the business. This role is ideal for someone who is analytically sharp, business minded, and obsessed with turning noise into clarity. Responsibilities Analyzes large, multi source datasets to uncover business insights that support GTM, product pricing, and financial strategy. Partners with Finance Ops to connect business performance with financial metrics including CAC, LTV, funnel velocity, and retention. Defines and refines KPIs that align execution with company objectives and partners with cross functional teams to implement strategy. Supports campaign performance analysis, segment behavior trends, pricing elasticity, and product monetization strategy. Summarizes insights into concise, visual presentations with bullet points, charts, and storyboards that speak directly to business leaders. Drives cross functional analysis by blending marketing, product, and financial data into cohesive performance stories. Influences C level decisions with strategic insight and crisp communication. Who We’re Looking For Bachelor’s Degree (or international equivalent), required. 9+ years of related experience, required. Experience in Business Intelligence, Strategic Analytics, or similar roles in a B2B SaaS environment, required. Proven experience working with Finance, Marketing, and Product teams, required. 12+ years of related experience, preferred. Hightly proficient in SQL, with comfort working across modern data stacks (e.g., Snowflake, BigQuery, Domo, AWS, GCP). Strongly skilled in consolidating and interpreting data from multiple fragmented datasets from numerous systems. Strong understanding of digital and traditional marketing strategies, user acquisition funnels, engagement metrics, and customer lifetime value modeling. Experienced with traffic metrics, Google Analytics, HubSpot, Salesforce, and similar platforms. Skilled at communicating findings through brief bullet points and compelling visuals no fluff, just insight. Deep understanding of core SaaS performance metrics, including but not limited to CAC, LTV, ARR, churn, user adoption, and pricing strategy. Proven ability to think both creatively and critically while thriving in a fast paced, dynamic, and often ambiguous work environment. Scrappy, proactive, and results oriented, with a bias for clarity and action.Collaborative and team oriented, proactively supporting team members to achieve goals. Ability to travel less than 5% of the time. Must be 18 years of age or older. Must successfully complete pre employment screening process, as required. Must successfully complete any required training or orientation courses, as needed. What We Offer Life requires balance. So we provide benefits around health and wellness, continued education, and work/life balance to help you live your best life when you’re working…and when you’re not. Medical, dental, and vision plans, plus a wellness program with added incentives 401(k) savings plan with company match and employee stock purchase plan Continuing education benefits with tuition assistance programs Paid time off including holidays, vacation, sick, personal, and winter close Who We Are At Thryv, we’re a team fiercely devoted to the success of local businesses. We’ve been around for over 100 years, always with one goal in mind — helping small businesses compete, win and succeed. We provide the technology, software and local business automation tools small business owners need to better manage their time, communicate with clients, and get paid, so they can take control of their business and be more successful. We support businesses across the U.S. and we have team members all around the country (even internationally). In fact, we’re a work from anywhere company, because that’s how we get work done. Culture is vital at Thryv because it shapes our identity and, therefore, our measurements for growth. We have an identified set of values that hold all of us accountable paving the way for our company success and our legacy. All of this helps us deliver results for our clients and creates success for our employees. At Thryv, making a positive impact within our team and in our local community is the reason we get out of bed every morning. Thryv Core Values: · Client Devoted – Be humble with a servant mentality. Understand the uniqueness of each interaction while being flexible, knowledgeable, and genuine. · Under Promise, Over Deliver – Deliver expectations and exceed them, have accountability, listen and understand the ask. · Act Like You Own the Place – Taking ownership and accountability in your day to day decisions empowers you to act like you own the place. · Invest in our People – Hire people that are aligned with Thryv’s core values. Provide learning opportunities to enable all of us to adapt, belong, and create a lifelong career. · DONE3 – Define what you say (Done), Do what you say (Done), Follow up and ensure completion (Done). · Making $$ is a Byproduct of Helping People – Always be devoted to people, act with integrity. · Think Long Term, Act with Passion & Integrity – Focus on making every interaction exceptional. Bring enthusiasm and devotion to every act. This includes doing the right thing, even when no one is looking. Think five years out or think for the long play. Find out more at corporate.thryv.com/careers/ Belonging at Thryv We believe in a work environment where all individuals are treated fairly and respectfully, have equal access to opportunities and resources, and can contribute fully to the organization’s success. We want our employees to feel a part of something big and we encourage the sharing of ideas and collaboration across the organization. We strive to ensure our work environment reflects diversity, fairness and meritocracy. We believe all employees should have the opportunity to perform effectively in their position. We value every employee and the authenticity they bring to their role and to the organization. As a result, our employee policies and internal practices focus on ability and merit as the standards for success. Requisition Detail and Process This information indicates the general nature and level of work performed by employees in this job. It is not designed to contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. The duties and responsibilities in this job description may be subject to change at any time due to reasonable accommodation or other reasons. The final job level offered may vary based on the applicant’s competencies and qualifications such as experience and education, and other job related reasons. Our Commitment to Equal Opportunity Thryv is proud to provide equal employment opportunities to all employees and applicants, without regard to gender, color, race, religion, sexual orientation, national origin, citizenship, age, disability, veteran status, pregnancy, genetic information, or any characteristic protected by law. Thryv is committed to provide equal employment opportunities throughout the employment relationship including recruitment, hiring, discharge, compensation, benefits, discipline, development, and advancement or other aspects of employment. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4297905492/"
    },
    {
      "job_title": "Data Analyst | SkinnyRx (Remote)",
      "company": "SkinnyRx",
      "description": "About SkinnyRx SkinnyRx helps women and men address obesity through compounded GLP 1 medications and expert telehealth support. We’re a fast growing subscription e commerce company redefining how medical weight management works — combining science, personalization, and data. We’re now building the analytics foundation that powers our next phase of growth — and we need a data scientist who can turn our data into clarity, action, and measurable impact. We’re looking for a Data Scientist to design and own SkinnyRx’s reporting and analytics infrastructure across every part of the business — marketing, operations, fulfillment, and customer experience. You’ll build the systems and dashboards that help leadership and teams make faster, smarter decisions. This is a high impact role for someone who thrives in fast paced, data driven environments. What You’ll Do Build and maintain company wide dashboards for KPIs: acquisition, retention, LTV, churn, fulfillment, and satisfaction Develop and manage data pipelines and ETL processes to ensure clean, accurate data Partner with executives and functional leaders to define key business metrics and deliver actionable insights Conduct ad hoc and cohort analyses to identify trends, bottlenecks, and growth opportunities Unify data from marketing, CRM, fulfillment, and financial systems into a single source of truth Build automated reporting systems and documentation for ongoing scalability Who You Are 5+ years in Data Science, Analytics, or BI Proficient in SQL, Python, and data modeling (dbt or equivalent) Experienced with BI tools (Looker) Experienced with marketing analytics(Northbeam, GA) Experienced with product analytics tools (Amplitude, GA) Strong understanding of subscription e commerce metrics and customer lifecycle data Capable of translating data into simple, actionable recommendations Comfortable operating independently in a remote, fast moving environment Why Join SkinnyRx? Build the analytics foundation of a rapidly scaling healthtech brand Work directly with leadership — your work will drive key decisions Remote first team with a mission to make lasting weight management accessible Competitive pay, autonomy, and opportunity to shape the data culture from day one show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4312034418/"
    },
    {
      "job_title": "Quantitative Analyst | $200K/yr Remote",
      "company": "Crossing Hurdles",
      "description": "Crossing Hurdles is a referral partner. We connect & refer top candidates to our partners working with the world’s leading AI research labs to help build and train cutting edge AI models. Position: AI Quant Tutor (Full Time) Type: Full time Position Compensation: $90,000–$200,000/year Location: Remote Commitment: Full time Role Responsibilities (Training support will be provided) Use proprietary tools to label, annotate, and evaluate quantitative financial data and model outputs. Provide expert insights across quantitative finance topics such as algorithmic trading, derivatives, statistical arbitrage, and portfolio management. Collaborate with technical and financial research teams to refine annotation tools and data workflows. Review and critique AI generated financial analyses to ensure accuracy and conceptual soundness. Design and evaluate problems related to market strategy, risk assessment, and quantitative modeling. Work independently, applying analytical precision and professional judgment to complex financial topics. Requirements Master’s or PhD in Quantitative Finance, Financial Engineering, Financial Mathematics, Applied Mathematics, Statistics, or Economics with a quantitative focus. Proficiency in both formal and informal English communication. Strong applied research and analytical skills with comfort using data sources such as Bloomberg, Reuters, or academic finance databases. Excellent critical thinking, modeling, and problem solving ability. Demonstrated interest in AI, fintech, or data driven innovation in financial systems. Preferred Backgrounds Professional experience as a quantitative trader, researcher, or financial engineer. Published research in notable finance, economics, or data science journals. Familiarity with AI model training, data annotation, or related workflows. Expertise in Python, R, or MATLAB for quantitative analysis. Certifications such as FRM, CFA, CQF, or PRM. Application process: (Takes 20 min) Upload resume AI interview based on your resume (15 min) Submit form show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331648850/"
    },
    {
      "job_title": "Staff Product Analyst",
      "company": "Ethos",
      "description": "About Ethos Ethos was built to make it faster and easier to get life insurance for the next million families. Our approach blends industry expertise, technology, and the human touch to find you the right policy to protect your loved ones. We leverage deep technology and data science to streamline the life insurance process, making it more accessible and convenient. Using predictive analytics, we are able to transform a traditionally multi week process into a modern digital experience for our users that can take just minutes! We’ve issued billions in coverage each month and eliminated the traditional barriers, ushering the industry into the modern age. Our full stack technology platform is the backbone of family financial health. We make getting life insurance easier, faster and better for everyone. Our investors include General Catalyst, Sequoia Capital, Accel Partners, Google Ventures, SoftBank, and the investment vehicles of Jay Z, Kevin Durant, Robert Downey Jr and others. This year, we were named on CB Insights' Global Insurtech 50 list and BuiltIn's Top 100 Midsize Companies in San Francisco. We are scaling quickly and looking for passionate people to protect the next million families! About The Role We are looking for an ambitious self starter with a strong track record of delivering results. This role will put you in the middle of the action, requiring you to tackle complex challenges in a rapidly scaling startup. You will work cross functionally to generate product insights in our direct to consumer business. Through critical thinking and analytical rigor, you will understand user behavior and engagement, enabling us to innovate on our product. You will also provide visibility into performance drivers, empowering leaders to make data supported decisions. If you thrive in a fast paced, mission driven, and impact oriented environment, we encourage you to apply! Duties And Responsibilities Work closely with PMs to define feature goals and lead A/B testing and experimentation initiatives, including designing tests, tracking events and properties, and analyzing results to understand attribution, causation, and incremental lift Proactively generate exploratory analyses and in depth research on large data sets to help product teams uncover high impact opportunities Use your wizardly data querying and visualization skills to answer any question in a way that provides actionable insights Develop easy to consume dashboards and frameworks to monitor and visualize KPIs Influence strategic changes by presenting insights and recommendations to various organizational levels, including executives Collaborate with data engineers to maintain consistent business logic throughout the organization Foster a data driven, test and learn culture with your passion for storytelling through data and surfacing insights via analytics, experimentation, and research into the user journey and customer funnel Qualifications And Skills 7+ years of experience in data analysis, data science, and/or data driven product management Expert knowledge of SQL Expertise with data visualization tools to convey actionable insights to product managers and business leaders Experience in A/B testing and experimentation best practices Knowledge of basic statistical techniques; linear and logistic regression, confidence intervals Familiarity with a scripting language like Python or R Proven ability to work independently, multi task, and thrive in a fast paced environment The US national base salary range for this full time position is $133,000 $236,000. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job related skills, experience, and relevant education or training. Please note that the compensation details listed in US role postings reflect the base salary only and do not include applicable bonus, equity, or benefits. You can find further details of our US benefits at https://www.ethoslife.com/careers/ Don’t meet every single requirement? If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. At Ethos we are dedicated to building a diverse, inclusive and authentic workplace. We are an equal opportunity employer who values diversity and inclusion and look for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the SF Fair Chance Ordinance, we will consider employment for qualified applicants with arrests and conviction records. To learn more about what information we collect and how it may be used, please refer to our California Candidate Privacy Notice. US Resident Assisted Automated Decision Making Notice show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4265384662/"
    },
    {
      "job_title": "Performance Budgeting Analyst",
      "company": "Pareto.AI",
      "description": "PERFORMANCE BUDGETING ANALYST (OUTCOME BASED BUDGETING) Pareto is looking for experienced Performance Budgeting Analyst (Outcome Based Budgeting) professionals to collaborate with a leading AI lab on a transformative project in the Government & Social Services sector. The focus is on creating outcome based budgeting exercises that connect financial resources to measurable results, enabling transparent and effective reallocation decisions. KEY RESPONSIBILITIES Data Cleaning and Cost Allocation: Ensure data integrity and accurate distribution of costs across programs. Design KPIs: Collaborate with program owners to develop meaningful and measurable Key Performance Indicators. Scenario Modeling: Facilitate modeling sessions to explore budget reallocation options with department leads. Public Communication: Author clear, accessible narratives to communicate complex budgeting concepts to non technical audiences. Outcome Analysis: Deliver cost per outcome calculations and trend lines to inform decision making. IDEAL QUALIFICATIONS 5+ years of professional experience in Public Administration & Budgeting or a closely related field. English fluency with exceptional written communication skills—particularly in translating complex data into actionable policy choices. Strong technical proficiency in Python, Pandas, Git, and Metabase (preferred). Demonstrated ability to work collaboratively with cross functional teams and stakeholders. Certification in CGFM or IPMA CP/IPMA SCP preferred; PMP helpful for project heavy roles. PROJECT TIMELINE Calibration: Paid 1 hour assessment within first week of acceptance. Pilot phase: 1 week paid pilot to demonstrate capabilities. Extended engagement: Successful pilots lead to 2 month contracts with potential for extension or future AI Training projects. COMPENSATION & CONTRACT Hourly rate: $55 80/hr Employment type: At will contractor to Pareto Geographic flexibility: Remote work from anywhere; compensation adjusted by region while maintaining competitiveness Visa requirements: We cannot currently support H1 B or STEM OPT status candidates TIME COMMITMENT Calibration: Paid 1 hour trial within first week of acceptance. Pilot: 1 week paid pilot; successful completion leads to being invited to the official project, which will last approximately 2 months. Ongoing target: At least ~10–20 hours/week during pilot; 2 month contract in case of project success. Top performers during the 2 month official project will be invited to potential future AI Training projects. HOW TO APPLY For immediate consideration, please click the “Apply” button above and follow the instructions on the webpage. Applying requires signing up for Pareto’s AI Training software platform. Applications for this project are first come, first serve, so we recommend applying as soon as possible to increase your chances of joining. ABOUT PARETO Pareto is a San Francisco based company connecting elite professionals with cutting edge AI initiatives. We help top AI labs accelerate progress by integrating expert human knowledge across finance, policy, and analytics domains. Our work directly contributes to making AI systems more reliable, transparent, and impactful. Apply today and leverage your public budgeting expertise to help shape the future of AI driven government and social service innovation. We consider all qualified applicants without regard to legally protected characteristics and provide reasonable accommodations upon request. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331658946/"
    },
    {
      "job_title": "Senior Quantitative Analyst",
      "company": "Chainsage",
      "description": "Chainsage is fully remote, sub 20 person quantitative trading firm operating across major crypto venues with fast growing, $3bn+ monthly volume. We build proprietary, low latency market making and basis arbitrage systems from first principles. We are well funded, move quickly, value autonomy and have no hierarchy. We think a lot about what quantitative trading will look like in the AI age. You will: Design and build world class research infrastructure: data collection, model training, and parameter optimization pipelines from the ground up. Build and refine execution logic and risk models in Python/C++. Develop risk and portfolio management frameworks. Collaborate directly with engineers, code reaches production fast. We offer: Tight feedback loop between research and execution. Base + profit sharing + pre funding equity. Periodic in person research and development sprints. Visa sponsorship in various jurisdictions, including the US (H1B) and the UK/EU. Ideal background: 3–10 years in systematic trading (market making, stat arb, futures basis). Strong coding ability in Python/C++ and comfort with microsecond data. Interest in crypto microstructure and exchange quirks. Hard working with a self starter attitude. Located between GMT 4 to GMT+3. We are ideally seeking a senior researcher to lead quant efforts across the company, but will consider exceptional candidates at any level. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4307123921/"
    },
    {
      "job_title": "Senior Financial Analyst",
      "company": "Cypress HCM",
      "description": "Description: We are looking for a finance & strategy leader to support and evolve our Stays Supply Strategic Finance and Analytics team. This team is responsible for identifying and pursuing opportunities to grow high quality supply on our marketplace. The Sr. Principal will work in cross functional teams spanning revenue operations, field operations, data science, finance, advanced analytics, and product marketing to help evaluate and synthesize analytical insights, perform rigorous financial analysis, develop go to market strategies, and drive operational excellence. In particular, this individual will support the Supply team across 3 key pillars including: New Opportunities. Identify new growth opportunities that the company could pursue to increase company revenue and profitability Supply Insights. Evaluate proposed initiatives from across the company and determine their feasibility and potential. Perform rapid and accurate opportunity sizing with an eye towards driving short term growth. Serve as an internal consultant partnering with teams and executives. Advise business leaders and decision makers on risks, opportunities, and trade offs so they have the full picture Operational Excellence. Organize and track existing growth levers, measure their performance, and help hold teams accountable for driving improvements to revenue operations, product and marketing The Senior Principal is expected to be a strong cross functional business partner who has a combination of hands on analytical skills, financial modeling expertise, business savviness, and the ability to package their insights into strong narratives appropriate for senior executive consumption. The ideal candidate relishes the opportunity to roll up their sleeves to drive meaningful impact, possess strong stakeholder management skills, and is a self starter that is comfortable with ambiguity in a fast paced work environment. This person will have a high degree of visibility with senior management within the organization, including VP of Supply, Director of Revenue Operations, Product Marketing and Growth Marketing leadership, and Finance leadership. Duties: Develop insightful recommendations based on hands on analytics, financial modeling, and strategic analyses. Help bring together insights and data from across the company into a single, synthesized view that provides the company with clear, compelling recommendations that drive impact. Support development of business strategy and drive outcomes across our Host communities. Develop a deep understanding of what drives growth and efficiency for our business, and partner with the leadership team to translate insights into action Identify step change opportunities by partnering with key stakeholders to identify areas of outsized impact through quantitative analysis, industry benchmarks, and competitive research Create business cases for new initiatives with an investor mindset, and help leadership prioritize resourcing Partner with the business in driving operational rigor and performance management, including development and ongoing analysis of KPIs, dashboards, creating goals/OKRs, and holding the business accountable to those goals. Compensation: $78.87 – 85.14/hr W—2 Req ID: 36539185 show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317978259/"
    },
    {
      "job_title": "Lead Data Analyst, Sales Strategy &amp; Finance",
      "company": "Elastic",
      "description": "Elastic, the Search AI Company, enables everyone to find the answers they need in real time, using all their data, at scale — unleashing the potential of businesses and people. The Elastic Search AI Platform, used by more than 50% of the Fortune 500, brings together the precision of search and the intelligence of AI to enable everyone to accelerate the results that matter. By taking advantage of all structured and unstructured data — securing and protecting private information more effectively — Elastic’s complete, cloud based solutions for search, security, and observability help organizations deliver on the promise of AI. What Is The Role We’re looking for a Lead Data Analyst to join the Insights & Analytics team at Elastic. You’ll help shape how our global Revenue teams use data to make smart decisions, plan for growth, and stay focused on what matters. This role is a mix of strategy, hands on analysis, and cross team collaboration. You’ll work closely with Sales, Customer Success, Marketing, Finance, and more—bringing data to life and helping teams see the story behind the numbers. We work across a wide range of tools and datasets — from dashboards and forecasts to detailed analytical deep dives — helping the business stay focused, aligned, and data informed. To support our growth and enable us to scale efficiently, we are seeking an exceptional Lead Data Analyst to drive sales strategy, planning, reporting, and analysis efforts. In this position, you will play a strategic role in driving data informed decision making across Elastic’s Global Revenue Operations organization and broader go to market ecosystem. You will lead high impact analysis and develop scalable, executive level reporting to support sales effectiveness, pipeline optimization, and revenue growth. You’ll use your strong analytical skills to break down complex business problems and help teams make smarter decisions. Your insights will shape how we plan, operate, and improve over time. What You Will Be Doing Turning Data Into Decisions Build clean, scalable dashboards and tools using SQL (BigQuery), dbt, and Tableau Analyze complex data to answer key business questions—and turn insights into action Handle ad hoc asks in Google Sheets, while staying focused on big picture, long term impact Support senior leaders with clear, accurate reporting for exec and board level needs Question assumptions and get to the root of the problem, not just the request Validate your work thoroughly and explore data anomalies with curiosity Working Independently, While Staying Connected Take ownership of projects from start to finish—managing your own scope, priorities, and timelines Collaborate across time zones and teams (Sales, Field Ops, Data Engineering, and more) to ensure alignment and data consistency across data sources and reporting Spot data issues early and partner with the right folks to fix them at the source Help keep our reporting consistent and aligned across tools and teams Learning, Growing, and Making an Impact Build real world experience in Revenue Operations while learning how the business runs Lead high impact projects that shape go to market strategy Grow your skills in areas like predictive analytics, data architecture, and business planning Work directly with senior leaders and build strong relationships across the company Be part of a team where your ideas and work make a visible difference What You Bring 6+ years of experience in data analytics, BI, or a similar role—ideally in a high impact, fast paced environment Strong SQL skills (BigQuery preferred); experience with dbt is a plus Proficient with data visualization tools like Tableau or Power BI. Experience with predictive analytics is a plus. Experience working with Salesforce or similar sales data tools Comfortable working in Google Sheets to support quick turnaround requests Familiarity with B2B SaaS and a solid understanding of sales or post sales data Experienced in managing complex projects with clarity and focus —you know how to prioritize, follow through, and get unblocked when needed Clear, proactive communicator who can explain complex ideas simply and help others make informed decisions Bonus Points You’ll join a remote friendly, team that values curiosity, clarity, and action to deliver impact to the business. You’ll have room to grow, freedom to explore, and the support you need to do your best work—while learning how data helps shape every part of our business. Compensation for this role is in the form of base salary. This role does not have a variable compensation component. The typical starting salary range for new hires in this role is listed below. In select locations (including Seattle WA, Los Angeles CA, the San Francisco Bay Area CA, and the New York City Metro Area), an alternate range may apply as specified below. These ranges represent the lowest to highest salary we reasonably and in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the ranges may be modified in the future. An employee's position within the salary range will be based on several factors including, but not limited to, relevant education, qualifications, certifications, experience, skills, geographic location, performance, and business or organizational needs. Elastic believes that employees should have the opportunity to share in the value that we create together for our shareholders. Therefore, in addition to cash compensation, this role is currently eligible to participate in Elastic's stock program. Our total rewards package also includes a company matched 401k with dollar for dollar matching up to 6% of eligible earnings, along with a range of other benefits offered with a holistic emphasis on employee well being. The typical starting salary range for this role is: $106,900—$169,100 USD The typical starting salary range for this role in the select locations listed above is: $128,200—$202,700 USD Additional Information We Take Care Of Our People As a distributed company, diversity drives our identity. Whether you’re looking to launch a new career or grow an existing one, Elastic is the type of company where you can balance great work with great life. Your age is only a number. It doesn’t matter if you’re just out of college or your children are; we need you for what you can do. We strive to have parity of benefits across regions and while regulations differ from place to place, we believe taking care of our people is the right thing to do. Competitive pay based on the work you do here and not your previous salary Health coverage for you and your family in many locations Ability to craft your calendar with flexible locations and schedules for many roles Generous number of vacation days each year Increase your impact We match up to $2000 (or local currency equivalent) for financial donations and service Up to 40 hours each year to use toward volunteer projects you love Embracing parenthood with minimum of 16 weeks of parental leave Different people approach problems differently. We need that. Elastic is an equal opportunity employer and is committed to creating an inclusive culture that celebrates different perspectives, experiences, and backgrounds. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, pregnancy, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, disability status, or any other basis protected by federal, state or local law, ordinance or regulation. We welcome individuals with disabilities and strive to create an accessible and inclusive experience for all individuals. To request an accommodation during the application or the recruiting process, please email candidate_accessibility@elastic.co. We will reply to your request within 24 business hours of submission. Applicants have rights under Federal Employment Laws, view posters linked below: Family and Medical Leave Act (FMLA) Poster; Pay Transparency Nondiscrimination Provision Poster; Employee Polygraph Protection Act (EPPA) Poster and Know Your Rights (Poster) Elasticsearch develops and distributes encryption software and technology that is subject to U.S. export controls and licensing requirements for individuals who are located in or are nationals of the following sanctioned countries and regions: Belarus, Cuba, Iran, North Korea, Russia, Syria, the Crimea Region of Ukraine, the Donetsk People’s Republic (“DNR”), and the Luhansk People’s Republic (“LNR”). If you are located in or are a national of one of the listed countries or regions, an export license may be required as a condition of your employment in this role. Please note that national origin and/or nationality do not affect eligibility for employment with Elastic. Please see here for our Privacy Statement. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4258499431/"
    },
    {
      "job_title": "Senior Analyst, Technology Risk",
      "company": "Coinbase",
      "description": "Ready to be pushed beyond what you think you’re capable of? At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system. To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems. Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. While many roles at Coinbase are remote first, we are not remote only. In person participation is required throughout the year. Team and company wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported. Coinbase is looking for a creative and analytical Senior Analyst of Technology Risk. You will serve as a member of the Coinbase Technology Risk & Controls team and support the implementation and maturity of our technology and security risk management program. Your risk team will define, quantify, manage, and communicate risks, and use outcomes to inform business decisions. You will serve as the subject matter expert in technology risk management operations, and will make these applicable and usable for fast moving technical teams located across global time zones. What you’ll be doing (ie. job duties): Analysis of multiple variables, including but not limited to, threat intelligence and risks, to inform threat models/risk scoring methodologies. Enable risk informed business outcomes: Enable teams and leadership to make risk based decisions by clearly communicating quantitative and qualitative tradeoffs. Manage risks throughout the risk lifecycle: Intake, triage, analyze, and calculate (inherent/residual) risk in collaboration with subject matter experts and risk owners. Facilitate agreement and documentation of risk treatment decisions; pressure testing treatment decisions and validating execution of mitigation plans across stakeholders as required. Participate in continuous monitoring or risk treatment. Reporting on risk posture: Support synchronous and asynchronous reporting on findings, metrics, and recommend mitigations to business leadership. This includes ad hoc and scheduled meetings with leadership and business risk owners. Maintain source of truth risk register: Quality control of data, tooling support, and implementing automation/process improvements to establish a baseline and iteratively improve risk management data and tooling. Communications and training: Support develop, execution, and maintenance of communication and training plans to roll out the technology risk program across the organization. Maintain team runbooks, team intra web pages, and risk register metrics dashboards. Enterprise risk alignment: Work in lockstep with Enterprise Risk Management to escalate risks through the enterprise risk register and report relevant metrics to senior leadership as determined necessary. Global Engagement: Collaborate with stakeholders to help scale the program’s risk framework across Coinbase entities, products, and geographies/markets. Regularly collaborate with GRC teams, Legal and Compliance for risks, assessments, and reporting to meet regulatory requirements. Support audit and regulatory inspections: Support data compilation to respond to US and international audit/regulator inquiries. Maintain an industry pulse: Maintain awareness of international regulation, emerging threats, forecasts, policies, and benchmarks Execute risk assessments: Execute technical risk assessments across our production and corporate environments, enabling the team to communicate risk in both qualitative and quantitative terms. What we look for in you (ie. job requirements): 5+ years of experience working in a 1 or 2 LoD risk management function and/or Governance, Risk, and Compliance organization. Risk domain knowledge and best practices: Familiarity with standards and frameworks e.g. ISO 27001/5, NIST CSF, COBIT, ITIL, DORA, FAIR risk quant methodology to measure controls/risks, monitor controls/risks, and validating/racking/evidencing remediation. Technology risk domain knowledge: Ability to dig into technical risk solutions and to work on technical quantitative risk assessments across information technology domains such as asset management, resilience, systems development lifecycle, and infrastructure. Comfortable working with project management tooling (e.g. Jira, Archer) and quant and qualitative data analytics tooling. Clear/concise communicator and writer; experience drafting/operationalizing project plans across stakeholders, holding teams accountable, and documenting deliverables to varying levels of junior and senior stakeholder audiences. Ability to translate controls/risk standards out of compliance speak and into functional requirements and across varying levels of technical stakeholders. Regulatory familiarity: Working knowledge of major regulatory/legal frameworks (US/international) driving requirements across technology organizations. Navigating ambiguity and complexity: Ability to manage a queue against strategic priorities and shows expertise in being able to handle multiple assessments at a time. You are comfortable operating on an unpaved road and dealing with ambiguity. Drive for continuous learning: You are willing to learn and apply processes unique to the challenges at Coinbase. You have a willingness to embrace a steep learning curve and stretch opportunities to learn new skills. Excellent organization and project management skills in a fast moving and demanding environment Nice to haves: FinTech, TradFi, consulting, business operations technical program management or other customer facing disciplines. Strong knowledge of risk/control issues in relation to evolving technology (e.g., crypto, mobile, cloud, data lakes, machine learning). Certification is a plus, but not a requirement: information security risk management qualifications like CRISC, CISA, CISSP, CISM, and FAIR. Coding knowledge a plus, but not a requirement (e.g. learn to build data joins, integrations with GRC and data visualization tools) Demonstrated beginner/intermediate knowledge of crypto/blockchain/web3 Position ID: P69475 Pay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)). Pay Range: : $167,280 USD $196,800 USD Please be advised that each candidate may submit a maximum of four applications within any 30 day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying. Commitment to Equal Opportunity Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Know Your Rights notice here. Additionally, Coinbase participates in the E Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Global Data Privacy Notice for Job Candidates and Applicants Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4248344850/"
    },
    {
      "job_title": "Senior Tax Analyst",
      "company": "Temu",
      "description": "Responsibilities: Identifying U.S. state & local tax issues related to new business initiatives, as well as tax automation systems; Researching state and local income tax issues; Preparing detailed written tax guidance and requirements for the new projects; Manage the analysis and documentation of tax implications of new business issues; Research and analyze tax planning ideas to determine impacts for U.S. income tax reporting; Keep up to date on tax law and the organizational impact of changes; Train and mentor team members; Special projects as needed; Required skills: BS/BA degree in Accounting, Finance, Business, or equivalent experience; 3 or more years of U.S. tax experience with a public accounting firm and/or multinational corporation; CPA required; Advanced knowledge of tax accounting, audit process, and tax law; Experience with preparing complicated tax returns for corporate; Detail oriented, organized and able to deliver on tight timelines; Advanced knowledge of Microsoft Excel and Word; Be able to work with multicultural team and be patience and understanding; Be able to work with a fast paced start up. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4293532707/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4277413067/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4269032521/"
    },
    {
      "job_title": "Energy Product Analyst",
      "company": "MCG Energy Solutions, LLC",
      "description": "SUMMARY: This position is responsible for serving multiple constituents, both internally and externally, as experts within the energy industry and MCG’s product portfolio. An EPA – Customer Care's primary role is to work with Account Coordinators, Product Managers, Application Support staff, and customers to provide subject matter expertise in the areas of the energy industry and MCG’s products to facilitate customers achieving maximum benefit and satisfaction in their use of MCG’s products. ESSENTIAL DUTIES AND RESPONSIBILITIES: This role is ultimately responsible for the retention and happiness of each MCG client. Manage, maintain and work with MCG Account Coordinators to answer customer questions, assess Work Item criticality, identify and scope enhancements, and provide commercial support where a new product sale opportunity arises for an existing customer Along with the Account Coordinators, build and maintain strong, long lasting, personal relationships with users, managers, and executives at client companies. Consult with others and provides input to company software roadmap, including software assurance guarantees. Those others include: Market technical forums Industry conferences and exhibits Internal market monitoring team, product design team, technical staff, sales and marketing professionals and executive leadership team. Assist in the planning and execution of MCG User Community. Create and deliver content for the community, knowledge base or other company presentations as assigned. In all cases, behave ethically and legally with all peers, contacts, and clients. Perform other duties as delegated by the executive leadership team. QUALIFICATIONS: This individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, education, and/or ability required. Required Skills: Strong knowledge of wholesale energy markets, including asset products and asset types, power products, ancillary products, congestion products, and emissions products. Experience with assets (bids/offers), congestion products, and environmental markets in at least one North American power market. Knowledge of the other North American power markets (NYISO, ISNE, PJM, IESO, MISO, SWPP, ERCOT, CAISO, and AESO) and how their products relate to the products in your ISO of expertise. High level client facing and internal communication skills Professional phone skills and superior email habits Must be willing to represent the company in public forums and present a professional image in conduct and personal presentation Must be able to convey essential information clearly and concisely to clients, peers, and leadership, both in writing and verbally Superior meeting management and participation skills, including executive level interactions Strong personal organization and project management skills; proven ability to manage multiple projects at a time while maintaining strict attention to detail Demonstrated ability to communicate, present, and influence credibly and effectively at all levels of the organization, including C level executives Excellent listening and presentation skills Solid working knowledge of all products in the Microsoft Office suite. Experience with CRM software or other personal relationship management tools. Leadership Skills: The EPA – Customer Care must possess impeccable self direction and planning skills. The EPA – Customer Care carries the strong voice of the Client to MCG internal teams, but must be able to weigh all inputs in order to produce a consensus. At times, the EPA – Customer Care will be asked to direct others (Account Coordinators and App Support), either directly or through participation as a team leader, and must do so effectively and ethically. EXPERIENCE: 5+ years of proven hands on experience working as an energy trader or scheduler. SUPERVISORY RESPONSIBILITIES: This position will not supervise others in the department. PHYSICAL DEMAND: The physical demands are representative of those that must be met by an employee to successfully perform the essential functions of this job. The employee is required to sit, stand, walk, communicate with other employees, and work with computers. Specific vision abilities required by this job include close vision and the ability to adjust and focus. WORK ENVIRONMENT: This position will perform all work in a remote environment. Travel expected as required by the need to be on site with a Client. Up to 30%. OTHER DUTIES: Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316635553/"
    },
    {
      "job_title": "Business Analyst",
      "company": "Elios Talent",
      "description": "Business Analyst – Remote (US) 💼 Full Time | 💰 $130K–$160K | 🌎 Remote We’re looking for a Business Analyst who can bridge the gap between data and strategy — turning insights into action across product, market, and executive teams. This role sits at the intersection of analytics and storytelling, helping leadership make smart, informed decisions that drive growth. Highlights 📊 Partner with product & strategy teams to translate complex data into clear, actionable insights 🧠 Shape business cases, market expansions, and product direction through research & analysis 📝 Create high quality reports, dashboards, and white papers that influence decision making About Us We’re a fast growing, tech driven organization that’s transforming how the energy industry uses data. Our platform empowers clients to model, forecast, and strategize with accuracy and speed — helping them make smarter decisions in a rapidly evolving market. Why Join Us You’ll join a collaborative, forward thinking environment where ideas move fast and innovation leads the way. Expect visibility with senior leadership, meaningful work that drives strategy, and the opportunity to grow your career at the intersection of energy and technology. Qualifications Bachelor’s degree in Business, Economics, Engineering, Data Science, or related field 3–5 years of experience in business analysis, consulting, or strategy — ideally in energy or SaaS Strong analytical and written communication skills — able to turn data into clear business narratives Proficiency in Excel, SQL, Tableau, or PowerBI is preferred Familiarity with software product life cycles, user stories, and agile methodologies Bonus: experience with energy market data or published white papers show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318386212/"
    },
    {
      "job_title": "Sr. Director, Analyst, Enterprise Marketing Leadership and Strategy (Remote US)",
      "company": "Gartner",
      "description": "Senior Director Analyst, Marketing Leadership and Strategy Gartner is seeking an Analyst that will change how CMOs deliver business impact. About This Role: Gartner Analysts are thought leaders who deliver actionable, objective insight through must have research and advice that drives smarter decisions and stronger performance against the mission critical priorities of world leading organizations. A Senior Director serves as a leader within Gartner’s Research and Advisory business, establishing themselves as a credible voice within their designated market at local, regional, and global levels. Utilizing exceptional research and analytical skills, a Senior Director plays a significant role in producing pragmatic and provocative research which Gartner clients consume and apply to propel their business toward key objectives. They are a trusted source of advice for clients, reinforcing Gartner’s value every day by engaging clients via in person meetings, virtual meetings, sales support visits and Gartner conferences to discuss complex client challenges and offer appropriate recommendations. This role sits within Gartner’s Marketing & Communications practice and will address the needs of CMOs and their key leaders in transforming the marketing function for maximum business impact. As disruptive forces inside and outside the enterprise are resetting the expectations and objectives of CMOs, this role will focus on Marketing Leadership and Strategy. The leader in this role will guide CMOs in addressing challenges and seizing opportunities related to Marketing Strategy Development, Functional Leadership and Collaboration, and Marketing led Innovation and Transformation, as connected levers to harness disruptions to their advantage. Successful candidates will use a deep understanding of the CMO role and responsibilities and the unique challenges and opportunities facing marketing, particularly against a backdrop of volatility, uncertainty, complexity and ambiguity, to advise CMOs and marketing leaders on how to: Marketing Strategy Development Lead the development and delivery of marketing strategic plans that align marketing strategies, objectives, activities and resources to the enterprise vision, goals and strategic outcomes Prove and articulate the value of marketing to the enterprise to increase CxO understanding of marketing’s role, show its impact on enterprise priorities, and secure budget and resources Build and execute marketing strategies that are reflective of—and resilient to—market changes and deliver value, demonstrating CMO accountability for and marketing impact on business growth Functional Leadership and Collaboration Define the role of the CMO and the marketing function inside the enterprise, balancing an ability to identify and fulfill unmet customer needs with the capabilities to lead the marketing function Define and establish the role of marketing in cross functional initiatives, including fostering effective partnership and trust based relationships with other CxO, functions or departments Drive effective coordination and collaboration in and outside of marketing, identifying and taking action to avoid pitfalls that lead to dysfunctional collaboration or serve as obstacles to collaboration Marketing led Innovation and Transformation Define and establish marketing’s role in leading or contributing to the organization's innovation or transformation initiatives, including aligning resources and ensuring a sustainable approach Use marketing led innovation to fuel growth and long term business health by making marketing a forward looking insights engine for the enterprise Manage innovation projects, building marketing’s ability to identify relevant trends, evaluate their potential impact, and sense and respond to growth opportunities What You Will Do Deliver high quality, impactful advice to an executive client audience through a variety of media Create evidence based content, taking strong positions and delivering actionable recommendations Create and deliver presentations for webinars and other client facing Gartner events Deliver outstanding sales and service support to retain and grow the Gartner business Build credibility as an industry expert to represent Gartner research, methodology and strategy. Actively participate in innovation, ideation, and research discussions and collaborate effectively with peers in our research community Identify research process improvements or develop new processes that help the team and Research & Advisory provide excellent service delivery Serve as a mentor and a coach by supporting peers, colleagues and junior team members What You’ll Need Bachelor's degree or equivalent experience; Graduate degree preferred 12+ years of relevant marketing experience; CMO or equivalent experience preferred An informed understanding of the challenges facing CMOs as leaders within the enterprise and drivers of business impact Extensive experience leading a marketing team, department or function and/or advising CMOs or senior marketing executives Extensive experience leading development and execution of marketing strategies and aligning resources that drives enterprise growth Experience successfully building the business case for marketing strategies or plans, resources and budgets and demonstrating measurable results and marketing’s impact on business outcomes Experience as a leader in marketing led innovation and transformation efforts that impact people, process and technology Demonstrated ability to quickly establish credibility with executives and key stakeholders Strong organizational and time management skills; ability to work under tight deadlines, manage expectations, and produce high quality deliverables Demonstrate excellence in research and writing ability Strong written and verbal proficiency, analytical and presentation skills; ability to engage clients and respond effectively to questions Proficient in analyzing and synthesizing data; can effectively apply patterns and frameworks while drawing and defending conclusions to client challenges Strong communication skills to explain complex concepts concisely and simply Comfort presenting at large and small scale speaking engagements, online and in person Strong business and financial acumen Ability to work independently, while also being intrinsically motivated to collaborate across teams and support the workflow of others, in a multicultural global team Learning agile and adept with navigating highly matrixed environments Ability to represent Gartner's research methodology and strategies effectively at all levels Who are we? At Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world. Our mission relies on expert analysis and bold ideas to deliver actionable, objective insight, helping enterprise leaders and their teams succeed with their mission critical priorities. Since our founding in 1979, we’ve grown to more than 21,000 associates globally who support ~14,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here. What makes Gartner a great place to work? Our sustained success creates limitless opportunities for you to grow professionally and flourish personally. We have a vast, virtually untapped market potential ahead of us, providing you with an exciting trajectory long into the future. How far you go is driven by your passion and performance. We hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients. Our teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work. What do we offer? Gartner offers world class benefits, highly competitive compensation and disproportionate rewards for top performers. In our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring. Ready to grow your career with Gartner? Join us. Gartner believes in fair and equitable pay. A reasonable estimate of the base salary range for this role is 152,000 USD 190,000 USD. Please note that actual salaries may vary within the range, or be above or below the range, based on factors including, but not limited to, education, training, experience, professional achievement, business need, and location. In addition to base salary, employees will participate in either an annual bonus plan based on company and individual performance, or a role based, uncapped sales incentive plan. Our talent acquisition team will provide the specific opportunity on our bonus or incentive programs to eligible candidates. We also offer market leading benefit programs including generous PTO, a 401k match up to $7,200 per year, the opportunity to purchase company stock at a discount, and more. The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to seek to advance the principles of equal employment opportunity. Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964 0096 or by sending an email to ApplicantAccommodations@gartner.com. Job Requisition ID:99813 By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence. Gartner Applicant Privacy Link: https://jobs.gartner.com/applicant privacy policy For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser. show less",
      "date_posted": null,
      "location": "Stamford, CT",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4256386107/"
    },
    {
      "job_title": "Senior Data Analyst",
      "company": "Robert Half",
      "description": "Position: SENIOR CDP DATA ANALYST ENTERPRISE DIGITAL TEAM Location: REMOTE Salary:UP TO $120 140K BASE + BENEFITS *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume. My email can be found on my LinkedIn page. *** Join a newly launched Enterprise Digital team building cloud native, mobile first solutions from the ground up. Help design and enhance our Customer Data Platform (CDP) to deliver unified customer insights and drive data informed decisions. What You’ll Do: Define CDP data requirements and use cases. Design data models and integration logic for a 360° customer view. Analyze customer data across CRM, web, and transactional systems. Build dashboards and visualizations using Power BI or Tableau. Ensure data quality, governance, and compliance. What We’re Looking For: 5+ years in data analysis with customer data focus. Advanced SQL and Python skills. Experience with cloud data architectures (AWS, Azure, GCP). Strong data visualization skills (Power BI, Tableau). Familiarity with data governance and privacy regulations. Why Join: Ground floor opportunity in a fast growing digital team. Influence foundational technology decisions. *** For immediate and confidential consideration, please send a message to MEREDITH CARLE on LinkedIn or send an email to me with your resume. My email can be found on my LinkedIn page. Also, you may contact me by office: 515 303 4654 or mobile: 515 771 8142. Or one click apply on our Robert Half website. No third party inquiries please. Our client cannot provide sponsorship and cannot hire C2C. *** show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318870951/"
    },
    {
      "job_title": "eCommerce Solutions Analyst",
      "company": "Apex Systems",
      "description": "Apex Systems is currently hiring an eCommerce Solution Analyst (OMS Integration Focus) to join a growing retail client that is 100% remote Duration: 1 year contract (potential to extend and potential to convert to FTE in the future) Location: 100% Remote Pay range: $75 90/hr Are you a tech savvy problem solver who thrives in fast paced environments and loves connecting the dots between business needs and technical delivery? Our client is looking for a dynamic Solutions Analyst to join our global digital commerce team as they transition their sites to IBM Sterling Order Management System and integrate with Salesforce Commerce Cloud (SFCC). About the Project This isn’t just another OMS implementation. Our client is rolling out a global transition and you’ll be at the heart of this transformation, supporting gap analysis, solutioning, and documentation across multiple regions and platforms. What You’ll Do Partner with cross functional teams to drive technical solutioning and documentation Facilitate conversations between SMEs, developers, and product managers Capture and elevate technical decisions, edge cases, and evolving requirements Support testing efforts (SIT, UAT, E2E) and help connect the dots across systems and processes Be the glue that keeps technical conversations visible, documented, and actionable What You Bring 4+ years in eCommerce architecture, business analysis, or digital product management Proven experience integrating SFCC with IBM Sterling OMS or similar order management platforms. Experience with IBM Sterling OMS Experience with Salesforce Commerce Cloud Experience with Salesforce Marketing Cloud Strong communication chops—you can speak dev and business fluently A knack for documentation, problem solving, and seeing the bigger picture Comfort jumping into systems, running test cases, and supporting delivery teams Ability to translate complex business requirements into actionable technical solutions. High attention to detail, accountability, and a strong sense of ownership. Proficiency in Jira and Confluence B2C experience Prior experience working on an OMS implementation – is a plus! Why This Role Rocks You won’t just be writing specs—you’ll be shaping how global teams collaborate, test, and deliver. If you love being the technical voice in the room, connecting dots others miss, and making sure great ideas don’t get lost in the shuffle, this is your moment. Ready to dive in? Apply now or reach out directly to Emily Pentico at epentico@apexsystems.com Apex Benefits Overview: Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide. EEO Employer Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystems.com or 844 463 6178. Apex Systems is a world class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317107270/"
    },
    {
      "job_title": "Senior Data Analyst",
      "company": "Insight Global",
      "description": "Logistics: On site in New York City or Las Vegas preferred, open to remote candidates Perm, direct hire Open to senior level and manager level Required Skills & Experience • Advanced SQL skills for querying and integrating data from multiple sources • Strong Python experience (pandas, NumPy, PySpark; able to build models and automate analysis) • Advanced Excel skills • Experience building reports and dashboards from direct data sources (not just using canned reports) • Ability to work with both on prem servers and cloud/datalakehouse environments • Proven track record connecting siloed data across business units (Finance, Marketing, F&B, Hotel, Gaming) • Strong business acumen with ability to translate analysis into actionable recommendations • Experience with BI/visualization tools (Power BI, Tableau, Looker, Mode) • Prior work in gaming, hospitality, or regulated environments Nice to Have Skills & Experience • Prior work in gaming, hospitality, or regulated environments • Experience with predictive modeling, advanced forecasting, or machine learning • Experience mentoring junior analysts or contributing to documentation/legacy info Job Description Work closely with a cross functional analytics team to unify and analyze data from disparate systems, beginning with a focus on labor and F&B analytics while expanding coverage across all business units. Build and maintain dashboards, models, and reports using SQL, Python, and Excel. Integrate data from on prem and cloud sources, drive reporting for business decision making, and collaborate with stakeholders to scope problems and deliver actionable insights. Support change management, contribute to documentation, and help junior analysts as needed. Compensation: $90,000 $140,000 per year annual salary. Exact compensation may vary based on several factors, including skills, experience, and education. Benefit packages for this role may include healthcare insurance offerings and paid leave as provided by applicable law. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317138611/"
    },
    {
      "job_title": "Research Analyst",
      "company": "YipitData",
      "description": "About Us: YipitData is the leading market research and analytics firm for the disruptive economy and recently raised up to $475M from The Carlyle Group at a valuation over $1B. We analyze billions of alternative data points every day to provide accurate, detailed insights on ridesharing, e commerce marketplaces, payments and more. Our on demand insights team uses proprietary technology to identify, license, clean and analyze the data many of the world’s largest investment funds and corporations depend on. For three years and counting, we have been recognized as one of Inc’s Best Workplaces. We are a fast growing technology company backed by The Carlyle Group and Norwest Venture Partners. Our offices are located in NYC, Austin, Miami, Denver, Mountain View, Seattle, Hong Kong, Shanghai, Beijing, Guangzhou, and Singapore. We cultivate a people centric culture focused on mastery, ownership, and transparency. About The Role: We are expanding our research team by hiring a Research Analyst to drive the development of fundamental research for our high demand subscription based data products. This is an exciting opportunity for someone with 3+ years of experience who is eager to play a key role in shaping the data driven future of investment research. You may be an ideal fit if you have a background in buy side or sell side research, management consulting, or have used data to analyze business trends and develop solutions to customer challenges. Experience covering the consumer or consumer tech sectors is a plus. If you are passionate about leveraging data to drive actionable insights, we encourage you to apply! This is a remote friendly opportunity that can sit in NYC (where our headquarter is located), one of our office hubs (Austin, Miami, Denver, Mountain View, or Seattle), or anywhere else in the US. However, depending upon where the remote work is performed, income could be subject to New York State tax withholding. Please note that we pay NYC based salaries for US roles regardless of where employees choose to work. As A Research Analyst, Your Key Responsibilities Will Include: Data Driven Research: Create and communicate valuable insights from our datasets SQL driven Granular Analysis: Learn to derive trends from large datasets using advanced queries, building cohort, concentration, penetration, and competitive analyses New Product Development: Collaborate with our data team to help build new research products and features Customer Relationships: Become a trusted resource for our subscribers, the largest investors in the world Product Marketing: Work with our Sales, Client Strategy and Marketing teams to position our products on clients calls, webcasts, and in press references You Are Likely To Succeed If: You have 3+ years of experience in equity research or management consulting styled writing You have a background in equity research or business analysis and a passion for data driven fundamental investing You have a commitment to learning new technology skills and working at a company where everyone learns to code You have a Bachelor's degree or foreign equivalent in Finance, Economics, Statistics or a related field Meet Your Team: Check out this video to learn why our Research team members love being part of YipitData! What We Offer: Our compensation package includes comprehensive benefits, perks, a competitive salary, and equity: The annual base salary for this position is anticipated to be $150,000 + Bonus (targeted at 15% of salary) and Equity. The final offer may be determined by a number of factors, including, but not limited to, the applicant's experience, knowledge, skills, and abilities, as well as internal team benchmarks. This role may be performed fully remotely within the United States. Please note that our US headquarters are located in NYC. We also have office hubs in Austin, Miami, Denver, Mountain View, and Seattle. If the remote work is performed outside of these offices, income may be subject to New York State tax withholding. We care about your personal life and we mean it. We offer flexible work hours, flexible vacation, a generous 401K match, parental leave, team events, a wellness budget, learning reimbursement, and more! Your growth at YipitData is determined by the impact that you are making, not by tenure, unnecessary facetime, or office politics. Everyone at YipitData is empowered to learn, self improve, and master their skills in an environment focused on ownership, respect, and trust. Please note that for this position, we are not able to consider candidates who currently or in the future will require visa sponsorship. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity employer. Job Applicant Privacy Notice show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4241168920/"
    },
    {
      "job_title": "Financial & Equity Research Analyst (Part-Time | $90 –$150/hr)",
      "company": "Call For Referral",
      "description": "Investment Services Expert Hourly Contract | Part time Remote $80 –$150 per hour About the Role A leading AI research initiative is recruiting Investment Services Experts to collaborate on a frontier project that enhances large language models (LLMs) for real world financial reasoning. In this role, you’ll leverage your expertise across investment banking, private equity, asset management, or equity research to evaluate, design, and refine AI workflows that simulate complex financial analysis and decision making. Your work will help shape how next generation AI systems interpret markets, evaluate deals, and forecast business outcomes with human level accuracy. Key Responsibilities Evaluate AI generated investment analyses for accuracy, clarity, and strategic rigor. Calibrate AI decision making in areas like valuation modeling, portfolio analysis, financial forecasting, and risk assessment. Design and validate structured tasks that mirror real world workflows in investment services. Provide written and analytical feedback to improve model reasoning, depth, and realism. Collaborate asynchronously with AI researchers to ensure content quality and business alignment. Ideal Qualifications 2+ years of experience in investment services — including investment banking, private equity, asset management, or equity research. Bachelor’s degree in Finance, Economics, or Business Administration (Advanced degrees or CFA/CPA/CAIA certifications are a plus). Deep understanding of valuation, financial modeling, market analysis, and portfolio management. Strong quantitative and analytical reasoning skills. Exceptional communication and attention to detail — ability to distill complex concepts into actionable insights. Project Timeline Start Date: Immediate Duration: 1–2 months Commitment: ~20 hours/week (flexible, part time) Schedule: Fully remote and asynchronous — work at your own pace Compensation & Contract Rate: $90–$150 USD/hour (based on experience) Bonuses: Top performers earn weekly incentives of $20–$100/hr on top of base pay Contract Type: Independent contractor Payments: Daily via Stripe Connect Application & Onboarding Process Upload your resume or CV. Complete a short AI interview (no prep required). Participate in a paid, 3 hour work trial to assess your ability to interpret project guidelines and produce high quality investment related content. ⚡ PS: Mercor team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity. ⚡ show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317626035/"
    },
    {
      "job_title": "System Analyst",
      "company": "Brooksource",
      "description": "In this role you will be the comprehensive subject matter expert in the technology products/platform feature space and apply, learn, and extend your skills beyond formal role boundaries. Having a desire to help achieve transformational healthcare improvement should serve as the inspiration behind the ideal candidate’s willingness to participate across many different activities within an agile working model. Our leadership model is about developing great leaders at all levels and creating opportunities for our people to grow – personally, professionally, and financially. We are looking for leaders that are energized by creative and critical thinking, building and sustaining high performing teams, getting results the right way, and fostering continuous learning. Responsibilities: Drive operational excellence, including but not limited to Incident Management, process automation leveraging AI, and ensuring smooth deployments for your technology products/platform features. Provide analytical support and troubleshooting for application related issues. Work directly with the product stakeholders and/or technology product teams to understand the business domain. Recommend the most efficient and cost effective implementation, leveraging reusable features where possible Understand, document, and communicate upstream/downstream dependencies supporting assigned development areas Assist in creating, refining, and maintaining user stories and associated deliverables such as process flows and test cases to meet development and stakeholder needs. Write acceptance criteria and ensure criteria comes to fruition during product demos. Actively participate in agile ceremonies (i.e., daily standup, sprint planning, retrospective, and demos), representing the needs and perspectives of your assigned development areas Act as a proxy Product Manager/Scrum Master when necessary. Ability to serve as DevOps Analyst for more than one technology product line/platform feature team. Configure, develop (scripts, queries, reports), test, troubleshoot (system and application log interrogation), evaluate performance, and support (monitoring and impact remediation). Collaborate with development teams to integrate new features and improvements. Ensure security and compliance standards are met throughout the development and deployment process. Lead the team in regular system audits and implement necessary updates and patches. Minimum Qualifications: Requires a bachelor's degree or equivalent technical experience. Requires at least 7 years of directly related professional experience and deep technical abilities in one or more primary products, programs, or technologies. Excellent oral and written communication skills; ability to influence stakeholders and technical counterparts. Excellent problem solving and prioritization skills. Demonstrated experience in collaborating with development and operations teams to streamline the product delivery lifecycle. Experience documenting agile workflows and processes. Experience utilizing the Atlassian suite of products. Requires basic technical knowledge and experience including adherence to architectural design, development standards, security policies, and sustainable design practices. What’s in it for you? Get your foot in the door with one of the most respected and fastest growing companies in the United States! Brooksource offers competitive Health & Dental Benefit plans, Weekly Pay Checks while on contract, 6 paid Holidays, and 401K Eligibility. About Eight Eleven Group Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws. show less",
      "date_posted": null,
      "location": "California, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4323931215/"
    },
    {
      "job_title": "Senior Business Data Analyst",
      "company": "The Carrera Agency",
      "description": "Exciting Opportunity: Senior Business Data Analyst Join our dynamic Security Solutions team as a Business Intelligence (BI) Analyst/Developer and make an immediate impact! We're looking for a talented professional to spearhead the creation of a comprehensive KPI dashboard that will transform how our organization visualizes and utilizes data across multiple departments. This focused, short term engagement offers the perfect opportunity to showcase your expertise in data extraction, transformation, and visualization while delivering actionable insights that drive strategic decision making. Position Overview Approximate Duration: October 27 December 19, 2025 Location: Hybrid in San Diego, California OR Remote from United States Compensation: The expected compensation starts at $46.00/hr W2 plus benefits. The offered compensation to a successful candidate will be dependent on several factors that may include (but are not limited to) the type and length of experience within the industry, education, etc. Must Have Technical Skills Accurate and reliable data analysis API Automation BI Development; BI Platforms Experience with handling complex datasets and data transformations using platforms such as JMP, R, Python, etc. JAMA, Jama Connect JQL (Jira Query Language) Quality Metrics Security Metrics Tableau Nice To Have Cloud Data Architecture Data Modeling Key Responsibilities Design, develop, and deploy an innovative KPI dashboard using Tableau or comparable business intelligence tools (Power BI, Looker) Create and optimize SQL queries to extract, clean, and aggregate data from diverse internal systems and databases Leverage JQL (Jira Query Language) to seamlessly extract and integrate relevant project data Implement Python scripts and APIs to pull structured data from requirements management systems for comprehensive reporting Collaborate with cross functional leaders across Product, Quality, Security, and Operations to identify and define impactful key metrics Ensure exceptional data accuracy, consistency, and integrity across all data sources Deliver a scalable, maintainable dashboard featuring compelling visual storytelling for both executive and operational audiences Required Qualifications 3+ years of proven experience as a BI Analyst, Data Analyst, or BI Developer Expert proficiency in SQL, Tableau (or other BI platforms), JQL (Jira), and Python for data integration Demonstrated experience working with data from multiple systems and formats (relational databases, APIs, spreadsheets) Strong analytical mindset with exceptional attention to detail and proven ability to translate business requirements into effective technical solutions Outstanding communication and documentation skills Preferred Qualifications Experience with data modeling and ETL/ELT processes Familiarity with cloud data environments such as Snowflake, BigQuery, or AWS Redshift Background in reporting for product, security, or quality metrics is highly valued Apply today! show less",
      "date_posted": null,
      "location": "San Diego, CA",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4314514424/"
    },
    {
      "job_title": "Commercial Insights & Reporting Analyst",
      "company": "Arlo Technologies, Inc.",
      "description": "About Arlo At Arlo, we're passionate about creating innovative and reliable solutions that help people protect what matters most to them. Our team is dedicated to delivering products that exceed our customers' expectations, while always pushing the boundaries of what's possible in the world of protection technology. We believe that everyone deserves to feel safe and secure, whether they're at home or away, and we're committed to providing our customers with the peace of mind they need to live their lives without worry. Arlo’s deep expertise in AI and CV powered analytics, cloud services, user experience, product design, and innovative wireless and RF connectivity enables the delivery of a seamless, smart security experience for Arlo users that is easy to set up and interact with every day. About The Role We’re seeking a highly analytical and commercially driven Commercial Insights & Reporting Analyst to power decision making across our Sales, Product, and Marketing organizations. This is a high impact role focused on turning market, customer, and retail data into actionable insights that drive revenue growth, optimize promotions, and shape strategy. The ideal candidate brings both analytical depth and strategic thinking. You’ll not only report on what’s happening but help us understand why it’s happening and what we should do about it. Key Responsibilities Support Sales leadership with insight driven materials for key retailer meetings, including line reviews, promotional strategy sessions, and business reviews Analyze large, complex datasets from sources such as Stackline, Circana, Walmart Luminate or Retail Link, and POS data to identify business trends, risks, and growth opportunities Deliver clear, visual, and action oriented reporting and commentary to Sales, Marketing, and Product leaders to support short term decisions and long term planning Lead or co lead deep dive insight projects (e.g., promo ROI, pricing sensitivity, competitor mix shift, category trend diagnostics) with cross functional stakeholders Collaborate with Finance during planning cycles to build TAM models and market trend assumptions to inform roadmap, inventory, and revenue planning Forecast performance using historical trends, event multipliers, and competitive benchmarks Deliver quarterly commercial insights briefings to cross functional stakeholders, summarizing key shifts, threats, and opportunity areas Monitor key business metrics and dashboards, and proactively flag anomalies or outliers that require deeper analysis Partner with Sales Operations to enhance reporting infrastructure and automate core insights delivery Required Qualifications BA/BS in Business, Economics, Data Analytics, or a related field 3–6 years of experience working with market and POS data in consumer goods, retail, or ecommerce Strong proficiency in Excel/Google Sheets, including dynamic dashboards, pivot tables, and modeling Hands on experience with tools and platforms including Stackline, Circana, and Walmart data portals (Luminate or Retail Link) Experience with Tableau for building visual dashboards and executive ready charts Strong communication skills with the ability to synthesize complex data into clear, compelling stories Attention to detail and excellent data management hygiene Collaborative mindset with comfort working across Sales, Finance, and Product teams Preferred Qualifications Experience with SQL or willingness to learn basic querying Familiarity with Amazon Brand Analytics or other ecommerce insights platforms Prior work supporting account teams with retailer facing insights or promotional planning Background in product lifecycle support, pricing strategy, or sales forecasting Success in This Role Looks Like Strategic decisions are informed by timely, actionable insights—not just reports Your recommendations shape promotional strategies, product roadmaps, and retailer negotiations Cross functional teams rely on your work to spot risks, uncover opportunities, and validate key assumptions You are a trusted voice in business planning conversations, forecasting cycles, and go to market strategy sessions The pay range for this position reflects the minimum and maximum target for new hire salaries at commencement of employment and is expected to be between USD$130,000 150,000/year. However, base pay offered may vary depending on multiple factors, including role, job related knowledge, skills, relevant education and experience. We’re committed to inclusivity and selecting the strongest candidate—no matter their background. Even if you don’t meet every listed qualification, we encourage you to apply. We’re happy to support growth in areas essential to the role. Interested in learning more about our workplace? Visit and follow our LinkedIn, and Glassdoor pages to read employee insights and get updates of what it’s like to be part of Arlo. Arlo is proud to be an Equal Opportunity Employer. We value inclusion and are committed to inclusive, and harassment free workplace. We prohibit discrimination and harassment based on all legally protected statuses in all hiring and employment. We provide reasonable accommodations to applicants and employees with disabilities, who are pregnant or have a related medical condition, or who have sincerely held religious beliefs, observances, and practices. Pursuant to applicable state and municipal Fair Chance Laws and Ordinances, the Company will consider for employment qualified applicants with arrest and conviction records. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4266480519/"
    },
    {
      "job_title": "Credit Strategy Analyst - Home Secured",
      "company": "Best Egg",
      "description": "Best Egg is a market leading, tech enabled financial platform helping people build financial confidence through a variety of installment lending solutions and financial health tools. We aim to help customers make smart financial decisions and stay on track, so they can be money confident no matter what life throws at them. We offer a flexible work experience, top tier benefits, and growth opportunities in a culture built on our core values: Put People First – We foster an inclusive, flexible, and fun workplace. Create Clarity – Open communication drives trust and results. Get Things Done – We focus, prioritize, and deliver with excellence. Deliver with Heart – We lead with kindness, humility, and strong teamwork. Listen to Our Customers – Their needs drive our innovation. We are looking for collaborative, innovative team players who like to solve problems. If you're inspired by inspiring others and want to make a real difference, Best Egg is the place for you. We’re proud to be an equal opportunity employer committed to building a diverse, inclusive team. We are seeking an experienced Credit Strategy Analyst to drive the growth of our home secured personal loan portfolio. This role focuses on Underwriting, Pricing, Loan amount & Fee decisions across all acquisition channels, driving strategy improvement, innovation and investor returns. The ideal candidate will bring expertise in lending, applying credit models, and data driven decision making to help us expand our market share while maintaining robust risk controls. This is a full time, permanent position with competitive benefits and upward mobility. If you call yourself a self starter who can work in any environment and enjoy every day bringing unique challenges and opportunities, then you will thrive in this role. Duties & Responsibilities This individual will be responsible for monitoring, refining, and developing Credit strategies (including underwriting, pricing, loan amount & fees) for home secured personal loans Create test/control champion/challenger tests and monitoring to inform future strategies Provide scenario analysis/create financial impact sizing/develop new strategy test case Perform ad hoc analytics, create reporting and presentations Work across functional areas to drive overall growth, product enhancements, and improve web funnel conversion rates across all channels. Partner with Decision Science to define and develop Credit models and tools Maintain overall risk and return targets for investors, particularly in a changing economic environment Requirements Development 5 7+ years’ experience in a similar analytical role Bachelor’s Degree in Statistics, Mathematics, Operational Research, Engineering, other quantitative major required; Master’s degree a plus Experience in the financial industry, credit risk and mortgage/home equity experience required Must be proficient in Python or similar, SQL, and MS Excel Must be proficient in interpreting data using analytics, research methodologies, and statistical techniques Previous experience with Business Intelligence reporting (e.g. Tableau, PowerBI, etc) is desirable Excellent English written/verbal communication skills, critical thinking and interpersonal skills Highly independent and self motivated to form opinions that are supported by data. Strong knowledge of modeling tools and techniques and use in strategy Ability to understand competitive pressure, economic trends and their business impacts. High Energy with ability to work in a fast paced environment Requirements Leadership Comfortable interacting and engaging with colleagues from all levels of management across all business units and third party vendors Demonstrated technical leadership skills including self direction, coaching, and mentoring Highly motivated, well organized, capable of developing and executing business analysis, and able to communicate status and results effectively Requirements Culture Ability to succeed within a cross functional team emphasizing Collective Ownership in a fast paced environment Ability to work effectively both independently and as a team member Be confident and willing to challenge status quo, but also willing to concede and execute other’s ideas when necessary Capable of teaching and learning from others to promote continuity of knowledge and personal development Cultivate good working relationships with other business units, particularly Marketing, Operations, and Finance $130,000 $160,000 a year In addition to semi monthly salary payments, this position is also eligible for an annual incentive bonus based on individual and company performance. The yearly incentive bonus target is 20%. Employee Benefits Best Egg offers many additional benefits for our employees, including (but not limited to): Pre tax and post tax retirement savings plans with a competitive company matching program Generous paid time off plans including vacation, personal/sick time, paid short term and long term disability leaves, paid parental leave, and paid company holidays Multiple health care plans to choose from, including dental and vision options Flexible Spending Plans for Health Care, Dependent Care, and Health Reimbursement Accounts Company paid benefits such as life insurance, wellness platforms, employee assistance programs, and Health Advocate programs Other great discounted benefits include identity theft protection, pet insurance, fitness center reimbursements, and many more! In compliance with the CCPA, Best Egg is fully committed to handling the personal information and data of employees and job applications responsibly with respect and due care. Review our CCPA Employee Policy here We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4261726519/"
    },
    {
      "job_title": "Senior Eligibility Systems Analyst",
      "company": "Pareto.AI",
      "description": "Pareto is looking for experienced Grants Data Scientist professionals to collaborate with a leading AI lab on a groundbreaking project. The focus is on creating high fidelity computer use exercises that capture real Government & Social Services workflows—complete with starting context, step by step actions, decision points, and final deliverables. KEY RESPONSIBILITIES Data Modeling: Design data models for awards, subawards, drawdowns, and performance metrics; maintain data quality rules. Pipeline Development: Write Python/SQL to integrate external APIs and document pipelines and tests. Compliance Collaboration: Work with compliance and finance teams to translate regulations into machine checkable rules. Data Storytelling: Produce clear data stories and training artifacts for exercise creation. Anomaly Detection: Create automated checks for allowability and timing issues to reduce manual review time by 40%. IDEAL QUALIFICATIONS 5+ years of professional experience in Government & Social Services or a closely related field. English fluency (native or near native proficiency required). Strong technical aptitude with demonstrated skills in SQL, scripting, and data analysis. Exceptional written communication—ability to transform implicit expertise into explicit, reproducible instructions. Proficiency with tools such as Python (pandas), PostgreSQL, Metabase, and USAspending API. PROJECT TIMELINE Calibration: Paid 1 hour assessment within first week of acceptance. Pilot phase: 1 week paid pilot to demonstrate capabilities. Extended engagement: Successful pilots lead to 2 month contracts with potential for extension or future AI Training projects. COMPENSATION & CONTRACT Hourly rate: $55 80/hr Employment type: At will contractor to Pareto Geographic flexibility: Remote work from anywhere; compensation adjusted by region while maintaining competitiveness Visa requirements: We cannot currently support H1 B or STEM OPT status candidates TIME COMMITMENT Calibration: Paid 1 hour trial within first week of acceptance. Pilot: 1 week paid pilot; successful completion leads to being invited to the official project, which will last approximately 2 months. Ongoing target: At least ~10–20 hours/week during pilot; 2 month contract in case of project success. Top performers during the 2 month official project will be invited to potential future AI Training projects. HOW TO APPLY For immediate consideration, please click the “Apply” button above and follow the instructions on the webpage. Applying requires signing up for Pareto’s AI Training software platform. Applications for this project are first come, first serve, so we recommend applying as soon as possible to increase your chances of joining. ABOUT PARETO Pareto is a San Francisco based company connecting elite professionals with cutting edge AI initiatives. We help top AI labs accelerate progress by integrating expert human knowledge across finance, policy, and analytics domains. Our work directly contributes to making AI systems more reliable, transparent, and impactful. Apply today and leverage your Government & Social Services expertise to help build the future of AI driven grants and compliance analytics. We consider all qualified applicants without regard to legally protected characteristics and provide reasonable accommodations upon request. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331685082/"
    },
    {
      "job_title": "Senior Systems Analyst, Enterprise Performance Management (EPM)",
      "company": "Crown Castle",
      "description": "Position Title: Senior Systems Analyst, Enterprise Performance Management (EPM) (P4) Company Summary Crown Castle is the nation’s largest provider of shared communications infrastructure: towers, small cells and fiber. It all works together to meet unprecedented demand—connecting people and communities and transforming the way we do business. Whenever you make a call, track a workout or stream music and videos, we’re the ones providing the communications infrastructure that makes it all possible. From 5G and the internet of things to drones, autonomous vehicles and AR/VR, we enable the technologies that help people stay safe, connected and ready for the future. Crown Castle is publicly traded on the New York Stock Exchange (CCI), is part of the S&P 500 and is one of the largest Real Estate Investment Trusts in the US. We offer a total benefits package and professional growth development for teammates in any stage of their career. Along with caring for our teammates, we’re an active member in the communities where we live, work and do business. We have a responsibility to give back, which we do through our Connected by Good program. Giving back allows us to improve public spaces where people connect, promote public safety and advance access to education and technology Role As Senior Analyst, you join a team responsible for managing and supporting the Enterprise Performance Management (EPM) technologies that will deliver leading finance practices and modern consolidation, account reconciliation, and data management capabilities to achieve digital and business goals. As an EPM leader, you will partner with digital and business leaders to drive value throughout the organization by optimizing our financial processes, enhancing decision making capabilities, and driving our business's financial success. Responsibilities EPM Solution Implementation: Lead the design, configuration, and implementation of EPM solutions to meet the organization's financial reporting and analysis needs. Participate in vendor analysis and selection. Financial Transformation: Collaborate with cross functional teams to identify opportunities for financial process improvement and transformation initiatives. Requirements Gathering: Work closely with business stakeholders to understand their financial reporting requirements and translate them into EPM system specifications. Data Integration: Manage data integration efforts to ensure seamless data flow between EPM systems and other financial applications and databases. Training and Documentation: Develop training materials and provide training sessions to end users to ensure efficient utilization of EPM tools. Financial Modeling: Build and maintain financial models for forecasting, budgeting, and scenario analysis. Quality Assurance: Conduct thorough testing and quality assurance to ensure the accuracy and reliability of EPM reports and data. Troubleshooting: Investigate and resolve technical issues, system errors, and user inquiries related to EPM systems. Best Practices: Stay current with industry best practices and emerging trends in EPM and financial analytics to provide recommendations for continuous improvement. Project Management: Provide accurate estimates of effort, help manage project timelines, budgets, and resources to ensure successful EPM system implementations. Communicates updates and escalates issues which may affect project success. Documentation: Maintain comprehensive documentation of EPM system configurations, processes, integrations, and workflows. Application Ownership: Continuously monitor and optimize EPM systems to enhance performance, usability, and reliability Continuous Improvement: Manage the ongoing vendor releases and work closely with business partners to ensure timely testing, issue resolution and release to the production environment Expectations Ability to effectively articulate technical challenges and solutions to technical teams and business users across multiple levels of the organization Work as part of a team of problem solvers, helping to solve complex business challenges from strategy to execution Disrupt, continuously improve, scale efficiencies, and evolve ways of working Demonstrate a strong sense of ownership, urgency, and drive as well as the ability to promote and encourage others to value difference when working in diverse teams Education/Certifications BS Degree in Engineering, Computer Science, Finance, Accounting, or other related technical discipline Certification in relevant technologies and EPM systems is a plus Certifications in relevant Finance & Accounting disciplines is a plus Experience/Minimum Requirements 8+ years’ experience leading implementations for Enterprise Performance Management (EPM) systems 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systems Functional domain knowledge in Finance: operating models and supporting organization structures, reporting, analysis, and process best practices EPM software experience such as Oracle Cloud EPM, Oracle Hyperion, SAP BPC, Anaplan, or similar platforms. Knowledge of data extraction/integration tools such as Oracle Integration Cloud, BICC, Visual Builder, Informatica Intelligent Data Management Cloud, SAP Integration Services or AWS Glue Solid scripting knowledge for writing consolidations, translation logic, business rules, data management, and EPM automation Development experience in building metadata, business rules, data reconciliation and others Exceptional analytical and problem solving skills. Excellent communication and collaboration abilities. Project management experience and familiarity with Agile methodologies. Working Conditions: This is a remote role with the expectation of on site/in person collaboration with teammates and stakeholders for moments that matter and may require up to 20% travel. The hiring range offered for this position is $106,400 146,200 annually. A candidate’s offer is determined by various factors including but not limited to, depth of experience, role related knowledge and skills, relevant education or training, internal alignment, and work location. Depending on the position offered, the compensation package may also include incentive compensation opportunities in the form of a discretionary annual cash bonus or commissions, and equity incentives. Employees (and their families) are eligible for medical, dental, vision, and basic life insurance. Employees are able to enroll in our company’s 401k plan. Employees will also receive a minimum of 18 days of paid time off each year and 12 paid holidays throughout the calendar year. If you are interested in joining our team, please visit the Crown Castle careers site (crowncastle.com/careers) to apply. We do not accept resumes from agencies, headhunters, or other third party suppliers who have not signed a formal agreement with us. This position will remain posted until filled. show less",
      "date_posted": null,
      "location": "Phoenix, AZ",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4248547220/"
    },
    {
      "job_title": "Data Analyst",
      "company": "Platform Science",
      "description": "Who We Are At Platform Science, we’re working to connect everything that moves. Founded in 2015, we are an open IoT platform that partners with innovative fleets, application developers, vehicle manufacturers, and equipment providers in the transportation industry to deliver revolutionary solutions to supply chain professionals across the globe. Our employees are an engaging, diverse group of people who believe in the power of great ideas. We hire people with different experiences and perspectives to build a company culture that fuels growth through innovation. We value thoughtful actions and empathy for others. We approach challenges with resiliency and creativity, while encouraging transparency because, no matter our backgrounds or responsibilities, we are one team. About The Role The Data Analyst is responsible for processing large amounts of raw information into strategic insights for consumption by our Product, Engineering, and Leadership teams. As a Data Analyst, this role will be the face of the Data Team to other parts of the company. This role is highly analytical, utilizes strong SQL skills, and is proficient at creating and presenting visualizations. This role is a company wide advocate and resource for data informed decision making. They will help to mentor and grow the data team both in terms of technical skills and process improvements. Essential Responsibilities Leverage our modern data stack (dbt, Snowflake, Looker) in order to identify, analyze, and interpret trends or patterns in complex data sets to enable business critical decisions Work closely with our product and engineering teams to define, build, and analyze meaningful KPIs for our applications and systems Apply your expertise in quantitative analysis, data visualization and data mining to create data alerts and derive actionable insights Filter, clean, and transform data from a variety of sources in order to enable analysis Work with management to prioritize business and information needs Locate and define new process improvement opportunities Education And Experience 3+ years of experience as a Data Analyst 2+ years of experience with reporting and visualization tools such as Looker, Tableau, Domo, etc Advanced SQL skills including multiple table joins, unions, sub queries, CTE, aggregations, temporary tables, and analytical functions Technical expertise regarding all things data, including: mining, modeling, transforming, cleansing, and validating Ability to take vague requests and transform them into concise deliverables Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy Excellent communication skills, both verbal and written BS in Mathematics, Economics, Computer Science, Information Management, Statistics or equivalent experience Great to have: Intermediate to advanced knowledge of Python Expertise with Looker Experience with Data Build Tool (dbt) Experience with embedded analytics solutions Advanced knowledge of statistics and experience using statistical packages for analyzing datasets (Python, numpy, pandas, R, Excel, etc.) Platform Science Benefits Highlights The company offers various benefits to regular, full time employees including: Medical, dental, and vision insurance Short term and long term disability insurances AD&D and life insurance 401k plan Paid vacation, sick leave and holidays Six weeks of paid parental leave For more information please see the Benefits Highlights brochure for regular, full time employees. This is an exempt role. Our job titles for each posting may span across more than one job level. The estimated base salary for this role is between $82,500 and $149,731. The range displayed on each job posting reflects the minimum and maximum target range for new hire base salaries across all US locations. Compensation packages are based on many factors unique to each candidate, including but not limited to skill set, work experience, relevant trainings and certifications, business needs, market demands and specific geographical location. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, and benefits. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Platform Science collects your personal information to support its business operations, including for human resources, employment, benefits administration, health and safety, and other business related purposes as well as to be in legal compliance. You can review further details of such collection and use in our Privacy Policy (link for browser: https://www.platformscience.com/privacy notice Qualified applications with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. At this time we only consider candidates in these states: AL, AR, AZ, CA, CO, FL, GA, ID, IL, KY, MA, MD, MI, MN, MO, NC, NH, NV, NY, OH, OK, OR, PA, SC, TN, TX, UT, VA, WA, and WI. In the future we plan to add more states. Beware job scams! Our recruiters use @platformscience.com emails only. We don’t interview via text/message. We don't ask for software downloads (except Zoom) or sensitive info (like SSN/bank). Suspect fraud? Report it to law enforcement & peopleops@platformscience.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4252409848/"
    },
    {
      "job_title": "Senior Business Analyst",
      "company": "Adaptive Solutions Group",
      "description": "Senior Business Analyst Who We Are Position Overview The Senior Business Analyst will be critical in ensuring that our insurance solutions are delivered seamlessly to our customers. You will work closely with the delivery team, product managers, and clients to gather and analyze requirements, optimize delivery processes, and enhance customer satisfaction. Your insights and recommendations will directly contribute to the successful deployment and adoption of our solutions. Key Responsibilities Customer Requirements Analysis: Collaborate with clients and internal stakeholders to gather and document detailed customer requirements and expectations. Translate these requirements into actionable specifications for the delivery team. Data Analysis: Analyze customer data from core systems such as policy administration, compensation and agent management systems. Support the delivery team in their effort to integrate these core systems Solution Delivery Support: Work with the delivery team to ensure that solutions are implemented according to customer requirements and within agreed timelines. Monitor progress and address any issues or deviations promptly. Issue Resolution: Act as a point of contact for resolving any issues or challenges that arise during the delivery process. Work with cross functional teams to find and implement solutions promptly. Customer Requirements Analysis: Collaborate with clients and internal stakeholders to gather and document detailed customer requirements and expectations. Translate these requirements into actionable specifications for the delivery team. Stakeholder Communication: Maintain clear and effective communication with clients and internal teams throughout the delivery process. Ensure that all stakeholders are informed and aligned on project status, changes, and updates. Quality Assurance: Collaborate with the quality assurance team to develop and execute test plans, ensuring that delivered solutions meet customer requirements and quality standards. Customer Training & Support: Assist in creating and delivering training materials and documentation for customers. Provide support to clients during the implementation phase and address any questions or concerns. Qualifications Bachelor’s degree in Business Administration, Information Technology, or a related field. Relevant certifications (e.g., CBAP, PMI PBA) are a plus. Proven experience as a Business Analyst, with a focus on customer delivery or client facing roles. Experience in the life & annuity industry is a must. Proficiency in data analysis tools and software: SQL and Excel is a must. Experience with project management methodologies and tools (e.g., Agile, Scrum) is preferred. Strong analytical skills and the ability to translate customer needs into actionable requirements and solutions. Excellent communication and interpersonal skills, with the ability to interact effectively with clients and internal teams. Strong problem solving skills and the ability to manage multiple priorities in a fast paced startup environment. A customer centric mindset with a passion for delivering exceptional service and solutions. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4311716548/"
    },
    {
      "job_title": "Senior Business Analyst – Conga CPQ",
      "company": "Labcorp",
      "description": "Labcorp is seeking a functional analyst with strong Conga CPQ and ERP Billing process knowledge to join our IT team. This role will be responsible for supporting and enhancing our Conga CPQ and ERP systems, working closely with business stakeholders to gather requirements, design solutions, and ensure successful delivery of projects and enhancements. The ideal candidate will have strong analytical skills, a deep understanding of the quoting, pricing and billing processes, and hands on experience with Conga CPQ and any one of Oracle / PeopleSoft / SAP ERP. This hybrid position offers a balanced schedule of a minimum of three in office days at an assigned location to be in Durham, NC, supporting both collaboration and flexibility. Key Responsibilities Serve as the subject matter expert for Conga CPQ functionality and configuration. Serve as the subject matter expert for ERP Contracts, Billing and Receivables functionality. Collaborate with proposal management and finance teams to gather, analyze, and document business requirements related to quoting, pricing, contracting and billing. Write detailed functional specifications against business requirements. Support day to day operations, including user support and troubleshooting. Perform system testing, validation, and UAT coordination for new features, enhancements, and integrations. Work with technical teams to implement technical customizations to Conga CPQ and ERP. Requirements Bachelor’s degree in Engineering, Computer Science, Business, or a related field. 6+ years of experience working with Conga CPQ or similar CPQ systems. Solid understanding of Conga CPQ and its integration with ERP Contract to Cash modules. Experience with configuration of product catalog, pricing rules, quote templates, and approval workflows in Conga CPQ. Understanding of ERP Contracts, Billing and Receivable functionality. Strong analytical, problem solving, and documentation skills. Excellent communication skills and ability to collaborate with cross functional teams. Self driven team player who can work in a collaborative and supportive manner. Preferred Experience in in Clinical Testing or Research industry. Conga CPQ certification(s). Oracle ERP certification(s). Familiarity with Agile methodologies and tools like Jira, Confluence, etc. Application Window closes 10/31/2025 Pay Range: $110,000 $150,000 annually All job offers will be based on a candidate’s skills and prior relevant experience, applicable degrees/certifications, as well as internal equity and market data. Benefits: Employees regularly scheduled to work 20 or more hours per week are eligible for comprehensive benefits including: Medical, Dental, Vision, Life, STD/LTD, 401(k), Paid Time Off (PTO) or Flexible Time Off (FTO), Tuition Reimbursement and Employee Stock Purchase Plan. Casual, PRN & Part Time employees regularly scheduled to work less than 20 hours are eligible to participate in the 401(k) Plan only. For more detailed information, please click here. Labcorp Is Proud To Be An Equal Opportunity Employer Labcorp strives for inclusion and belonging in the workforce and does not tolerate harassment or discrimination of any kind. We make employment decisions based on the needs of our business and the qualifications and merit of the individual. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), family or parental status, marital, civil union or domestic partnership status, sexual orientation, gender identity, gender expression, personal appearance, age, veteran status, disability, genetic information, or any other legally protected characteristic. Additionally, all qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable law. We encourage all to apply If you are an individual with a disability who needs assistance using our online tools to search and apply for jobs, or needs an accommodation, please visit our accessibility site or contact us at Labcorp Accessibility. For more information about how we collect and store your personal data, please see our Privacy Statement. show less",
      "date_posted": null,
      "location": "North Carolina, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4264831884/"
    },
    {
      "job_title": "Senior Analyst",
      "company": "Cypress HCM",
      "description": "Duties: Conduct historical data analysis to provide actionable insights that inform strategic decisions related to supply growth and program design. Conduct quantitative analyses (such as ROI analysis and scenario planning) to identify and size opportunities for business impact, creating investment cases for new initiatives/product features to support leadership in prioritizing resources effectively. Create comprehensive forecasting models on business impact and budget. Build financial reporting cadence, monitor key metrics, and generate regular reports to key stakeholders. Collaborate with cross functional teams, including Business and Operations, Advanced Analytics, Data Science, and Product to align strategies. Ad hoc support for cross functional initiatives for Host Services. Requirements: 3+ years of industry experience with a Bachelor’s degree in a quantitative field (e.g., finance, economics, statistics, data science, operations). Prior experience in strategic finance, business analytics, investment banking or consulting. Within a marketplace setting is preferred. Expertise in modeling techniques with a demonstrated ability to handle large datasets, develop new analytical frameworks, and extract actionable insights. Familiarity with SQL and data visualization tools to synthesize complex information. Exceptional business acumen, strategic thinking skills, and the ability to make informed judgments. Excellent communication skills, and strong capability to work cross functionally and influence across functions. Proven track record of driving change and making an impact in dynamic, unstructured environments. Collaborative and team oriented, maintaining a positive, solution focused attitude. Compensation: $63.78 – 68.97/hr W 2 Req#: 36531919 show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316661162/"
    },
    {
      "job_title": "Senior Infrastructure Business Systems Analyst III",
      "company": "Vaco by Highspring",
      "description": "Unable to partner with 3rd party vendors (Corp to Corp/C2C) for this opportunity. We are unable to sponsor at this time. Relocation assistance is not provided. *Remote first role with preference for candidates in Raleigh, NC or Eastern Time (EST) zone. About the Role Our client, a leading name in the banking sector, is seeking a Senior Infrastructure Business Systems Analyst III to support and lead critical infrastructure initiatives. This hybrid role balances project leadership and data analysis, with a strong emphasis on hands on experience in IT infrastructure domains such as storage, mainframe, and backup systems. The ideal candidate will have previously worked in an infrastructure engineering or operations capacity before transitioning into an analyst/project leadership role. This is an exciting opportunity for someone who thrives in a fast paced, highly collaborative environment and brings deep understanding of infrastructure systems paired with analytical problem solving and cross team coordination skills. Key Responsibilities Business Systems Analysis & Reporting (60%) Analyze infrastructure related data sets primarily sourced from ServiceNow. Perform exploratory data analysis (EDA) to identify patterns, anomalies, and actionable insights. Build structured reports and Excel spreadsheets to support decision making and executive reporting. Collaborate with a Power BI focused team member; basic working knowledge of Power BI is expected for reviewing/reporting data. Project Management (40%) Serve as project lead or SME for infrastructure initiatives involving storage, mainframe, and backup systems. Drive the coordination, planning, and execution of cross functional infrastructure projects from concept through delivery. Act as a liaison between technical teams and business stakeholders, ensuring infrastructure needs and constraints are fully understood. Create project documentation, timelines, and deliverables, ensuring alignment with broader IT and infrastructure strategy. Required Qualifications 8+ years of experience as a Business Systems Analyst, with demonstrated multi year success in enterprise infrastructure environments. Proven hands on experience or former role in infrastructure engineering (e.g., systems, storage, mainframe, backup operations). Solid understanding of ITSM tools and processes, particularly ServiceNow. Strong experience with data parsing, spreadsheet reporting, and exploratory data analysis techniques. Prior experience supporting or leading infrastructure related projects in large scale financial services or enterprise environments. Strong organizational, communication, and stakeholder management skills. Familiarity with Power BI from an end user perspective. Prior experience working within or alongside infrastructure operations teams. Experience in the banking or financial services sector. Knowledge of ITIL processes and project governance frameworks. Exposure to cloud based infrastructure transitions. Unable to partner with 3rd party vendors (Corp to Corp/C2C) for this opportunity. We are unable to sponsor at this time. Relocation assistance is not provided. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331865448/"
    },
    {
      "job_title": "Social Media Analyst",
      "company": "The Sage Group",
      "description": "Social Intelligence_Analyst and Listening Off Hours: Evenings/Nights Sun Thurs Great opportunity to join one of the largest and highly sought after consumer tech companies in the world. The Sage Group’s client, a beloved Tech and streaming company, is seeking a social analyst to join the global Insights & Analytics team. In this role, you will be responsible for owning each step in the reporting process, from developing queries to building cohesive, written reports that showcase social insights. This role requires strategic thinking, a deep analytical mindset, and excellent communication skills. You are an analytical thinker and problem solver who understands how to synthesize the big picture implications of social data to help the company make critical decisions. You are very organized, independent, and a team player, willing to jump in and help others when needed. Responsibilities: Create complex Boolean queries in Brandwatch to analyze specific topics Clean + update queries as needed Create filters + audience lists to segment queries Create analytics solutions in Brandwatch in showcase insights (dashboards, alerts, reports) Build written reports outside of Brandwatch (Word docs, slides) to analyze the content of social conversation and provide the company with strategic and thoughtful insights Present findings from reports, along with recommendations, to XFN teams Train team members on using Brandwatch and the self serve dashboards that you’ll create for them Build processes to scale social efforts across the organization Required Skills: Strategic and data driven: Someone who’s able to carefully and knowledgeably contribute to bigger picture goals using data and insights Social media analytics experience + tool knowledge: Expert in writing complex Boolean logic based queries Expert in Brandwatch required Experience in Sprinklr helpful Experience in Tubular, CreatorIQ, DemographicsPro, or another profile based tool is helpful Strong communication and data storytelling skills Proactive, independent worker: someone who makes strategic decisions with minimal guidance from above Curiosity to understand issues and the motivation to drive resolution Additional technical skills highly preferred: Code based skills (SQL queries) a strong plus Dashboard development experience Long term contract – 1 year with the likelihood to extend further Off hours: Evenings/Nights Sun Thurs 100% remote within the United States $ 75 hourly range, w 2 Medical, dental, vision and 401(k), and PTO benefits offered show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317445908/"
    },
    {
      "job_title": "Analyst, Tech Controls",
      "company": "Coinbase",
      "description": "Ready to be pushed beyond what you think you’re capable of? At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system. To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems. Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. While many roles at Coinbase are remote first, we are not remote only. In person participation is required throughout the year. Team and company wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported. Coinbase stores more digital currency than any company in the world, making us a top tier target on the internet. Security is core to our mission and has been a key competitive differentiator for us as we scale worldwide. Essential to scaling is building and running a security compliance program that reflects how we protect the data and assets in our care, to open the doors with customers, regulators, auditors, and other external stakeholders. Coinbase is looking for an Analyst, Tech Controls to support the second line of defense technology compliance initiatives. This role will play a critical part in assisting with the design, implementation, and monitoring of a technology control framework. The Analyst will work closely with cross functional teams to ensure excellence in control ownership and contribute to the maturity of the Technology Risk and Controls program. What you’ll be doing (ie. job duties): Lead IT process and gap assessments against industry standards and technology regulatory requirements to evaluate control design and operating effectiveness Design, review and validate processes and configurations across technology systems, including cloud environments, operating systems, databases, and network infrastructure, to ensure alignment with established standards, compliance requirements, and best practices Assist in maintaining and providing oversight over the technology controls inventory to mitigate technology risks and meet regulatory requirements, technology policies, and frameworks Collaborate with stakeholder teams including Security, Engineering, Technology Governance, IT, and Operational Risk to support technology requirements and ensure control ownership Developing technology requirements for new products, updating existing controls, and providing subject matter expertise to product teams Support Security Compliance, Information Security, Platform, and Engineering stakeholders in identifying and executing on continuous control monitoring opportunities Provide guidance and leverage technical expertise to determine effectiveness of change management processes, i.e. unit testing, CI/CD, etc. Define, draft and communicate identified issues and technology process improvement opportunities and assist in developing creative solutions to mitigate risks and address regulatory challenges Provide reporting to stakeholders and management on progress, escalations, and control initiatives Drive the creation of procedural documentation, including training materials that support first line of defense risk management, in the form of runbooks and narratives Validate remediation efforts for identified gaps and issues to ensure resolution effectively aligns with regulatory requirements, industry standards, and internal policies Drive creation of clear and concise technical documentation for control monitoring What we look for in you (ie. job requirements): Minimum of 2+ years of experience in Security Engineering, Technology Compliance, IT audit, or equivalent roles Strong knowledge and hands on experience in technology frameworks such as COBIT, NIST, ISO 27001 Hands on experience in security engineering, implementing security frameworks, or designing and managing technical controls Proven technical understanding and operation within cloud technologies, AWS preferred Strong understanding of control monitoring processes Excellent oral and written communication skills Ability to effectively and autonomously accomplish outcomes across cross functional teams in ambiguous situations with limited supervision Ability to multitask, prioritize work, and meet deadlines in a fast paced environment Ability to communicate with technical and non technical stakeholders to align on shared outcomes Nice to haves: BA or BS in a technical field or equivalent experience Cloud certifications such as AWS Certified Security Specialty, or equivalent certifications Security certifications e.g. CISA, CISSP, COBIT or other relevant certifications Technical understanding of fintech services and/or crypto space Position ID: P60079 Pay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)). Pay Range: : $135,320 USD $159,200 USD Please be advised that each candidate may submit a maximum of four applications within any 30 day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying. Commitment to Equal Opportunity Coinbase is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Employee Rights and the Know Your Rights notices by clicking on their corresponding links. Additionally, Coinbase participates in the E Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Global Data Privacy Notice for Job Candidates and Applicants Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here. AI Disclosure For select roles, Coinbase is piloting an AI tool based on machine learning technologies to conduct initial screening interviews to qualified applicants. The tool simulates realistic interview scenarios and engages in dynamic conversation. A human recruiter will review your interview responses, provided in the form of a voice recording and/or transcript, to assess them against the qualifications and characteristics outlined in the job description. For select roles, Coinbase is also piloting an AI interview intelligence platform to transcribe and summarize interview notes, allowing our interviewers to fully focus on you as the candidate. The above pilots are for testing purposes and Coinbase will not use AI to make decisions impacting employment. To request a reasonable accommodation due to disability, please contact accommodations@coinbase.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271063991/"
    },
    {
      "job_title": "Sr. Settlements Analyst",
      "company": "Piper Maddox",
      "description": "Our client is a key player in the global energy analytics space, seeking a Senior Settlements Analyst to join the team. The Senior Settlements Analyst will act as the in house expert on ISO settlements—ensuring accurate processes, driving system updates, and supporting both internal teams and clients with settlement related expertise. Requirements Minimum 2 years of direct CAISO settlement experience At least 5 years of settlements experience across U.S. ISOs Proficiency in SQL for data analysis and troubleshooting Compensation & Benefits Salary: up to $150k Location: Remote show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4296364370/"
    },
    {
      "job_title": "Principal AI Engineer & Data Analyst",
      "company": "Concepts Beyond",
      "description": "Position Overview Shape Safer Skies with Data! This challenging and rewarding role combines strategic vision, analytical leadership, and hands on technical expertise to lead data driven Artificial Intelligence (AI) innovation initiatives. You will define and implement enterprise AI and data strategy, architect scalable analytical systems, and deliver AI/ML analytics to improve aviation. Work with stakeholders, engineers, and data scientists to analyze the results within the context of the aviation domain and transform data into executable information that can impact business decisions and policies. Concepts Beyond provides Systems Engineering and aviation expertise to advance Air Traffic Management concepts and develop Information Management & related technologies including AI, Cloud Computing, Mobile Apps, and Cybersecurity. Essential Functions Strategic Leadership Develop and execute Data, Analytics, and AI strategy, aligning with customer requirements and business goals. Lead the technical direction of AI / Machine Learning (ML) research & development and create AI/ML adoption frameworks and governance models for scalable enterprise deployment. Identify opportunities for AI enablement, automation, and advanced analytics across business functions. Represent the company’s AI/ML portfolio through thought leadership; engaging customers, industry, and partners; contribute to technical publications, author white papers, and speaking at live events. Hands On AI/ML Development & Data Analysis Define aviation safety data requirements, methodologies, and AI/ML models to generate actionable safety metrics. Analyze complex datasets in the aviation domain and translate insights into strategic recommendations. Architect and implement scalable data pipelines, feature stores, and model workflows using Airflow, Prefect, AWS Glue, or Azure Data Factory on AWS, Azure, or GCP. Build, train, and deploy AI/ML models for Natural Language Processing (NLP), computer vision, predictive analytics, and generative AI, including Large Language Models (LLMs) and VectorRAG / GraphRAG / HybridRAG frameworks. Develop and validate data transformations, normalization, and anomaly detection to ensure quality and integrity. Use distributed frameworks such as Spark, Flink to process and integrate large scale data with enterprise platforms (Palantir Foundry, AWS, Azure, GCP). Establish and enforce data governance for lineage, transformation logic, privacy, and ethical AI compliance. Deploy AI agents and vector based retrieval systems to enhance automation and decision making. Collaborate with data scientists, analysts and engineers to ensure model scalability, performance, and reliability. Required Qualifications Bachelor’s or Master’s degree in Engineering or related technical field. Advanced degrees such as Ph.D. can be substituted for some experience. 5+ years of AI, data engineering experience designing and maintaining scalable data pipelines and analytics systems. Data modeling expertise with normalization, star/snowflake schemas, and Type 1/Type 2 slowly changing dimensions. Experience developing, deploying, and maintaining machine learning models for classification, anomaly detection, and NLP techniques for text analysis, information extraction, and sentiment / entity extraction. Hands on experience with AI/ML data pipelines and preprocessing for LLMs, including data extraction, chunking, embedding, and grounding. and Generative AI and Retrieval Augmented Generation (RAG) architectures. Proficient in Python with strong software engineering practices: object oriented design, testing frameworks (pytest, unittest), logging, error handling, and version control. Expertise with big data process frameworks (Hadoop, Spark, Flink, etc.), relational databases (PostgreSQL, MySQL, SQL Server) and non relational databases (Elasticsearch, MongoDB, etc.), ETL/ELT orchestration using Apache Airflow, Prefect, Luigi, AWS Glue, or Azure Data Factory. Proficient with cloud data ecosystems (AWS, Azure, GCP) and data integration within enterprise platforms. Desired Skills Aviation Safety domain or FAA/NAS systems exposure (highly desirable) Palantir Foundry platform for data integration and AI model deployment (highly desirable) LLM and RAG pipelines using vector databases such as Pinecone, Weaviate, ChromaDB, FAISS Production ML systems: feature stores, model registries (MLflow, Weights & Biases), A/B testing frameworks Speech technologies: STT/TTS systems such as Whisper, Google Cloud Speech, Azure Speech Services, custom voice models, accent adaptation Streaming NLP, real time inference, AI agents/agentic architectures LLM fine tuning using PyTorch, TensorFlow, Hugging Face Transformers (LoRA, QLoRA) MLOps practices: model drift detection, retraining pipelines, deployment strategies, production monitoring DevSecOps in regulated or safety critical environments, and NPEIDMS Data visualization tools (Tableau, Power BI, Looker) API integrations (RESTful/GraphQL) / API TRAX and streaming platforms such as Kafka, Kinesis, Pulsar Containerization (Docker, Kubernetes) and infrastructure as code (Terraform, CloudFormation) Data serialization formats and tradeoffs (Parquet, Avro, ORC, JSON, CSV, BIN HEX) show less",
      "date_posted": null,
      "location": "Washington DC-Baltimore Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4315994060/"
    },
    {
      "job_title": "Data Analyst | $100/hr Remote",
      "company": "Crossing Hurdles",
      "description": "At Crossing Hurdles, we work as a referral partner. We refer candidates to our partner that collaborates with world’s leading AI research labs to build and train cutting edge AI models. Position: Expert Data Scientist Type: Hourly Contract Compensation: $100/hour Location: Remote Duration: Approximately 2 months Commitment: 10 40 hours per week, fully asynchronous Role Responsibilities Analyze large structured datasets provided by partner organizations to support AI model development Design reasoning based analytics questions requiring multi step problem solving and data interpretation Write and validate Snowflake SQL queries, using tools such as DuckDB, pandas, or Python notebooks, to address analytical questions Produce clear, human readable explanations articulating analytical reasoning and insights Format deliverables into structured JSON outputs that include question, query, and answer components Ensure output consistency and quality through collaboration with peers and feedback from reviewers Ideal Qualifications Strong experience in data analytics, data science, or a related quantitative field Proficiency in SQL and Python, with preferred experience in DuckDB or pandas Strong skills in data exploration, statistical reasoning, and business intelligence Experience using analytical tools like iPython, Jupyter Notebooks, and GitHub Excellent written communication skills with the ability to clearly explain complex reasoning Bachelor’s degree in Computer Science, Statistics, Mathematics, or a related discipline; advanced degree preferred Application Process Upload resume AI interview based on your resume (15 min) Submit form show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331654413/"
    },
    {
      "job_title": "Business Analyst",
      "company": "Tata Consultancy Services",
      "description": "Job Title: Business Analyst Must Have Technical/Functional Skills Requirement Elicitation and Analysis Need BA with Clinical domain knowledge (Metadata Repository (MDR) preferably) • Strong understanding of clinical domain and has worked on Clinical Data Management • Understanding of CDISC standards o SDTM o SRDM o ADAM etc. • Work closely with business stakeholders to understand their needs, objectives, and challenges. • Elicit, document, and analyze business requirements, processes, and workflows. • Translate business requirements into clear and concise functional and non functional specifications for technical teams. • Solution Design: • Collaborate with technology teams to detail requirements that meet business needs. • Stakeholder Communication: • Serve as a liaison between business stakeholders and technology teams. • Documentation: • Create detailed documentation including business requirements documents process flows, use cases, and user stories/requirements. Roles & Responsibilities • Business Analyst Role • Liaise with customers and agree on the requirements • Create user Stories in JIRA • Requirements sign off with customer • Work with technical team • Documentation Generic Managerial Skills • Excellent communication • Good Analytical skills • Good Business Acumen • Good Interpersonal skills • Excellent presentation skills show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4308843438/"
    },
    {
      "job_title": "Business Analyst",
      "company": "Medasource",
      "description": "Role: Healthcare IT Business Analyst Type: Contract Duration: 12 months Location: Remote Summary: We are seeking a detail oriented and analytical Healthcare IT Business Analyst to join our team to help with a role based provisioning initiative. This role bridges the gap between healthcare operations and IT by gathering requirements, analyzing workflows, and supporting the development and implementation of healthcare information systems. The ideal candidate will have experience working with EHR systems, healthcare data standards, and clinical or administrative stakeholders. Responsibilities: Gather, document, and analyze business and functional requirements from stakeholders across clinical, administrative, and IT departments. Facilitate meetings and workshops with cross functional teams to identify pain points and propose solutions. Act as a liaison between end users and technical teams to ensure system solutions meet business needs. Conduct gap analyses and recommend improvements for healthcare processes and systems. Collaborate in the design, testing, and implementation of provisioning process. Develop detailed business process models, user stories, and data flow diagrams. Support data migration, system integration, and report development efforts. Qualifications: Bachelor’s degree in Information Technology, Healthcare Administration, Business Analysis, or related field. 3+ years of experience in a business analyst role within a healthcare or health IT environment. Experience with EHR/EMR systems (e.g., Epic, Cerner, Meditech). Understanding of healthcare data standards (e.g., HL7, FHIR, ICD 10, CPT). Proficiency in tools such as JIRA, Confluence, Visio, and SQL or data visualization platforms (e.g., Power BI, Tableau). Strong communication and interpersonal skills. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317974158/"
    },
    {
      "job_title": "REMOTE - Lead Systems Analyst - Contract",
      "company": "The Midtown Group",
      "description": "Our insurance client is hiring a Lead Systems Analyst to support their team in Chicago, IL! Responsibilities: Effective at gathering and analyzing business requirements and current system behavior and collaborating to create system design specification documents including functional specifications, system use cases, mock ups, and design models. Work within a complex team environment, working with multiple vendor teams, providing SME support across multiple programs, Handling reference data management / governance and end to end data lineage Qualifications: 3+ years' experience in database modeling including one or more of the following: DB2, Oracle, SQL/Server or comparable. 3+ years' experience in Cognos, Tableau, XML, SQL, Ab Initio, DB2, and Oracle. The Midtown Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. We are a small, woman owned business certified by the Women’s Business Enterprise National Council (WBENC). Operating from our headquarters in Washington, DC, we provide trusted staffing services nationwide. Our clients include thousands of the most prestigious Fortune 500 companies, law firms, financial organizations, tech innovators, non profits, and lobbying firms, as well as federal, state and local government agencies. The Midtown Group is a multi award winning \"Best Places To Work\" staffing firm in Washington, DC (per Inc. Magazine)!! show less",
      "date_posted": null,
      "location": "Chicago, IL",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4331682065/"
    },
    {
      "job_title": "Manager Business Systems Analyst",
      "company": "Robert Half",
      "description": "Who We Are Robert Half is seeking a dynamic and strategic Manager, Business Systems Analysts to lead, develop, and inspire a high performing team of Business Systems Analysts (BSAs). This leader will oversee the team’s work in analyzing, documenting, and improving complex business processes and systems that support core operational objectives. The ideal candidate is a proactive and collaborative leader with a strong history of building high impact teams, driving cross functional alignment, and delivering scalable business solutions. As a manager, you will partner with senior leadership across business, engineering, quality, and project management teams to ensure the delivery of high quality system requirements and solutions. This role requires a leader who is not only technically proficient, but also a mentor, coach, and change agent—someone who can grow talent, foster a culture of continuous improvement, and align the team's efforts with broader organizational goals. What You'll Do Team Leadership & Development Lead, manage, and mentor a team of Business Systems Analysts, fostering a high performance, collaborative culture. Define team goals and KPIs aligned with business objectives; track performance and provide ongoing coaching, feedback, and development opportunities. Identify skill gaps and create growth plans to support professional development and succession planning. Promote knowledge sharing, cross training, and role coverage to build a resilient and agile team. Strategic Planning & Execution Oversee resource planning, project prioritization, and workload management to ensure timely delivery of initiatives. Establish and maintain standards for business analysis best practices, tools, and documentation across the team. Collaborate with business stakeholders to define clear, actionable requirements that align with company priorities. Participate in strategic planning and roadmap development for business systems and technology initiatives. Stakeholder Collaboration Serve as a trusted partner to business owners, engineering, QA, and PMO teams to align efforts and drive shared outcomes. Ensure BSAs maintain strong working relationships and effective communication with internal and external partners. Act as a liaison between business and technical teams, helping translate business needs into scalable system solutions. Operational Excellence & Governance Champion continuous improvement in processes, documentation quality, and customer satisfaction. Ensure documentation of all business requirements, workflows, and system functionality is accurate, consistent, and current. Guide team in compliance with internal policies, processes, and best practices. Influence policy and procedural changes to improve team operations and efficiency. Team Enablement & Accountability Provide ongoing support and training to empower BSAs as subject matter experts in their domains. Set clear performance expectations and hold team members accountable to deadlines, quality, and stakeholder satisfaction. Recognize and reward individual and team accomplishments while proactively addressing performance issues. Lead the recruiting and onboarding of new team members. What You'll Need Bachelor’s Degree in Computer Science, MIS, Engineering, Math, or equivalent experience of 5+ years in a software development environment working in a leadership capacity managing 4+ employees. 7+ years’ experience demonstrating a progression of roles with responsibilities including software development and project management. 3+ years’ experience leading and growing a team of at least three Business Systems Analysts is strongly preferred. Experience in eliciting, documenting, and validating business requirements. Experience managing a team using most of the following: structured business analysis, competency modeling, project planning, performance metrics, data modeling, information engineering, mathematical model building, sampling, and resource planning. Experience managing a team responsible for analyzing and designing multi tier business applications. Experience leading multidisciplinary teams (Business, Development, QA, etc.). Experience managing teams responsible for analyzing complex enterprise class application environments (e.g., ERP, SaaS, Finance & Accounting, or other back office applications) utilizing Java, J2EE, Web Services, etc. Experience with PeopleSoft Financial systems. Hands on experience with Salesforce systems is required, including working knowledge of Sales Cloud, Service Cloud, Marketing Cloud, and Experience Cloud. Salesforce Administrator certification and cloud platform certifications (e.g., AWS, Azure, Google Cloud) are preferred. Demonstrated track record of productivity, initiative, and effective priority management. Experience managing the complete project lifecycle. Experience managing full development cycles for software applications using tools such as MS Project, Visio, JIRA; Subversion experience is preferred in some cases. Proficiency in SQL and SOQL, with the ability to write and interpret queries across both relational and Salesforce databases. Knowledge of DB2, Oracle, or equivalent relational database systems. show less",
      "date_posted": null,
      "location": "San Ramon, CA",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4299014908/"
    },
    {
      "job_title": "Senior Principal Analyst - SIEM & SOC Strategy",
      "company": "Gartner",
      "description": "About the role: Gartner Analysts are industry thought leaders who create must have research, market predictions and best practices for a broad range of world leading organizations. A Senior Principal dives deep into research and analysis of complex datasets to identify problems and develop strategies that help clients solve problems and improve their company’s performance. A Senior Principal is also a trusted source of advice for clients, reinforcing Gartner’s value every day by engaging clients via virtual meetings and live events to discuss complex client challenges and offer appropriate recommendations. What you will do: Create high quality, clear, actionable, “must have research” content Research, analyze and predict market trends and shifts and provide clients, including vendors, with actionable insights based on market research and positioning Conduct research and analysis supporting key initiatives Develop and provide expertise to guide clients to the best actions for them and their organizations Apply critical thinking skills to de construct and frame challenging client questions Provide clients and prospects with actionable advice aligned to their designated content area via virtual or face to face interactions Proactively support Sales and Service and other internal stakeholders to drive commercial outcomes Create and deliver presentation materials for Gartner events, industry and professional association conferences, and client briefings Provide high quality and timely research content peer review Actively participate in innovation, ideation and research efforts to discuss research issues; Collaborate effectively with peers in the research community Subject Matter Expertise: Security Information and Event Management (SIEM): Evaluating and selecting tools, Use case design, RFP Assistance and Review Security Operations Center (SOC), Building and managing a modern SOC including exposure to the following: Defining roles, responsibilities, and skills Driving In source/Outsource Decisions and exploring the role of AI Evaluating, selecting and partnering with Managed Security Service Providers (MSSPs) and Managed Detection and Response (MDR) providers What you will need: Bachelor's degree or equivalent experience; Graduate degree preferred 8 10 years of relevant field or industry experience Strong written and verbal proficiency, analytical and presentation skills; ability to engage clients and respond effectively to questions Demonstrate superior analytical skills while applying conceptual models, recognizing patterns while drawing and defending conclusions Ability to work independently, while also being intrinsically motivated to collaborate across teams and support the workflow of others, in a multicultural global team Strong organizational skills; ability to work under tight deadlines and produce high quality deliverables Adept at analyzing and synthesizing data; can effectively apply patterns and frameworks to client challenges Strong business and financial acumen Demonstrate executive presence; can immediately establish credibility with executives and additional stakeholders Subject matter expertise; Comfortable presenting at large and small scale speaking engagements Demonstrate willingness and foundation ability to mentor and coach others Flexible thinker adept at change and experienced navigating highly matrixed environments Willingness and ability to travel up to 10% (where applicable) Who are we? At Gartner, Inc. (NYSE:IT), we guide the leaders who shape the world. Our mission relies on expert analysis and bold ideas to deliver actionable, objective insight, helping enterprise leaders and their teams succeed with their mission critical priorities. Since our founding in 1979, we’ve grown to more than 21,000 associates globally who support ~14,000 client enterprises in ~90 countries and territories. We do important, interesting and substantive work that matters. That’s why we hire associates with the intellectual curiosity, energy and drive to want to make a difference. The bar is unapologetically high. So is the impact you can have here. What makes Gartner a great place to work? Our sustained success creates limitless opportunities for you to grow professionally and flourish personally. We have a vast, virtually untapped market potential ahead of us, providing you with an exciting trajectory long into the future. How far you go is driven by your passion and performance. We hire remarkable people who collaborate and win as a team. Together, our singular, unifying goal is to deliver results for our clients. Our teams are inclusive and composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We invest in great leaders who bring out the best in you and the company, enabling us to multiply our impact and results. This is why, year after year, we are recognized worldwide as a great place to work. What do we offer? Gartner offers world class benefits, highly competitive compensation and disproportionate rewards for top performers. In our hybrid work environment, we provide the flexibility and support for you to thrive — working virtually when it's productive to do so and getting together with colleagues in a vibrant community that is purposeful, engaging and inspiring. Ready to grow your career with Gartner? Join us. Gartner believes in fair and equitable pay. A reasonable estimate of the base salary range for this role is 105,000 USD 140,000 USD. Please note that actual salaries may vary within the range, or be above or below the range, based on factors including, but not limited to, education, training, experience, professional achievement, business need, and location. In addition to base salary, employees will participate in either an annual bonus plan based on company and individual performance, or a role based, uncapped sales incentive plan. Our talent acquisition team will provide the specific opportunity on our bonus or incentive programs to eligible candidates. We also offer market leading benefit programs including generous PTO, a 401k match up to $7,200 per year, the opportunity to purchase company stock at a discount, and more. The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to seek to advance the principles of equal employment opportunity. Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964 0096 or by sending an email to ApplicantAccommodations@gartner.com. Job Requisition ID:100717 By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence. Gartner Applicant Privacy Link: https://jobs.gartner.com/applicant privacy policy For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser. show less",
      "date_posted": null,
      "location": "Texas, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271595382/"
    },
    {
      "job_title": "Equity Research Analyst (Part-Time) $80 –$150/hr",
      "company": "Call For Referral",
      "description": "Investment Services Expert Hourly Contract | Part time Remote $80 –$120 per hour About the Role A leading AI research initiative is recruiting Investment Services Experts to collaborate on a frontier project that enhances large language models (LLMs) for real world financial reasoning. In this role, you’ll leverage your expertise across investment banking, private equity, asset management, or equity research to evaluate, design, and refine AI workflows that simulate complex financial analysis and decision making. Your work will help shape how next generation AI systems interpret markets, evaluate deals, and forecast business outcomes with human level accuracy. Key Responsibilities Evaluate AI generated investment analyses for accuracy, clarity, and strategic rigor. Calibrate AI decision making in areas like valuation modeling, portfolio analysis, financial forecasting, and risk assessment. Design and validate structured tasks that mirror real world workflows in investment services. Provide written and analytical feedback to improve model reasoning, depth, and realism. Collaborate asynchronously with AI researchers to ensure content quality and business alignment. Ideal Qualifications 2+ years of experience in investment services — including investment banking, private equity, asset management, or equity research. Bachelor’s degree in Finance, Economics, or Business Administration (Advanced degrees or CFA/CPA/CAIA certifications are a plus). Deep understanding of valuation, financial modeling, market analysis, and portfolio management. Strong quantitative and analytical reasoning skills. Exceptional communication and attention to detail — ability to distill complex concepts into actionable insights. Project Timeline Start Date: Immediate Duration: 1–2 months Commitment: ~20 hours/week (flexible, part time) Schedule: Fully remote and asynchronous — work at your own pace Compensation & Contract Rate: $80–$120 USD/hour (based on experience) Bonuses: Top performers earn weekly incentives of $20–$100/hr on top of base pay Contract Type: Independent contractor Payments: Daily via Stripe Connect Application & Onboarding Process Upload your resume or CV. Complete a short AI interview (no prep required). Participate in a paid, 3 hour work trial to assess your ability to interpret project guidelines and produce high quality investment related content. ⚡ PS: Mercor team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity. ⚡ show less",
      "date_posted": null,
      "location": "New York, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318063754/"
    },
    {
      "job_title": "Sr. ERP Business Analyst - Oracle Cloud SCM/WMS",
      "company": "Sunrun",
      "description": "Overview: Sunrun ERP Team is looking for an experienced Senior ERP Functional Analyst with expertise in Oracle Cloud Warehouse Management (WMS) Suite and SCM applications. The successful candidate will be responsible for implementing WMS solutions, which involves tasks such as gathering business requirements, designing solutions, implementing solutions, and providing user support. This role is ideal for a candidate who understands both warehouse and supply chain functions, expert in Oracle Cloud technologies, and can work with business stakeholders, play a key role in optimizing WMS processes, maximize the efficiency of the Oracle Cloud platform, and deliver a seamless business user operational experience . Key Responsibilitie s:Demonstrated experience as a specialist assisting in the definition of systems strategy, gathering and documenting business requirements, leading fit gap analysis, as is and to be business process designs, functional configuration, testing, user training, and suppor t.Act as the subject matter expert (SME) and provide in depth systems expertise from a functional perspective in support capacity, for new initiatives and projects, leveraging Oracle Cloud WMS Suite and SCM application s.Design, Configure, implement, and support Oracle Cloud WMS module (including Distribution Centers and Branch Warehouses ).Demonstrated ability to improve process efficiency and promote optimization in warehouse operational processe s.Lead business initiatives, integrate and automate workflows/integrations across warehouse functions to reduce manual interventions and improve system performanc e.Collaborate with internal and external teams to troubleshoot and resolve system issues, ensuring timely and efficient support for business operation s.Ensure seamless integration between Oracle WMS and other enterprise applications (Oracle Fusion, TMS, Flexi pro, etc.), conduct system testing, and validate solution s.Proven hands on experience in Cloud WMS module configurations and fusion SCM module configurations as part of solution implementatio n.Conduct on/off site training to end users, create documentation, and develop best practices for system usag e.Outstanding work ethic, humbleness, and displays a high sense of urgency to resolve issues quickly and efficientl y. Required Qualificatio ns:Bachelor's degree in Supply Chain Management, Warehouse Management, Computer Science, Information Technology, or related fie ld.Minimum 8 years of Oracle Cloud experience in Oracle Functional Analyst role, with at least 5 years of experience in Oracle WMS modules, 3 years of experience in SCM modul es.Proficient and Strong understanding of Supply Chain and Warehouse Management system functions and Process es.Experience in configuring and maintaining the supply chain applications, which include Oracle Cloud WMS and Fusion SCM modul es.Set up WMS functionalities such as facilities, locations, receiving, put away, waving, picking, packing, shipping, inventory control, and labor manageme nt.Ability to support Oracle Cloud OTM, Shipping, and Logistics functio ns.Working Knowledge with Fusion SCM modules like Oracle PIM, PD, OM, Procurement, Supplier portal e tc.Provide user support and troubleshoot issues related to the Supply Chain arena, including Warehouse Management, Order Management, and Product Information Management modul es.Ability to lead business requirement gathering activities of moderate to high complexity and medium to large size to support team assignments and objectiv es.Excellent communication skills, both written and verbal, with Strong analytical skills and attention to deta il.Ability to work independently and as part of a team, Willingness to learn and adapt to new technologies and process es. Preferred Qualificati ons:Exposure to working with Salesforce CRM applicati ons.Oracle Cloud certification in WMS and SCM applicat ion.Flexibility to adapt to changing business needs, growing operational complexity, and technology environme nts. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4311643603/"
    },
    {
      "job_title": "Oracle Business Analyst",
      "company": "Gridiron IT",
      "description": "Oracle EBS Budget to Report Business Analyst Location: Remote Work Type: Remote Remote Work: Remote Job Description: Gridiron IT is looking to hire a Oracle EBS Budget to Report Business Analyst. as a Functional Analyst part of an Oracle E Business Suite (EBS) R12 integrated project team supporting a Department of Defense (DoD) multi Agency program. You will be part of a team where complex problem solving, and communication skills are critical to success. This environment provides an unparalleled opportunity to grow and advance, while changing the way the government delivers software applications. In addition, you will work closely with business stakeholders and Oracle matrixed cross functional resources to perform analysis, solution cost estimation, design, planning, scheduling, documentation, testing, and validation. Responsibilities: Perform as an Oracle EBS Budget to Report (B2R) functional analyst responsible for analysis, solutioning, testing, and production support of an Oracle EBS program Collaborate with stakeholders and other cross functional team members (Developers, Functional Analysts, and Testers) to produce scalable, efficient, and supportable solutions utilizing Oracle and related technologies Provide recommendations supportive of program’s Global Model and long term organization strategy for enterprise level applications, architecture, upgrades, interfaces, and enhancements Work in Business Intelligence Data Management and Reporting Solutions Responsible for the creation, modification, and execution of test plans and scripts Responsible for analyzing and solutioning application issues, and assisting cross functional teams testing and implementing resolutions Provide Tier 2/3 end user support Work independently and manage multiple task assignments. Qualifications: Bachelor’s degree (will consider experience in lieu of education) Five or more years of DoD and/or Federal Oracle EBS implementation experience Experience with maintenance support of Oracle EBS R12 Federal Financials of Budget to Report (B2R), with a good working knowledge of Procure to Pay (P2P), Contract Lifecycle Management (CLM), Acquire to Retire (A2R), and Order to Cash (O2C) Ability to analyze, troubleshoot, and recommend break fix solution based upon best practices Experienced in GL/FV/SLA with hands on ability to analyze and configure SLA Experience with sub ledger accounting in the areas of AP, FA, AR, PA, and CLM Experience with Federal Budgets, Continuing Resolution Authority, Reprogramming and Rescissions, Prior Period Adjustments, Creating and Posting Journals Experienced in key reporting requirements such as Fund Management, Budget Execution, Treasury Requirements Experience reviewing and executing Month End Close and Federal Year End Close/Year Begin procedures Experience in authoring functional design specifications, configuration documents, test plans, and test scripts Demonstrated strong analytical skills and problem solving ability Ability to multitask among changing priorities Strong verbal, written, interpersonal, troubleshooting, and analytical skills Proficient in authoring and presenting program solution related documents Must be a U.S. Citizen and able to obtain an IT II background investigation. Clearance Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. Compensation and Benefits Salary Range: $45 87 hourly (Compensation is determined by various factors, including but not limited to location, work experience, skills, education, certifications, seniority, and business needs. This range may be modified in the future.) Benefits: Gridiron offers a comprehensive benefits package including medical, dental, vision insurance, HSA, FSA, 401(k), disability & ADD insurance, life and pet insurance to eligible employees. Full time and part time employees working at least 30 hours per week on a regular basis are eligible to participate in Gridiron’s benefits programs. Gridiron IT Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status or disability status. Gridiron IT is a Women Owned Small Business (WOSB) headquartered in the Washington, D.C. area that supports our clients' missions throughout the United States. Gridiron IT specializes in providing comprehensive IT services tailored to meet the needs of federal agencies. Our capabilities include IT Infrastructure & Cloud Services, Cyber Security, Software Integration & Development, Data Solution & AI, and Enterprise Applications. These capabilities are backed by Gridiron IT's experienced workforce and our commitment to ensuring we meet and exceed our clients' expectations. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4313262410/"
    },
    {
      "job_title": "Engineering Lead Analyst - VICE PRESIDENT",
      "company": "Citi",
      "description": "The Infrastructure Technology Lead Analyst responsible for the installation, configuration and support of Citi’s IBM iSeries high availability platform. Responsibilities: This position is responsible for the IBM iSeries Operating System management including: Installation and maintenance of the IBM i Operating System, security, middleware and communications software on Power 8 and Power 10 hardware IBMi 7.4 and 7.5 Trinity Guard Suite ConnectDirect IBM MQ IBM C.A.R.T. PKWare PKEncrypt PTC – MKS Implementer TAA Tools SEA – absMessage High availability systems operations, scheduling, automation and support Vulnerability patching of operating system and associated components Storage & File Systems management Hardware Planning, Configuration and Incident Management Performance & Capacity Management System (COB) Continuity of Business processes and procedures Review requirement documents and update processes and procedures as necessary Ensure ongoing compliance with regulatory requirements Perform impact analysis, solve/work high impact problems/projects, and provide resolution to restore services Provide Root Cause Analysis (RCA) post restoration of service Qualifications: 7+ years of experience working on large, complex iSeries environments especially in Financial Services industry, with a proven track record of delivering results on time, operational process change and improvement. 5+ years of experience providing level 2/3 engineering support Ability to work with virtual / in person teams, and work under pressure / to a deadline Effective written and verbal communication skills Effective analytic/diagnostic skills Strong time management and organizational skills Ability to communicate technical concepts to non technical audience Education: Bachelor’s degree/University degree or equivalent experience Job Family Group: Technology Job Family: Systems & Engineering Time Type: Full time Primary Location: Telecommuter Texas United States Primary Location Full Time Salary Range: $117,440.00 $176,160.00 In addition to salary, Citi’s offerings may also include, for eligible employees, discretionary and formulaic incentive and retention awards. Citi offers competitive employee benefits, including: medical, dental & vision coverage; 401(k); life, accident, and disability insurance; and wellness programs. Citi also offers paid time off packages, including planned time off (vacation), unplanned time off (sick leave), and paid holidays. For additional information regarding Citi employee benefits, please visit citibenefits.com. Available offerings may vary by jurisdiction, job level, and date of hire. Most Relevant Skills Please see the requirements listed above. Other Relevant Skills For complementary skills, please see above and/or contact the recruiter. Anticipated Posting Close Date: Sep 12, 2025 Citi is an equal opportunity employer, and qualified candidates will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other characteristic protected by law. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi. View Citi’s EEO Policy Statement and the Know Your Rights poster. show less",
      "date_posted": null,
      "location": "Austin, TX",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4269032520/"
    },
    {
      "job_title": "Regulatory Compliance Analyst",
      "company": "Motion Recruitment",
      "description": "Exciting contract Senior Regulatory Privacy Compliance Analyst opportunity with an established firm. This is a 100% remote role. The Privacy Senior Regulatory Compliance Analyst is responsible for leading and driving complex regulatory and compliance initiatives with a specialized emphasis on privacy laws and data protection regulations. This role plays a critical part in promoting a culture of compliance and reducing enterprise risk related to noncompliance with federal and state privacy laws and regulations, including HIPAA, HITECH, CCPA, and other applicable healthcare data protection standards. This position is responsible for monitoring legislative and regulatory developments, assessing their impact on business operations, and leading and supporting the implementation of privacy compliance initiatives. As a subject matter expert, the Sr. Analyst provides strategic guidance to internal stakeholders, provides privacy risk assessments, and collaborates cross functionally to strengthen the organizations privacy posture. Contract Duration: 12 Months Required Skills & Experience 5+ years healthcare work experience w/Bachelors degree in a related field Strong Project Management skills and experience In depth knowledge of US privacy laws and regulations. Strong analytical skills to analyze complex privacy and security regulations and assess organizational impact. Experience with privacy management tools and platforms. Ability to work under pressure with short deadlines. Excellent written and verbal communication skills to communicate privacy requirements and influence compliance outcomes. Creative problem solving skills. Self motivated with natural curiosity to expedite independent learning and proactively identify opportunities for privacy program improvements. Meticulous attention to detail. Comfortable working in gray areas and navigating ambiguities. Strong organizational and prioritization skills to effectively manage competing priorities. Strong project management skills. Ability to collaborate, mobilize others, and influence without authority by building trust and communicating effectively. Working knowledge of Westlaw or other legal research databases. Proficiency with the Microsoft Office Suite, including Word, Excel, Outlook, Teams, etc. Working knowledge of SharePoint. Bachelor's degree in a related field such as healthcare administration, business administration, health information management, legal studies, cybersecurity/information security Desired Skills & Experience Health insurance and healthcare privacy compliance experience preferred Master's degree in related field preferred CIPP, CHC, cybersecurity or other related privacy and security certifications preferred CIPP, CHC, cybersecurity or other related privacy and security certifications preferred show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317523055/"
    },
    {
      "job_title": "Senior Accounting Policy Analyst",
      "company": "Randstad USA",
      "description": "Leading investment company is looking for a Senior Accounting Policy Analyst to join their growing team. You will be responsible for a variety of manage a wide range of initiatives and recurring and special projects in support of company’s investor relations and treasury management efforts. This position will have visibility and interaction with the executive leadership team and will regularly collaborate with planning and analytics, accounting and external reporting, as well as legal, risk, marketing and other departments. The Manager will build ongoing relationships with external constituencies such as rating agency analysts, securities analysts and investors, and will work with business partners such as company’s external investment manager, banks, IR services vendors and auditors. Responsibilities: Manage all preparations for quarterly earnings announcements, including developing first drafts of press releases, script outlines and Q&A documents for management review Manage and develop presentations for investor marketing, ratings agencies and board reporting Manage review and approval of IR materials, including tie outs with accounting and legal sign off Maintain detailed summary of analyst models and track expectations relative to company forecasts Develop and maintain competitive benchmarking Collect and synthesize market information for presentations, including metrics related to unemployment rates, consumer credit, the housing market and interest rates Prepare written briefings for management summarizing analysis of competitive, market and regulatory developments, earnings reports and analyst comments related to peer companies Maintain a liquidity projection model – a working forecast of cash inflows and outflows across all legal entities Propose strategies to reduce idle cash balances and maximize interest income Work with the external investment manager to monitor credit activity in company's $3.1 billion fixed income bond portfolio and advise management of noteworthy credit developments Prepare the quarterly Investment Portfolio presentation for the Risk Committee of the Board Work with the FP&A team to maintain a working forecast of investment income Requirements: BS degree 5+ years of public accounting, finance or related experience Experience with insurance, capital markets or FP&A preferred Excellent communication skills Salary: $120 160K + annual bonus, stock options Benefits: Medical, dental & vision show less",
      "date_posted": null,
      "location": "California, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317987756/"
    },
    {
      "job_title": "Digital Business System Analyst",
      "company": "RTX",
      "description": "Date Posted: 2025 06 18 Country: United States of America Location: UTCT1: Corp CT Remote Remote Location, Remote City, CT, 06101 USA Position Role Type: Remote U.S. Citizen, U.S. Person, or Immigration Status Requirements: U.S. citizenship is required, as only U.S. citizens are authorized to access information under this program/contract. Security Clearance: None/Not Required RTX Corporation is an Aerospace and Defense company that provides advanced systems and services for commercial, military and government customers worldwide. It comprises three industry leading businesses – Collins Aerospace Systems, Pratt & Whitney, and Raytheon. Its 185,000 employees enable the company to operate at the edge of known science as they imagine and deliver solutions that push the boundaries in quantum physics, electric propulsion, directed energy, hypersonics, avionics and cybersecurity. The company, formed in 2020 through the combination of Raytheon Company and the United Technologies Corporation aerospace businesses, is headquartered in Arlington, VA. The following position is to join our RTX Corporate, Enterprise Services, Research Center or BBN team: The RTX Enterprise Services Organization is seeking an experienced technical business systems analyst to support the integration, optimization, and digital harmonization of quality processes and quality management systems. This role will focus on Hexagon/ETQ Reliance, Net Inspect, SAP Quality, the transition to S4 Hana, other Commercial Off the Shelf (COTS , and in house developed solutions, ensuring seamless functionality and alignment with business objectives. This role requires technical proficiency, creative problem solving skills, and excellent communication skills. What You Will Do: Working with the digital team, map digital business requirements to technical requirements documents, documented use cases, and process maps to further the ideation through solutioning approach using our business process. Leverage our peer support teams and processes to design solutions from Intake through Delivery to Sustainment that meet business needs and are compliant with the organization’s goals and objectives. Guide stakeholders on best practices and utilize our internal processes to achieve optimal results. Identify and drive process improvements through automation, data analytics, and system enhancements. Conduct data analysis and reporting to drive continuous improvement. Develop and maintain technical documentation for system configurations, processes, and best practices. Lead the testing and validation of proposed solutions and ensure they meet business requirements. Act as a liaison between the technical teams and our engaged partners to ensure mutual understanding and flawless delivery of desired solutions for customer use. Collaborate with SAP, Reliance, Net Inspect, eDX (Data and Analytics), CORE, EH&S, as well as operational and business process SMEs across RTX. Partner with technical delivery teams throughout RTX and with approved third party suppliers. Monitor system performance, respond to incidents and problem reports. Utilize the RTX CORE framework, method, and tools. Travel possible, up to 10%. Qualification You Must Have: Typically requires a degree in Science, Technology, Engineering, or Mathematics (STEM), and a minimum of 5 years of prior relevant experience, or an Advanced Degree and a minimum of 3 years’ experience. 3+ years’ proven experience working directly with SAP Quality processes, Hexagon/EtQ Reliance Quality Management Suite, with hands on experience in system implementation and optimization. 3+ years working experience and knowledge of the IT life cycle: Requirements/Analysis, Design, Specification, Code/Configuration, Development Testing, Change Management, Sustain, and Optimize. Experience with agile frameworks/iterative approaches to software development and implementation projects including change management. Skilled in preparation of system requirement specifications to support application development including process flow development. Ability to drive innovation and process efficiency within quality management system and excellent problem solving skills with a data driven approach to decision making with excellent communication and stakeholder management abilities. Qualifications We Prefer: Certified Business Analyst Professional (CBAP), PMI Professional in Business Analysis (PMI PBA), Agile Analysis Certification (AAC), SAFe, Six Sigma, Certification in SAP, Hexagon/ETQ Reliance, SharpCloud. Experience using SAFe Agile framework, JIRA, Confluence, ServiceNow, Microsoft Tool Suite, SQL. Working knowledge of Quality Management Systems, Quality standards, Supplier Quality, and supporting solutions and experience working with Net Inspect quality solutions. Working knowledge of data analytics and reporting tools to enable quality insights and actionable decision making. Initiative / self starter: able to execute within strategic vision with motivation and resiliency and detail oriented with the ability to appropriately balance priorities, deadlines, and deliverables. What We Offer: Whether you’re just starting out on your career journey or are an experienced professional, we offer a robust total rewards package with compensation Work Location: Remote The salary range for this role is 82,000 USD 164,000 USD. The salary range provided is a good faith estimate representative of all experience levels. RTX considers several factors when extending an offer, including but not limited to, the role, function and associated responsibilities, a candidate’s work experience, location, education/training, and key skills. Hired applicants may be eligible for benefits, including but not limited to, medical, dental, vision, life insurance, short term disability, long term disability, 401(k) match, flexible spending accounts, flexible work schedules, employee assistance program, Employee Scholar Program, parental leave, paid time off, and holidays. Specific benefits are dependent upon the specific business unit as well as whether or not the position is covered by a collective bargaining agreement. Hired applicants may be eligible for annual short term and/or long term incentive compensation programs depending on the level of the position and whether or not it is covered by a collective bargaining agreement. Payments under these annual programs are not guaranteed and are dependent upon a variety of factors including, but not limited to, individual performance, business unit performance, and/or the company’s performance. This role is a U.S. based role. If the successful candidate resides in a U.S. territory, the appropriate pay structure and benefits will apply. RTX anticipates the application window closing approximately 40 days from the date the notice was posted. However, factors such as candidate flow and business necessity may require RTX to shorten or extend the application window. RTX is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or veteran status, or any other applicable state or federal protected class. RTX provides affirmative action in employment for qualified Individuals with a Disability and Protected Veterans in compliance with Section 503 of the Rehabilitation Act and the Vietnam Era Veterans’ Readjustment Assistance Act. Privacy Policy and Terms: Click on this link to read the Policy and Terms show less",
      "date_posted": null,
      "location": "Hartford, CT",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4252904557/"
    },
    {
      "job_title": "Collibra Business Analyst",
      "company": "Insight Global",
      "description": "Required Skills & Experience 5+ years as a Business Analyst or Business Systems Analyst 3+ years in enterprise software development or administration Strong experience with: Collibra platform (especially Collibra Protect) Requirements gathering and translation Workflow and process analysis Agile methodologies and product ownership Excellent communication, facilitation, and stakeholder management skills Nice to Have Skills & Experience Experience with: Business process automation Data governance tools (e.g., Informatica Data Quality) LucidChart/Visio for process design Database technologies Writing epics and user stories Healthcare industry knowledge Bachelor’s degree in Computer Science, IT, Math, or related field Job Description Translate business needs into technical requirements for Collibra Administer Collibra Protect and support the IDEAS program Coordinate feature rollouts, bug fixes, and platform improvements Manage product backlog, roadmap, and Agile team priorities Collaborate with business and technical teams to ensure successful delivery of data governance solutions show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318399021/"
    },
    {
      "job_title": "Legal Operations Analyst",
      "company": "Wiz",
      "description": "Come join the company that is reinventing cloud security and empowering businesses to thrive in the cloud. As the fastest growing startup ever, Wiz is on a mission to help organizations secure cloud environments that will accelerate their businesses. Trusted by security teams all over the world, we have a proven track record of success and a culture that values world class talent. Our Wizards from over 20 countries work together to protect the infrastructure of our hundreds of customers, including over 45% of the Fortune 100, who trust us to scan and secure over 230 billion files daily. We’re the leading player in a massive and growing market, but it’s still early enough for you to make a significant impact. At Wiz, you’ll have the freedom to think creatively, dream big, and use your full range of skills to contribute to our record growth. Come join our team and help us create secure cloud environments that allow the best companies to move faster. Summary This is an exciting opportunity to join a high performing and collaborative legal team. We're actively seeking a Legal Operations Analyst to partner with the Head of Legal Operations in our rapidly evolving legal department. This pivotal role will significantly enhance the legal department's efficiency and impact by optimizing processes, managing resources, and ensuring compliance. You'll work closely with the legal team and various internal stakeholders to navigate the complexities of a hyper growth company. What You’ll Do Drive legal technology initiatives by evaluating, implementing, and maintaining cutting edge tools to boost departmental performance. Forge strong partnerships with cross functional teams including sales, support, product, service, business development, regulatory, IT, and finance, ensuring seamless legal support across the organization. Identify and implement creative solutions to automate processes across departments, significantly enhancing operational efficiency. Leverage data analytics to help assess legal department performance, pinpointing and executing on areas for strategic improvement. Oversee legal vendor management, including billing, and proactively identify cost saving opportunities with outside counsel and legal service providers. Provide assistance with template management and CLM backend operations, providing agile support for new projects and business needs as they arise. What You’ll Bring 5+ years of dedicated experience in Legal Operations, with a strong preference for candidates who have worked in fast paced tech or cybersecurity environments. Legal studies or paralegal experience is a plus. A pragmatic and business centric mindset, understanding that the legal team's primary objective is to enable and accelerate business growth. Exceptional communication skills (written and verbal) and a keen eye for detail, coupled with a proven ability to independently manage multiple, complex projects under tight deadlines. Ability to embrace and implement change, including to help conceptualize, plan and execute new ideas and solutions in a very fast paced environment. Proactive and self sufficient work ethic, capable of succeeding in a remote environment while still being an active and present member of the legal team. High proficiency in legal technology, including data management, contract lifecycle management, matter and project management, reporting, and building automations. Direct experience with tools such as or similar to Ironclad, Zip, and Salesforce is highly valued. You should also be eager to explore and work with AI solutions to revolutionize our legal processes. Demonstrated ability to thrive in a chaotic, fast paced environment with a deep understanding of legal team operations and workflows. Proficiency with Google Workspace, Slack and Microsoft Suite. Benefits Wiz offers a competitive package of benefits and programs to support you and your family. Below provides a description of our current benefits for employees in the US. Specific benefits may vary by location. Health & Welfare Benefits Medical, dental and vision insurance Home Office Setup reimbursement Flexible Spending Accounts Monthly Connectivity reimbursement Employee Assistance Program (EAP) Financial Benefits Short and Long term Disability Insurance Life & Accident Insurance 401(k) Retirement Savings Plan (with employer match) Time Off Flexible paid time off + 11 paid holidays Paid leave programs, including parental, pregnancy health, medical and bereavement leave Compensation Starting compensation will be determined based on various factors, including but not limited to, the candidate's job related experience, skills and geographic location. Your Talent Partner can share more about the specific salary range during the hiring process. This role is eligible to participate in Wiz’s equity plan and may also include incentive compensation. The annual base salary range for this full time position is listed below. US Base Pay Range $114,000—$157,000 USD Applicants must have the legal right to work in the country where the position is based, without the need for visa sponsorship. This role does not offer visa sponsorship. Wiz is an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. By submitting your application, you acknowledge that Wiz will process your personal data in accordance with Wiz's Privacy Policy. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4271744049/"
    },
    {
      "job_title": "Quantitative Analyst | $140/hr Remote",
      "company": "Crossing Hurdles",
      "description": "At Crossing Hurdles, we work as a referral partner. We refer candidates to our partner that collaborates with world’s leading AI research labs to build and train cutting edge AI models. Position: Mathematician Type: Hourly Contract Compensation: $70 $140/hour Location: Remote Duration: 5–6 weeks Commitment: 10–40 hours/week Role Responsibilities (Training support will be provided) Solve and evaluate advanced mathematics problems across multiple domains. Review AI generated solutions and proofs for rigor and correctness. Provide structured feedback to improve AI systems’ mathematical reasoning. Apply graduate level expertise to strengthen theorem based evaluations. Requirements Recent PhD in Mathematics (within the past 4 years) OR PhD candidate ≥2 years into program. Currently enrolled in or graduated from a Top 30 Mathematics program. Active in research/academia (or recently engaged within the last 4 years). Strong background in advanced problem solving, theorem application, and proof evaluation. Ability to articulate reasoning clearly and identify gaps in mathematical arguments. Application process: (Takes 20 min) Upload resume AI interview based on your resume (15 min) Submit form show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4323997685/"
    },
    {
      "job_title": "Senior Business Process Analyst",
      "company": "The Carrera Agency",
      "description": "Senior Process Analyst Transformation Initiative Start Date: November 7th 2025 Duration: 4 months Location: Remote (EST Preferred) Compensation: $60/hr+ W2 plus benefits (rate may vary based on experience and education) Exciting Opportunity Overview Join us for an impactful transformation journey as a **Senior Process Analyst**! We're seeking a dynamic professional to spearhead a high impact initiative focused on elevating process maturity, alignment, and execution across our organization. This is your chance to drive meaningful change through process design, optimization, and governance while supporting key enterprise priorities. This role offers the perfect blend of analytical challenge and leadership opportunity, where you'll guide cross functional teams through discovery, design, and implementation phases to deliver tangible business results. If you're passionate about process excellence and thrive in transformation environments, this engagement is designed for you! What You'll Do Lead a transformation workstream focused on process improvement, optimization, and governance Facilitate dynamic process discovery, design, and alignment sessions with business leaders and cross functional teams Map, assess, and redesign end to end business processes to enhance efficiency, scalability, and control Partner strategically with business and technology stakeholders to align process requirements with system and data capabilities Create and maintain comprehensive process maps, RACI charts, and standard operating procedures using industry leading tools such as Blueworks Live, Visio, or Lucidchart Identify high impact process improvement opportunities and dependencies that drive scalability, integration, and performance Collaborate with functional teams to define meaningful KPIs, dashboards, and success metrics for ongoing governance Deliver clear, actionable recommendations, detailed process documentation, and effective enablement materials Support change management activities to ensure successful adoption of new processes and ways of working What We're Looking For 7+ years of proven experience in business process analysis, process improvement, or business transformation Demonstrated ability to lead and facilitate engaging process design sessions and workshops across multiple functions Track record of successfully managing process engagements from discovery through implementation Strong foundation in BPMN, Lean, or Six Sigma** methodologies Proficiency in process documentation tools (Blueworks Live, Visio, Lucidchart, Miro, etc.) Exceptional stakeholder engagement and facilitation skills with the ability to influence and align diverse teams Outstanding analytical, communication, and presentation capabilities Experience thriving independently in fast paced, matrixed environments Bachelor's degree in Business, Operations, or related field Bonus: Mergers and acquisitions (M&A) experience preferred Plus: Certifications such as Lean Six Sigma, CBPA, or PMP Engagement Details This role centers on leading and delivering a comprehensive transformation project focused on process improvement, optimization, and governance. You'll leverage your strong facilitation, stakeholder alignment, and documentation expertise to ensure successful outcomes within the engagement timeframe. This is an excellent opportunity for extension or expansion based on project needs and performance, offering potential for continued impact and professional growth Apply today! show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4316628406/"
    },
    {
      "job_title": "Retail Analyst",
      "company": "Harvey Nash",
      "description": "Job Title : Retail Analyst Location : Orlando, Florida (Intial remote) Contract to hire role W2 ONLY Role We are seeking a Senior Analyst to support retail analytics initiatives across both theme parks and The Store e commerce division. This role will focus on delivering high impact business insights through data exploration, dashboard development, and analytical modeling to support areas such as merchandise planning, promotional performance, inventory health, and operational efficiency. The ideal candidate brings strong business acumen, retail expertise, and technical proficiency in SQL, Data Visualizations (e.g., Tableau), and Python (preferred). This role plays a critical part in transforming data into actionable insights that improve business performance, guest experience, and strategic outcomes across global retail footprint. Must Have: 1.) Recent Retail experience 2.) SQL 3.) Visualization Development / Tableau Preferred Qualifications • Advanced degree (MS or PhD) in Mathematics, Economics, Data Science, Computer Science, Operations Research, or related field. • Python for Analytics (3+ years): Proficiency in Python for data analysis (e.g., using pandas, NumPy, matplotlib); ability to support data preparation and light modeling tasks. • Knowledge of A/B testing concepts and basic statistical techniques. Recruiter Name: Divya Mishra Recruiter Email Id : divya.mishra@harveynash.com Equal Employment Opportunity show less",
      "date_posted": null,
      "location": "Florida, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319273094/"
    },
    {
      "job_title": "Reporting Design Analyst",
      "company": "Medasource",
      "description": "Responsibilities Establish quantitative metrics to measure success of system changes throughout Epic Refuel projects and report to leadership. Analyze dashboards of immediate data to establish baseline metrics, confirm anticipated outcomes, and measure success of outcomes following system optimizations. Identify information needed from dashboards and data to measure success of projects holistically. Pull data from dashboards, Tableau, and other technologies to provide reports of project success. Congregate data and effectively communicate end results to leadership across various departments affected. Establish effective methodology for capturing metrics across reports for measuring project success. Communicate with stakeholders and interview end users to identify what changes within the Epic system need to be made to be successful and what needs to be measured to drive success. Requirements Minimum 5 years of experience in Report Building and Analytics. Strong understanding of Revenue Cycle end to end. Strong understanding of and experience with Epic and within an Epic environment. Understanding of and/or certification within Epic Clarity, HB, or PB preferred. Strong Excel skills Experience with Tableau, Power BI or SQL preferred. Proven analytical and data skills needed to pull data, create reports, and present data findings and metrics. Education: Bachelor's degree, Master's degree preferred. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319243767/"
    },
    {
      "job_title": "Senior Systems Analyst, Enterprise Performance Management (EPM)",
      "company": "Crown Castle",
      "description": "Position Title: Senior Systems Analyst, Enterprise Performance Management (EPM) (P4) Company Summary Crown Castle is the nation’s largest provider of shared communications infrastructure: towers, small cells and fiber. It all works together to meet unprecedented demand—connecting people and communities and transforming the way we do business. Whenever you make a call, track a workout or stream music and videos, we’re the ones providing the communications infrastructure that makes it all possible. From 5G and the internet of things to drones, autonomous vehicles and AR/VR, we enable the technologies that help people stay safe, connected and ready for the future. Crown Castle is publicly traded on the New York Stock Exchange (CCI), is part of the S&P 500 and is one of the largest Real Estate Investment Trusts in the US. We offer a total benefits package and professional growth development for teammates in any stage of their career. Along with caring for our teammates, we’re an active member in the communities where we live, work and do business. We have a responsibility to give back, which we do through our Connected by Good program. Giving back allows us to improve public spaces where people connect, promote public safety and advance access to education and technology Role As Senior Analyst, you join a team responsible for managing and supporting the Enterprise Performance Management (EPM) technologies that will deliver leading finance practices and modern consolidation, account reconciliation, and data management capabilities to achieve digital and business goals. As an EPM leader, you will partner with digital and business leaders to drive value throughout the organization by optimizing our financial processes, enhancing decision making capabilities, and driving our business's financial success. Responsibilities EPM Solution Implementation: Lead the design, configuration, and implementation of EPM solutions to meet the organization's financial reporting and analysis needs. Participate in vendor analysis and selection. Financial Transformation: Collaborate with cross functional teams to identify opportunities for financial process improvement and transformation initiatives. Requirements Gathering: Work closely with business stakeholders to understand their financial reporting requirements and translate them into EPM system specifications. Data Integration: Manage data integration efforts to ensure seamless data flow between EPM systems and other financial applications and databases. Training and Documentation: Develop training materials and provide training sessions to end users to ensure efficient utilization of EPM tools. Financial Modeling: Build and maintain financial models for forecasting, budgeting, and scenario analysis. Quality Assurance: Conduct thorough testing and quality assurance to ensure the accuracy and reliability of EPM reports and data. Troubleshooting: Investigate and resolve technical issues, system errors, and user inquiries related to EPM systems. Best Practices: Stay current with industry best practices and emerging trends in EPM and financial analytics to provide recommendations for continuous improvement. Project Management: Provide accurate estimates of effort, help manage project timelines, budgets, and resources to ensure successful EPM system implementations. Communicates updates and escalates issues which may affect project success. Documentation: Maintain comprehensive documentation of EPM system configurations, processes, integrations, and workflows. Application Ownership: Continuously monitor and optimize EPM systems to enhance performance, usability, and reliability Continuous Improvement: Manage the ongoing vendor releases and work closely with business partners to ensure timely testing, issue resolution and release to the production environment Expectations Ability to effectively articulate technical challenges and solutions to technical teams and business users across multiple levels of the organization Work as part of a team of problem solvers, helping to solve complex business challenges from strategy to execution Disrupt, continuously improve, scale efficiencies, and evolve ways of working Demonstrate a strong sense of ownership, urgency, and drive as well as the ability to promote and encourage others to value difference when working in diverse teams Education/Certifications BS Degree in Engineering, Computer Science, Finance, Accounting, or other related technical discipline Certification in relevant technologies and EPM systems is a plus Certifications in relevant Finance & Accounting disciplines is a plus Experience/Minimum Requirements 8+ years’ experience leading implementations for Enterprise Performance Management (EPM) systems 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systems Functional domain knowledge in Finance: operating models and supporting organization structures, reporting, analysis, and process best practices EPM software experience such as Oracle Cloud EPM, Oracle Hyperion, SAP BPC, Anaplan, or similar platforms. Knowledge of data extraction/integration tools such as Oracle Integration Cloud, BICC, Visual Builder, Informatica Intelligent Data Management Cloud, SAP Integration Services or AWS Glue Solid scripting knowledge for writing consolidations, translation logic, business rules, data management, and EPM automation Development experience in building metadata, business rules, data reconciliation and others Exceptional analytical and problem solving skills. Excellent communication and collaboration abilities. Project management experience and familiarity with Agile methodologies. Working Conditions: This is a remote role with the expectation of on site/in person collaboration with teammates and stakeholders for moments that matter and may require up to 20% travel. The hiring range offered for this position is $106,400 146,200 annually. A candidate’s offer is determined by various factors including but not limited to, depth of experience, role related knowledge and skills, relevant education or training, internal alignment, and work location. Depending on the position offered, the compensation package may also include incentive compensation opportunities in the form of a discretionary annual cash bonus or commissions, and equity incentives. Employees (and their families) are eligible for medical, dental, vision, and basic life insurance. Employees are able to enroll in our company’s 401k plan. Employees will also receive a minimum of 18 days of paid time off each year and 12 paid holidays throughout the calendar year. If you are interested in joining our team, please visit the Crown Castle careers site (crowncastle.com/careers) to apply. We do not accept resumes from agencies, headhunters, or other third party suppliers who have not signed a formal agreement with us. This position will remain posted until filled. show less",
      "date_posted": null,
      "location": "Canonsburg, PA",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4248545299/"
    },
    {
      "job_title": "Conflicts Analyst",
      "company": "Hinckley Allen",
      "description": "Hinckley Allen is seeking a Conflicts Analyst with three to five years of previous experience in a conflicts or business intake department. Candidates should be proficient in reviewing existing client/matter data for potential conflict and business issue hits. This role will be responsible for analyzing the results to prepare a conflicts report and summary for the requesting attorney; and, under the direction of the Director of Conflicts, will assist with resolving potential issues that have been identified for new business and, possibly, lateral matters. Essential Duties and Responsibilities: Perform corporate research using an online database, along with general web searches, to determine corporate parents, affiliations, or other important relationships. Use proper search strategies in our firm’s internal database to conduct conflicts searches for new business, and possibly lateral, matters. Analyze and communicate conflicts search results to requesting attorneys, identifying any potential conflicts and business issues in a concise and comprehensive summary. Throughout running conflicts searches, assist with the ongoing maintenance of the firm’s database. Ability to work collaboratively and communicate effectively with the Director of Conflicts, other Conflicts team members, General Counsel, and firm attorneys. Provide information and answer general questions concerning the conflicts process from staff and attorneys. Assist with other assigned or required duties. Skills and Experience Required: Bachelor’s degree strongly preferred, with knowledge and experience in conflicts resolution 3 5 years of experience in a law firm conflicts or business intake department Experience using inTapp is strongly preferred, or a similar conflicts software Knowledge of professional responsibility and legal ethics rules Strong analytical and critical thinking skills with attention to detail Ability to work independently with minimal supervision, and effectively in a team environment Strong written and verbal communication Excellent customer service skills The salary range for this role is $65,000 $85,000, commensurate with experience and geographical location. Hinckley Allen is an equal opportunity employer and makes employment decisions without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4315856047/"
    },
    {
      "job_title": "System Analyst - Oracle ERP",
      "company": "BridgeView",
      "description": "SUMMARY Develop, implement, enhance, document, and support the organization’s most complex, multifaceted software applications, critical to the day to day functions. This position is responsible for serving as the primary contact between the vendor and business unit and will report to various levels of management across multiple divisions of the organization on the status of the systems, including any outstanding issues and successes. Primary system responsibilities include Oracle Enterprise Resource Planning (ERP), Oracle Enterprise Planning and Budgeting (EPBCS) and. Enterprise Data Management (EDM). LOCATION This role is only open to work from Colorado, Idaho, Iowa, Minnesota, Missouri, Montana, Nebraska, North Dakota, Oregon, South Dakota, Washington, or Wyoming. ESSENTIAL DUTIES & RESPONSIBILITIES: System Administration: Monitor ERP system health and performance, ensuring high availability and reliability Ensure the reliability, performance, and security of our Oracle ERP environment. Manage integrations between Oracle ERP and other enterprise systems (e.g., CRM, HRIS, financial platforms) Research, test, schedule and deploy upgrades and releases while adhering to documented change management process and procedures Create and maintain system documentation including desktop procedures, end user procedures, system diagrams, Service Level Agreements (SLAs), Business Continuity Planning (BCPs), disaster recovery plans, user access audits and test plans Analyze, evaluate, and recommend system changes, configuration and enhancements based on business requirements of critical processes and applications and expertise related to system construction and areas of efficiency Independently make decisions based on mastery knowledge level of supported applications and related business processes Lead meetings and deliver presentations to small and large groups of various levels of management across the organization Gather, interpret, and report system performance issues to vendor, business unit(s) and management and document performance trends Establish performance measures, goals, and objectives for the software based on the business requirements Implement and maintain security protocols, user roles, and access controls Develop, test, and execute scripts to translate business requirements into system enhancements. Access relevant system servers and databases to develop and maintain business requirements. Stay current with new ERP and EPM technologies and features and provide recommendations for process improvements and automation. Provide support and troubleshoot issues for ERP and EPM applications Provide technical guidance and training to internal teams and end users Work closely with Oracle support and vendors to resolve issues and implement best System Development: Collaborate with business stakeholders to gather requirements and translate them into functional specifications Develop reports and dashboards using ERP reporting tools, such as OTBI Ensure data quality, security, and privacy through data validation and access controls Develop and maintain workflows, automation, and data integrations using platform specific tools and APIs Customize and integrate third party applications and services into existing solutions. User Support and Training: Provide tier two help desk assistance to issues escalated from First Support on critical applications Provide subject matter expertise to assist in the development and delivery of training for end users Participate in system testing, user acceptance testing, and training Create user documentation, training materials, like how to guides to enable self service Assist System Administrator I, II and III team members with the process of converting business requirements into system requirements as needed Project Subject Matter Expert: Lead medium to large project efforts and independently support project work Understand in depth, the business requirements of critical applications while differentiating requirement vs. process. Convert business requirements into system requirements and maintain ongoing communication with the vendor Data Management: Understand, monitor, and maintain data integrations with source systems at an in depth level to ensure accurate and timely processing of financial and/or critical data Develop, maintain, and monitor data validation routines and understand the business impact of data exceptions or delays Develop, maintain, schedule, and monitor reports for end users Utilize SQL Developer to read and update PL/SQL scripts currently running on the EPM Automate server QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE Required: Bachelor's degree (B.A.) from a four year college or university and five or more (5+) years’ related experience and/or training; or equivalent combination of education and experience Four or more years’ experience working with Oracle ERP in a banking/financial services environment required Strong understanding of database design and integration Experience with bank applications and software administration experience Experience with Java (Java script, Groovy) SQL Programming experience and understanding of database concepts Preferred: Solid understanding of bank finance Understanding of PowerShell Experience administrating EPM applications and environments Oracle ERP and/or EPM certifications Experience with Enterprise Performance Reporting (EPRCS) and Financial Consolidations and Close (FCCS). show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318583425/"
    },
    {
      "job_title": "Data Analyst",
      "company": "Brooksource",
      "description": "Experienced data intelligence analyst with a project management background to support Solventum’s rebranding process. Primary responsibilities include: Supporting the Regulatory and Rebranding team’s data requirements to support a global rebranding project Identifying and leading data cleansing activities on critical regulatory data Defining and optimizing change management processes and tools between systems utilizing regulatory data Support governance activities to ensure change requests to data and systems align with requirements from global stakeholders in Regulatory, Quality, and Operations Identify requirements for integration between systems and for analytics team to optimize the rebranding processes Design, develop, test and publish ad hoc reports on Power BI as requested by the management team and provide analysis of these reports on data visualization tools. Conduct data reviews for technical gaps and collaborate with stakeholders to resolve them. Gain understanding of and continue to support data policies and procedures Leading data rule creation and Regulatory submission data analysis Skills Bachelor’s degree or higher (completed and verified prior to start) in computer science, engineering, statistics, business or finance from an accredited institution 3+ years of project management leadership Three years of work experience in data science, business analytics, business intelligence or comparable data intelligence field. Three years of experience with data visualization tools such as Power BI Preferred Qualifications: Master’s degree in computer science, Mathematics, Finance or Statistics. 5+ years of data analysis experience 1+ years of project management leadership 1+ years in MedTech industry Experience conducting large scale and complex data analysis to support business decision making 1+ years working with Regulatory Information Management systems or Regulatory Data Syndication 2+ years working on global projects Proficient understanding of Power BI, SQL, Python, Spreadsheet Modeling, machine learning models and AI workflow show less",
      "date_posted": null,
      "location": "Greater Minneapolis-St. Paul Area",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4318807425/"
    },
    {
      "job_title": "Business Analyst",
      "company": "Apex Systems",
      "description": "Apex Systems is currently hiring an Business Analyst to join a growing client that is 100% remote Duration: Long term, open ended contract Location: 100% Remote Pay range: $55 70/hr Are you a sharp, energetic Business Analyst with a passion for delivering polished, error free solutions? We're looking for a proactive Business Analyst who thrives in a fast paced environment and brings both business acumen and hands on testing expertise to the table. What You’ll Do: Lead requirements gathering workshops and collaborate closely with IT and business stakeholders Write clear, actionable business requirements and test scripts Take ownership of manual testing — from writing test cases in ALM to executing and documenting results Ensure seamless handoff of refined, high quality solutions to the business Maintain thorough documentation and support change management efforts Working with stakeholders to understand their needs related to financial processes (e.g., GL, AP, AR, Asset Accounting, Cost Center Accounting, Probability Analysis) and translating these into functional specifications for SAP. Identifying opportunities for process optimization and implementing improvements within the SAP finance landscape What You Bring: 5+ years of IT Business Analysis experience Experience leading requirements workshops with business stakeholders Experience with SAP, ideally within SAP S/4HANA is a plus! Strong manual testing experience Experience writing test cases Experience with HP ALM for testing Excellent communication and facilitation skills A self starter mindset — you don’t need hand holding Familiarity with Lean Six Sigma principles (a big plus!) Exposure to SAP CML, credit modules, or FICO/AP/AR processes is highly desirable Apply here or email an updated copy of your resume to Emily Pentico at epentico@apexsystems.com Apex Benefits Overview: Apex offers a range of supplemental benefits, including medical, dental, vision, life, disability, and other insurance plans that offer an optional layer of financial protection. We offer an ESPP (employee stock purchase program) and a 401K program which allows you to contribute typically within 30 days of starting, with a company match after 12 months of tenure. Apex also offers a HSA (Health Savings Account on the HDHP plan), a SupportLinc Employee Assistance Program (EAP) with up to 8 free counseling sessions, a corporate discount savings program and other discounts. In terms of professional development, Apex hosts an on demand training program, provides access to certification prep and a library of technical and leadership courses/books/seminars once you have 6+ months of tenure, and certification discounts and other perks to associations that include CompTIA and IIBA. Apex has a dedicated customer service team for our Consultants that can address questions around benefits and other resources, as well as a certified Career Coach. You can access a full list of our benefits, programs, support teams and resources within our ‘Welcome Packet’ as well, which an Apex team member can provide. EEO Employer Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystems.com or 844 463 6178. Apex Systems is a world class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico. show less",
      "date_posted": null,
      "location": "Colorado, United States",
      "remote": "Matches your job preferences, workplace type is Remote.",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4315509584/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4292533352/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4280250544/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4319091629/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4317152161/"
    },
    {
      "job_title": "-",
      "company": "-",
      "description": "-",
      "date_posted": null,
      "location": "-",
      "remote": "Onsite",
      "salary": "-",
      "job_url": "https://www.linkedin.com/jobs/view/4265713827/"
    }
  ]
}