{
  "metadata": {
    "job_title": "seo",
    "company": "studycom",
    "timestamp": "2024-12-31 11:42:13",
    "file_id": "16927"
  },
  "jobs": [
    {
      "job_title": "Director of SEO, Content",
      "company": "Study.com",
      "description": "Our mission is to open the door to the life changing impact of education and help make education accessible for all. As a nimble growth stage start up, we've emerged as the leading online education platform helping over 30 million learners and educators each month. Study.com has earned numerous awards and it has been recognized as one of the most transformational companies in EdTech, living up to our commitment to all learners: Breakthroughs Start Here. From students and educators in over 9,000 school districts that use Study.com, to working adults striving to complete their college degree or gain professional certifications, we empower them to reach their full potential. Our product is our impact! Across our college programs alone we have saved students over $200M in tuition and enabled tens of thousands to become nurses, teachers, accountants and more. Additionally, as part of our mission we’ve donated over $27 million across social impact programs to learners and educators. We are seeking a dynamic Director of SEO, Content to lead content SEO and marketing initiatives. This role will collaborate closely with Growth leaders on broader SEO and digital marketing strategy as well as learning content leaders. You’ll work closely with our business leaders and cross functional teams to develop and execute new content SEO and link building initiatives across our library of millions of learning resources. You’ll work at both a strategic and tactical level, turning data, research, and intuition into high quality, engaging content. This role is based in our Mountain View, CA office and is hybrid in office Mondays, Wednesdays, and Thursdays. What You’ll Do: Architect and implement a comprehensive SEO content strategy for Study.com, tailored to enhance content visibility and user engagement across all educational segments Spearhead the link building initiative, orchestrating content ideation, creation, and strategic outreach programs to bolster domain authority and rankings Lead global teams as a strategic visionary and hands on leader, diving into execution when needed while maintaining a long term perspective Direct and nurture content creation teams, streamlining workflows to boost productivity while foreseeing content needs and trends in education Proactively analyze and forecast SEO developments, identifying potential risks and opportunities to maintain our competitive edge in search rankings Design and implement content SEO strategy tailored to major segments like Test Prep and College, driving intentional search traffic to core products Drive the adoption of AI and other tools to identify and fill content gaps, optimize pages, and champion SEO Partner with cross functional teams to craft and refine content that supports growth objectives, reinforces brand identity, and achieves educational outcomes Continuously research and leverage educational and ed tech market trends What You’ll Bring To The Role: Minimum 10 years of experience leading distributed remote global teams, driving large volume educational or digital content development, preferably in the ed tech industry Minimum 5 years’ experience leading SEO in scaled digital content and managing off site SEO, building high quality links with innovative, engaging content Proven track record operating as a hands on manager and a strategic leader working with cross functional teams and leadership Expertise working with AI tools (e.g., ChatGPT) and developing ways to integrate those tools into content operations processes The salary range for this position is $150,000 $190,000 per year. Pay and is dependent upon factors including skills, work experience, business needs, and market demands. At Study.com, we know that strong communities are built on the power of our diversity, and we respect and strive to understand for the diverse identities, race, ethnicities, backgrounds, and perspectives of our team members. Our work and company culture have been consistently recognized, including: Inc. Best Place to Work Fortune Great Places to Work – Best Workplaces in the Bay Area Golden Bridge Awards – Gold Winner, Corporate Social Responsibility San Francisco Business Times & Silicon Valley Business Journal – Best Places to Work Study.com provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran or disability status. In addition to federal law requirements. Study.com complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. Additionally, qualified applicants with arrest and conviction records will be considered for the position in accordance with applicable state and local laws. show less",
      "date_posted": null,
      "location": "San Jose, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$150K/yr - $190K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4090166882/"
    },
    {
      "job_title": "Principal SEO Strategist",
      "company": "Demand.io",
      "description": "Quick overview Shape the future of e commerce search by combining deep technical SEO expertise with cutting edge AI innovation. As our Principal SEO Strategist, you'll leverage your strong technical foundation to pioneer new approaches for both traditional and emerging search platforms. This role is ideal for a technical SEO expert who is passionate about using AI to transform how we approach search optimization and discovery. The challenge We're looking for someone who can bridge deep technical SEO knowledge with emerging AI capabilities to solve complex challenges in search. You'll need to: Architect sophisticated technical SEO implementations that can scale across millions of pages Pioneer new approaches for AI driven search experiences and emerging platforms Use AI to accelerate and enhance traditional SEO workflows Design optimization strategies for conversational search and AI generated results Lead our adaptation to major algorithm updates and industry shifts Create frameworks for semantic search optimization Build predictive models for search performance across platforms About Demand.io Demand.io is revolutionizing e commerce through AI driven platforms powered by ShopGraph, our proprietary knowledge graph. Founded in 2009, we're profitable and growing rapidly with: SimplyCodes: AI and community powered savings platform covering 400,000+ stores Product.ai: AI shopping assistant redefining online purchasing ShopGraph: Comprehensive e commerce knowledge graph powering our platforms $1B+ annual e commerce transaction volume The opportunity Working directly with our founder and senior leadership, you'll: Drive technical SEO excellence while pioneering AI innovations in search Architect next generation approaches to search optimization Transform traditional SEO workflows through AI acceleration Shape our response to the evolution of search across platforms Lead technical implementation of sophisticated SEO strategies Build and mentor a forward thinking SEO team What you'll do First 30 days: Deep dive into our technical SEO infrastructure Analyze our current search presence across traditional and AI platforms Audit our technical optimization approaches Start developing AI enhanced SEO workflows First 60 days: Present comprehensive technical SEO strategy incorporating AI innovation Launch initial AI accelerated optimization processes Begin experimentation with emerging search platforms Establish frameworks for measuring success across channels First 6 months: Implement sophisticated technical SEO improvements at scale Drive measurable improvements in search performance Pioneer new approaches for emerging search platforms Build predictive models for search optimization Create scalable systems for technical SEO automation Demonstrate clear business impact through organic growth About you Must haves: 8+ years of technical SEO experience Deep expertise in technical SEO fundamentals: JavaScript rendering and optimization Core Web Vitals Schema markup and structured data Site architecture and crawlability Large scale SEO implementation Experience using AI to enhance SEO workflows Strong understanding of search algorithm dynamics Track record of driving significant organic growth Excellence in data analysis and experimentation Nice to haves: Experience with conversational search optimization Knowledge of emerging search platforms Background in e commerce optimization Familiarity with LLM behavior and optimization Experience with knowledge graphs Background in programming or engineering Our technical environment Tools you'll use: Advanced SEO and analytics platforms AI tools for workflow acceleration Natural language processing systems Multi platform search monitoring tools Knowledge graph management systems Custom internal tools and dashboards Modern web frameworks and technologies Development practices: AI accelerated workflows Continuous experimentation Data driven decision making Rapid prototyping and testing Growth opportunity As a key leader at Demand.io, you'll have: Opportunity to define the future of AI driven search Access to cutting edge AI tools and technologies Clear path to building and leading a team Significant impact on company strategy Platform to pioneer new search approaches Our engineering culture Deep generalists who solve hard problems Strong bias towards action and shipping Minimize process and maximize impact Collaborate closely across teams Work primarily from our Santa Monica office Invest heavily in learning and growth Creating wealth through innovation We've reimagined tech compensation for elite talent. Unlike traditional tech compensation heavily weighted toward RSUs or illiquid equity, we provide substantial immediate wealth creation through monthly cash payments. Foundation: Base: $160,000 $220,000 Equity: 0.2% 0.5% Partners Program: Substantial monthly profit sharing bonuses Top performers achieve total compensation of $300,000 $500,000+ annually through our unique Partners Program. Key advantages: Monthly cash payments (not annual or deferred bonuses) Immediate wealth creation (vs locked RSUs) Uncapped earning potential No lockup periods or liquidity events required Increasing bonus percentages as you advance through Partner levels Additional benefits: Partners Program with uncapped earning potential Learning stipend for conferences and courses Access to cutting edge AI tools and research 100% coverage of health benefits for you and dependents Unlimited PTO Generous parental leave 401(k) program Catered lunches in our Santa Monica office Relocation assistance available Ready to combine technical SEO expertise with AI innovation? If you're excited about leveraging deep technical SEO knowledge to pioneer new approaches to search while using AI to transform how we work, we want to hear from you. Learn more about our products, our team, and our unique culture at Demand.io. show less",
      "date_posted": null,
      "location": "Los Angeles Metropolitan Area",
      "remote": "Lead SEO & Web Development Specialist -Remote with verification",
      "salary": "$160K/yr - $220K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4108184888/"
    },
    {
      "job_title": "Senior Product Director, SEO",
      "company": "Dow Jones",
      "description": "About Our Organization Dow Jones is a global provider of news and business information, delivering content to consumers and organizations around the world across multiple formats, including print, digital, mobile and live events. Dow Jones has produced unrivaled quality content for more than 130 years and today has one of the world’s largest news gathering operations globally. It is home to leading publications and products including the flagship Wall Street Journal, America’s largest newspaper by paid circulation; Barron’s, MarketWatch, Mansion Global, Financial News, Investor’s Business Daily, Factiva, Dow Jones Risk & Compliance, Dow Jones Newswires, OPIS and Chemical Market Analytics. Dow Jones is a division of News Corp (Nasdaq: NWS, NWSA; ASX: NWS, NWSLV). About the Team: Our Technology team drives the evolution of our Technology, Engineering, Data, Product and User Experience functions. With a keen focus on delivering cutting edge solutions, we shape the digital landscape for our customers, readers, and users. From revolutionizing visuals to optimizing tools and harnessing the power of data, mobile, video, and social platforms, our team is committed to providing a seamless and immersive experience across all touchpoints. Collaborating closely with our newsrooms and strategic partners, we spearhead the development of groundbreaking products and technologies. About the Role: Dow Jones is seeking an experienced and strategic Senior Product Director of SEO to lead the development and execution of our SEO roadmap. In this senior role, you will oversee the optimization and evolution of our SEO strategy, ensuring we continuously grow organic traffic, improve rankings, and expand our acquisition funnel. You will collaborate closely with cross functional teams including our newsrooms, marketing, engineering, and analytics team to drive innovative SEO solutions and impact. As a leader in the engineering team, you will be involved in every aspect of the product development process, from brainstorming and ideation to production launch and on going development. You will work closely with an engineering organization ensuring initiatives launch within scope, on time, with measurable impact. You Will Develop and execute a long term SEO product strategy that aligns with business objectives across multiple properties. Stay ahead of industry trends, algorithm changes, and SEO best practices to ensure our strategies are future proof. Partner with Engineering, Design, Editorial, and Marketing teams to implement SEO strategies that optimize site architecture, content, and overall search visibility. Act as the product owner for all SEO related tools and features, managing product lifecycle from ideation to launch. Facilitate open communication and alignment between departments to ensure a cohesive SEO roadmap. Leverage analytics, performance metrics, and A/B testing to refine SEO strategies and prioritize high impact initiatives. Define and track key SEO metrics (traffic, rankings, conversions, etc.) and present regular performance reports to leadership teams. Use competitive analysis and market research to identify opportunities and gaps in SEO performance. Foster a culture of innovation, continuous learning, and proactive problem solving within the team. Own the product vision and roadmap for SEO related features, tools, and platforms. Work with the engineering team to ensure SEO considerations are integrated into the architecture and systems. Prioritize and manage a backlog of SEO related enhancements, ensuring timely and efficient delivery of initiatives. You Have 7+ years of SEO experience, with at least 3+ years in a leadership role managing teams and SEO product strategy. Proven experience in product management or product ownership within an SEO or digital marketing context. Deep understanding of SEO best practices, search algorithms, and the technical elements of SEO (crawling, indexing, sitemaps, etc.). Strong analytical mindset with the ability to use data to make informed decisions and track SEO success. Experience with SEO tools such as Google Search Console, SEMrush, Ahrefs, News Dashboard, Screaming Frog, or similar. Excellent communication and collaboration skills, with the ability to work cross functionally and influence stakeholders. Experience managing large scale SEO efforts across complex digital ecosystems (e commerce, SaaS, or similar industries is a plus). Familiarity with web development languages (HTML, CSS, JavaScript) is a plus. Demonstrated success in driving SEO growth for large scale websites or platforms. Familiarity with Agile methodologies and working in fast paced, iterative development environments. Experience working in media is a plus. Our Benefits Comprehensive Healthcare Plans Paid Time Off Retirement Plans Comprehensive Insurance Plans Lifestyle programs & Wellness Resources Education Benefits Family Care Benefits & Caregiving Support Commuter Transit Program Subscription Discounts Employee Referral Program Learn More About All Our US Benefits Reasonable accommodation: Dow Jones, Making Careers Newsworthy We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. EEO/AA/M/F/Disabled/Vets. Dow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, email us at talentresourceteam@dowjones.com. Please put \"Reasonable Accommodation\" in the subject line and provide a brief description of the type of assistance you need. This inbox will not be monitored for application status updates. Business Area: Dow Jones Technology Job Category: Software Product Engineering Union Status Non Union role Pay Range: 205000 250000 We recognize that attracting the best talent is key to our strategy and success as a company.As a result, we aim for flexibility in structuring competitive compensation offers to ensure we are able to attract the best candidates.The quoted salary range represents our good faith estimate as to what our ideal candidates are likely to expect, and we tailor our offers within the range based on the selected candidate's experience, industry knowledge, location, technical and communication skills, and other factors that may prove relevant during the interview process. Pay for performance is a key element in our strategy to attract, engage, and motivate talented people to do their best work. Similarly to salary, for bonus eligible roles, targets are set based on a variety of factors including competitive market practice. For benefits eligible roles, in addition to cash compensation, the company provides a comprehensive and highly competitive benefits package, with a variety of physical health, retirement and savings, caregiving, emotional wellbeing, transportation, and other benefits, including \"elective\" benefits employees may select to best fit the needs and personal situations of our diverse workforce.. Since 1882, Dow Jones has been finding new ways to bring information to the world’s top business entities. Beginning as a niche news agency in an obscure Wall Street basement, Dow Jones has grown to be a worldwide news and information powerhouse, with prestigious brands including The Wall Street Journal, Dow Jones Newswires, Factiva, Barron’s, MarketWatch and Financial News. This longevity and success is due to a relentless pursuit of accuracy, depth and innovation, enhanced by the wisdom of past experience and a solid grasp on the future ahead. More than its individual brands, Dow Jones is a modern gateway to intelligence, with innovative technology, advanced data feeds, integrated solutions, expert research, award winning journalism and customizable apps and delivery systems to bring the information that matters most to customers, when and where they need it, every day. Req ID: 44141 show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$205K/yr - $250K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4086490217/"
    },
    {
      "job_title": "Lead Software Engineer, Web/SEO",
      "company": "Dow Jones",
      "description": "About Our Organization Dow Jones is a global provider of news and business information, delivering content to consumers and organizations around the world across multiple formats, including print, digital, mobile and live events. Dow Jones has produced unrivaled quality content for more than 130 years and today has one of the world's largest news gathering operations globally. It is home to leading publications and products including the flagship Wall Street Journal, America's largest newspaper by paid circulation; Barron's, MarketWatch, Mansion Global, Financial News, Investor's Business Daily, Factiva, Dow Jones Risk & Compliance, Dow Jones Newswires, OPIS and Chemical Market Analytics. Dow Jones is a division of News Corp (Nasdaq: NWS, NWSA; ASX: NWS, NWSLV). About The Team Our Technology team drives the evolution of our Technology, Engineering, Data, Product and User Experience functions. With a keen focus on delivering cutting edge solutions, we shape the digital landscape for our customers, readers, and users. From revolutionizing visuals to optimizing tools and harnessing the power of data, mobile, video, and social platforms, our team is committed to providing a seamless and immersive experience across all touchpoints. Collaborating closely with our newsrooms and strategic partners, we spearhead the development of groundbreaking products and technologies. About The Role The Lead Software Engineer, Web/SEO will work within a Web Platforms team and work across the Dow Jones organization to improve SEO best practices and application performance. This role will report directly to the Director of Consumer Technology. It is a hybrid position based in our NYC office You Will Architect, develop, test, and deploy web applications for Dow Jones publications (WSJ, Barron's, MarketWatch, etc). Contribute to the technical aspects of SEO, including website architecture, URL structures, meta tags, schema markup, and site speed optimization Develop and enforce SEO best practices and guidelines for the team, ensuring consistency and quality across all SEO efforts. You Have A deep understanding of modern web technologies React.Js, Next.Js, Node.Js, HTML5, CSS3, Javascript (ES6+), Typescript, etc In depth knowledge of search engine algorithms, ranking factors, and SEO best practices. Understanding of performance optimization techniques and tools (e.g., Lighthouse, WebPageTest) A strong technical foundation and experience building user interfaces and single page applications. Experience writing internal documentation and system flow charts to keep the team informed. 5+ years of experience working in a production environment; shipping code with regularity Experience with version control systems (e.g., Git) and collaborative development workflows. Strong interpersonal skills to effectively collaborate cross functionally with designers, product managers, engineers, QA and operations. Our Benefits Comprehensive Healthcare Plans Paid Time Off Retirement Plans Comprehensive Insurance Plans Lifestyle programs & Wellness Resources Education Benefits Family Care Benefits & Caregiving Support Commuter Transit Program Subscription Discounts Employee Referral Program Learn More About All Our US Benefits \\ Reasonable accommodation: Dow Jones, Making Careers Newsworthy We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. EEO/AA/M/F/Disabled/Vets. Dow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, email us at talentresourceteam@dowjones.com. Please put \"Reasonable Accommodation\" in the subject line and provide a brief description of the type of assistance you need. This inbox will not be monitored for application status updates. Business Area: Dow Jones Technology Job Category: Software Product Engineering Union Status Union role Pay Range: $130,000 $160,000 We recognize that attracting the best talent is key to our strategy and success as a company.As a result, we aim for flexibility in structuring competitive compensation offers to ensure we are able to attract the best candidates.The quoted salary range represents our good faith estimate as to what our ideal candidates are likely to expect, and we tailor our offers within the range based on the selected candidate's experience, industry knowledge, location, technical and communication skills, and other factors that may prove relevant during the interview process. Pay for performance is a key element in our strategy to attract, engage, and motivate talented people to do their best work. Similarly to salary, for bonus eligible roles, targets are set based on a variety of factors including competitive market practice. For benefits eligible roles, in addition to cash compensation, the company provides a comprehensive and highly competitive benefits package, with a variety of physical health, retirement and savings, caregiving, emotional wellbeing, transportation, and other benefits, including \"elective\" benefits employees may select to best fit the needs and personal situations of our diverse workforce.. Since 1882, Dow Jones has been finding new ways to bring information to the world’s top business entities. Beginning as a niche news agency in an obscure Wall Street basement, Dow Jones has grown to be a worldwide news and information powerhouse, with prestigious brands including The Wall Street Journal, Dow Jones Newswires, Factiva, Barron’s, MarketWatch and Financial News. This longevity and success is due to a relentless pursuit of accuracy, depth and innovation, enhanced by the wisdom of past experience and a solid grasp on the future ahead. More than its individual brands, Dow Jones is a modern gateway to intelligence, with innovative technology, advanced data feeds, integrated solutions, expert research, award winning journalism and customizable apps and delivery systems to bring the information that matters most to customers, when and where they need it, every day. Req ID: 42884 show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Onsite",
      "salary": "$130K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4085678549/"
    },
    {
      "job_title": "Lead Counsel 2 - Digital Advertising & SEO Optimization",
      "company": "Citi",
      "description": "The Lead Counsel 2 is a senior level position responsible for providing Citi businesses and functions with legal counsel and thought leadership on all matters related to digital advertising and search engine optimization (SEO). The overall objective of this role is to provide legal support, advice, and guidance across a broad range of practice areas in coordination with the Legal team. This role requires a pragmatic, proactive attorney with thorough understanding of digital advertising and SEO, combined with a solid conceptual / practical grounding in the laws and regulations for the geographies in which we operate. Provides input into strategic decisions, exercising sound legal judgement to develop proactive, risk appropriate, and commercially business oriented solutions. Responsibilities: Responsible for providing Citi businesses and functions with legal counsel; supporting strategic initiatives and product/service launches, providing subject matter expertise and interpretations of relevant laws, rules, regulations, and industry practices, and advising business management/leadership on all manners of legal matters related to digital advertising and SEO. Partners with legal peers to objectively evaluate digital advertising and SEO business decisions by applying institutional knowledge against industry standard, widely accepted business practices, laws, rules, and regulatory guidelines, escalating as appropriate Collaborates across internal lines of business, control/support functions and/or external counsel to achieve coordinated and efficient outcomes on matters related to digital advertising and SEO; coordinates closely with legal peers aligned to associated businesses Participates in planning and development initiatives; contributes to objectives by providing thought leadership using knowledge of industry, laws, and regulations Proactively identifies, evaluates, and contributes to the appropriate management of legal, regulatory, and reputational risk by collaborating with ICRM & Risk, following relevant legal developments, participating in internal projects, escalating where appropriate Manages day to day legal activities as a subject matter expert in area of responsibility and provide advisory services to business partners Monitor management of complex legal issues and transactions, escalating when necessary Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency, as well as effectively supervise the activity of others and create accountability with those who fail to maintain these standards Qualifications: 6 10 years of relevant industry experience, preferably in financial services Banking or financial industry experience, including laws related to banking regulations Comprehensive knowledge of international laws, regulations and practices while staying abreast of regulatory and legal environment, internal policies and industry trends that impact the business Experience with complex deals, demonstrated ability to analyze issues and develop legal solutions Effective communication and negotiation skills and ability to build and maintain trusted relationships Excellent leadership, interpersonal, organizational and relationship management skills Proven ability to apply sound judgement while managing assignments in a demanding, fast paced environment Bar license in good standing to practice law Education: Juris Doctorate or equivalent law degree Knowledge of SEO principles, tools, and experience SEO and/or understanding of digital marketing strategies, including content creation and keyword research a plus. Job Family Group: Legal Job Family: Legal Enterprise Time Type: Full time Primary Location: Irving Texas United States Primary Location Full Time Salary Range: $155,280.00 $232,920.00 In addition to salary, Citi’s offerings may also include, for eligible employees, discretionary and formulaic incentive and retention awards. Citi offers competitive employee benefits, including: medical, dental & vision coverage; 401(k); life, accident, and disability insurance; and wellness programs. Citi also offers paid time off packages, including planned time off (vacation), unplanned time off (sick leave), and paid holidays. For additional information regarding Citi employee benefits, please visit citibenefits.com. Available offerings may vary by jurisdiction, job level, and date of hire. Anticipated Posting Close Date: Nov 06, 2024 Citi is an equal opportunity and affirmative action employer. Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi. View the \"EEO is the Law\" poster. View the EEO is the Law Supplement. View the EEO Policy Statement. View the Pay Transparency Posting show less",
      "date_posted": null,
      "location": "Irving, TX",
      "remote": "Onsite",
      "salary": "$155.3K/yr - $232.9K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4062795229/"
    },
    {
      "job_title": "Lead Counsel 2 - Digital Advertising & SEO Optimization",
      "company": "Citi",
      "description": "The Lead Counsel 2 is a senior level position responsible for providing Citi businesses and functions with legal counsel and thought leadership on all matters related to digital advertising and search engine optimization (SEO). The overall objective of this role is to provide legal support, advice, and guidance across a broad range of practice areas in coordination with the Legal team. This role requires a pragmatic, proactive attorney with thorough understanding of digital advertising and SEO, combined with a solid conceptual / practical grounding in the laws and regulations for the geographies in which we operate. Provides input into strategic decisions, exercising sound legal judgement to develop proactive, risk appropriate, and commercially business oriented solutions. Responsibilities: Responsible for providing Citi businesses and functions with legal counsel; supporting strategic initiatives and product/service launches, providing subject matter expertise and interpretations of relevant laws, rules, regulations, and industry practices, and advising business management/leadership on all manners of legal matters related to digital advertising and SEO. Partners with legal peers to objectively evaluate digital advertising and SEO business decisions by applying institutional knowledge against industry standard, widely accepted business practices, laws, rules, and regulatory guidelines, escalating as appropriate Collaborates across internal lines of business, control/support functions and/or external counsel to achieve coordinated and efficient outcomes on matters related to digital advertising and SEO; coordinates closely with legal peers aligned to associated businesses Participates in planning and development initiatives; contributes to objectives by providing thought leadership using knowledge of industry, laws, and regulations Proactively identifies, evaluates, and contributes to the appropriate management of legal, regulatory, and reputational risk by collaborating with ICRM & Risk, following relevant legal developments, participating in internal projects, escalating where appropriate Manages day to day legal activities as a subject matter expert in area of responsibility and provide advisory services to business partners Monitor management of complex legal issues and transactions, escalating when necessary Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency, as well as effectively supervise the activity of others and create accountability with those who fail to maintain these standards Qualifications: 6 10 years of relevant industry experience, preferably in financial services Banking or financial industry experience, including laws related to banking regulations Comprehensive knowledge of international laws, regulations and practices while staying abreast of regulatory and legal environment, internal policies and industry trends that impact the business Experience with complex deals, demonstrated ability to analyze issues and develop legal solutions Effective communication and negotiation skills and ability to build and maintain trusted relationships Excellent leadership, interpersonal, organizational and relationship management skills Proven ability to apply sound judgement while managing assignments in a demanding, fast paced environment Bar license in good standing to practice law Education: Juris Doctorate or equivalent law degree Knowledge of SEO principles, tools, and experience SEO and/or understanding of digital marketing strategies, including content creation and keyword research a plus. Job Family Group: Legal Job Family: Legal Enterprise Time Type: Full time Primary Location: Irving Texas United States Primary Location Full Time Salary Range: $155,280.00 $232,920.00 In addition to salary, Citi’s offerings may also include, for eligible employees, discretionary and formulaic incentive and retention awards. Citi offers competitive employee benefits, including: medical, dental & vision coverage; 401(k); life, accident, and disability insurance; and wellness programs. Citi also offers paid time off packages, including planned time off (vacation), unplanned time off (sick leave), and paid holidays. For additional information regarding Citi employee benefits, please visit citibenefits.com. Available offerings may vary by jurisdiction, job level, and date of hire. Anticipated Posting Close Date: Nov 06, 2024 Citi is an equal opportunity and affirmative action employer. Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi. View the \"EEO is the Law\" poster. View the EEO is the Law Supplement. View the EEO Policy Statement. View the Pay Transparency Posting show less",
      "date_posted": null,
      "location": "Irving, TX",
      "remote": "Onsite",
      "salary": "$155.3K/yr - $232.9K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4062792420/"
    },
    {
      "job_title": "Senior Data Scientist, SEO",
      "company": "Etsy",
      "description": "Company Description Etsy is the global marketplace for unique and creative goods. We build, power, and evolve the tools and technologies that connect millions of entrepreneurs with millions of buyers around the world. As an Etsy Inc. employee, whether a team member of Etsy, Reverb, or Depop, you will tackle unique, meaningful, and large scale problems alongside passionate coworkers, all the while making a rewarding impact and Keeping Commerce Human. Salary Range $136,000.00 $176,000.00 What's the role? We are looking for a Senior Data Scientist to join our Marketing Analytics team in Brooklyn supporting Etsy’s SEO program! This is a full time position reporting to the Sr Manager, Analytics. In addition to salary, you will also be eligible for an equity package, an annual performance bonus, and our competitive benefits that support you and your family as part of your total rewards package at Etsy. This role requires your presence in Etsy’s Brooklyn Office once or twice per week depending on your proximity to the office. Candidates living within commutable distance of Etsy’s Brooklyn Office Hub may be the first to be considered. Learn more details about our work modes and workplace safety policies here. What’s this team like at Etsy? The Marketing Analytics team helps drive the success of marketing efforts at Etsy by providing meaningful insights, industry leading measurement techniques, and access to the metrics, data, and tools needed for decision making and optimization. Our mission is to demystify marketing with insights grounded in data, telling the story of how we attract and retain our users to teams, to senior management, and to the community. We partner with our peers in marketing, analytics, research, product, engineering, and finance through all stages of development: identifying initial opportunities, refining the user experience, analyzing the impact of our efforts, and highlighting improvement areas. Ultimately, the team’s work strengthens Etsy and helps continuously improve the Etsy experience. As a key member of the Marketing Analytics team, you will focus on supporting Etsy’s SEO efforts to help grow organic search traffic, optimize search engine visibility, and deliver meaningful value to our buyers and sellers. This position will heavily focus on running a structured learning agenda, developing predictive models, and building proprietary tools and services to advance Etsy’s SEO program. Learning new skills and techniques is not only a requirement but a perk of the job. We are always looking for opportunities to improve. Our mission is to demystify marketing with insights grounded in data, telling the story of how we attract and retain our users to teams, to senior management, and to the community. What does the day to day look like? Use rigorous, transparent analytical methods and experimentation to contribute to the strategy and execution of Etsy’s SEO program. Design and analyze experiments based on sound statistical theory, help teams set great hypotheses, and deliver robust analysis of experiment results. Conduct and lead deep analysis of SEO performance, synthesize the learnings and communicate next steps/action plans to turn insight into results. Apply advanced models to improve page quality, customer experience, and team efficiency. Collaborate with Product, Engineering, and Machine Learning teams to productionize models, influencing roadmaps, and securing resources for the teams’ needs. Raise the skill level of the entire analytics team through the creation of exemplary work, mentorship, and the introduction of better practices, processes, and tools. Stay informed about leading analytical technologies and techniques, working these methods into relevant workstreams and coaching analysts as they learn new methods. Of course, this is just a sample of the kinds of work this role will require! You should assume that your role will encompass other tasks, too, and that your job duties and responsibilities may change from time to time at Etsy's discretion, or otherwise applicable with local law. Qualities that will help you thrive in this role are: 4+ years experience as a data scientist or data analyst in which you have extracted meaning from big data sets with little engineering support. 2+ years of hands on SEO experience, ideally for large scale platforms or marketplaces. Mastery of SQL (experience with BigQuery preferred), are proficient in R/Python and other scripting/automation techniques. Bonus points for experience with Looker, Looker Studio or other data visualization software. Expertise in statistical analysis and advanced methods, such as Propensity Score Matching, Causal Impact, and Regression Models. Experience with designing and evaluating SEO experiments with sound statistical rigor, helping teams set strong hypotheses and interpret results. Comfortable communicating technical findings clearly and effectively to both technical and non technical stakeholders. Passion for creating scalable, reproducible analysis frameworks and mentoring peers to elevate the overall analytics skillset. Strong problem solver who thrives on tackling complex challenges in collaboration with others. Additional Information What's Next If you're interested in joining the team at Etsy, please share your resume with us and feel free to include a cover letter if you'd like. As we hope you've seen already, Etsy is a place that values individuality and variety. We don't want you to be like everyone else we want you to be like you! So tell us what you're all about. Our Promise At Etsy, we believe that a diverse, equitable and inclusive workplace furthers relevance, resilience, and longevity. We encourage people from all backgrounds, ages, abilities, and experiences to apply. Etsy is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If, due to a disability, you need an accommodation during any part of the interview process, please let your recruiter know. While Etsy supports visa sponsorship, sponsorship opportunities may be limited to certain roles and skills. show less",
      "date_posted": null,
      "location": "Brooklyn, NY",
      "remote": "Data Science Lead (Remote)",
      "salary": "$136K/yr - $176K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4092395932/"
    },
    {
      "job_title": "Sr. Decision Scientist, SEO",
      "company": "ZipRecruiter",
      "description": "We offer a hybrid work environment. Most US based positions can also be performed remotely (any exceptions will be noted in the Minimum Qualifications below.) Our Mission: To actively connect people to their next great opportunity. Who We Are: ZipRecruiter is a leading online employment marketplace. Powered by AI driven smart matching technology, the company actively connects job seekers with millions of businesses of all sizes through innovative mobile app, web, and email services, as well as partnerships with the best job sites on the web. ZipRecruiter has the #1 rated job search app on iOS & Android. Summary: We are seeking a Senior Decision Scientist with extensive hands on experience with SEO to join our team. The ideal candidate will leverage data driven insights to enhance our SEO strategy, improve website visibility, and drive organic traffic. You will collaborate closely with product management, engineering, and design to drive the development, prioritization, and planning of the product roadmap. Key Focuses: Descriptive Analysis: Utilize descriptive analysis to uncover insights related to user behavior. Monitor and report on SEO performance metrics. Keyword Research: Conduct keyword research and competitive analysis to identify opportunities for optimization and SEO content creation. Experimentation: Design and analyze A/B tests to evaluate the impact of SEO initiatives on user engagement and conversion. Data Visualization: Create dashboards and visualizations to communicate findings and recommendations to stakeholders effectively. Predictive Modeling: Building models to forecast future SEO performance, identify trends, and inform content and marketing strategies. Minimum Qualifications: Bachelor's degree in a quantitative field such as mathematics, computer science, statistics, or economics (or equivalent experience) 4+ years of product analytics experience Minimum of 1 year of experience in SEO analytics Experience designing experiments, testing, and utilizing statistical principles to inform business decisions Proficient in statistical computing and scripting languages such as Python, R, SQL Preferred Qualifications: Master’s or Ph.D. in a quantitative field such as mathematics, computer science, operations research, economics In depth knowledge and hands on experience in various areas, including probability and statistics theory, causal inference, experimental design and analysis, synthetic control, product ecosystems, and Bayesian inference Experience in product analytics with a focus on user acquisition The US base salary range for this full time position is $145,000 $177,500. Our salary ranges are determined by role, level, and location, and the range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location, role related knowledge and skills, depth of experience, relevant education or training, and additional role related considerations. Depending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits. ZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics. Privacy Notice: For information about ZipRecruiter's collection and processing of job applicant personal data for this job, please see our Privacy Notice at: https://www.ziprecruiter.com/careers/job applicant privacy notice show less",
      "date_posted": null,
      "location": "Santa Monica, CA",
      "remote": "Remote",
      "salary": "$145K/yr - $177.5K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4082605584/"
    },
    {
      "job_title": "SEO Strategist",
      "company": "Verizon",
      "description": "When you join Verizon You want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere & always. Want in? Join the V Team Life. What You’ll Be Doing... The Verizon Consumer Group is looking for a passionate SEO Strategist to join our growing and dynamic team. The role would be supporting the consumer home internet business by optimizing site experiences including on page, technical, and off page strategies and tactics. In addition to a deep understanding of all aspects of search engine optimization, the position also requires partnership across several marketing, design, and development teams to ensure search is at the forefront of the website strategy. The ideal candidate should be a data first marketer, who is comfortable supporting the creation and execution of large scale strategic initiatives for verizon.com. This is a rare opportunity to help pave the digital future for an innovative and integral brand. Responsibilities Include Supporting cohesive, compelling SEO strategies that guide the development & content processes. This may include site crawls, content audits, linking strategies, redirect mapping, local, and data analysis of site performance. Providing actionable insights for site improvement based on data and competitive gap analysis. Measuring and reporting out on the effectiveness of organic and marketing strategies and performance. Performing keyword research and on page optimizations for key marketing landing pages, articles, and ecommerce pages. Communicating strategic visions to internal stakeholders and partnering across business units, including merchandising, design, development, and IT teams. Managing product and project launches across the organization, including creating tickets, performing QAs, and keeping track of several fast moving pieces. Establishing and promoting SEO guidelines, best practices, and standards across business units, as well as expanding relationship with paid search for holistic search opportunities. Maintaining expert level understanding of latest industry trends, guidelines, and algorithm changes including AI, SGE, Helpful Content Updates, and more. What We’re Looking For You’ll need to have: Bachelor’s degree or four or more years of work experience. Four or more years of relevant experience required, demonstrated through work experience and/or military experience. Experience creating, presenting, and managing multiple SEO data and analysis projects at once. Experience with SEO tools to inform SEO strategy including but not limited to Google Sheets, Google Search Console, Adobe Analytics (Omniture), Looker Studio (Google Data Studio), SEMRush, SimilarWebPro, Ahrefs, Botify, and Screaming Frog. Experience communicating the value Search, Branding, Content, and IA have on KPIs and business drivers. Experience in measurement of both organic and paid search data. Even Better If You Have Marketing/agency/consultative services experience in SEO. Strong written and verbal communication skills, including email, presentations, and slide decks. If Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above. Where you’ll be working In this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager. Scheduled Weekly Hours 40 Equal Employment Opportunity We’re proud to be an equal opportunity employer and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more. Our benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award winning total rewards package. For part timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances. If you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $89,000.00 and $166,000.00 annually based on a full time schedule. The salary will vary depending on your location and confirmed job related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours. show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Lead SEO & Web Development Specialist -Remote with verification",
      "salary": "$89K/yr - $166K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4099345465/"
    },
    {
      "job_title": "VP, Search Engine Optimization (SEO)",
      "company": "Citi",
      "description": "Position Summary The U.S. Personal Bank delivers a wide array of banking, payments, lending and investment services to individual consumers and small businesses. To deliver on our brand promise, we must operate as a truly client centric organization, driving a high tech, high touch experience for the full Citi relationship, particularly in the U.S. To do so, we have aligned our structure with our strategy to ensure we win in the U.S., our largest market, and drive greater client centricity across product, segment, and geography. Marketing & Franchise Development team is focused on Digital Acquisitions and Digital Sales transformation while enabling next gen existing customer evolution. We are seeking a senior level SEO specialist to join our team. The SEO Specialist will own the execution roadmap for the company’s organic growth, across Cards, Retail Banking, Lending, Investing and Wealth management strategy. This is an exciting opportunity for a seasoned professional in SEO space to drive forward the organic growth of Citi and take the business into the future amidst the rise of Gen AI and a continuously evolving search. Responsibilities Develop and implement SEO strategies that align with Marketing goals and Product roadmaps. Lead and own the SEO scorecard KPIs that Citi will use to define end state success while leading with a Performance Marketing mindset. Lead concurrent SEO initiatives focused across three pillars, Content, Keywords and Technical SEO. Conduct keyword research to identify the most relevant and popular keywords for the company's target audience focusing on Non Branded and Branded keywords. Optimize existing website content for search engines, including title tags, meta descriptions, and headers. Enhance content across Lines of Business/Products to maximize opportunities for indexing, ranking, click through and conversion. Build SEO reports and dashboards that will be shared across the organization. Collaborate with 3rd party SEO vendors as it pertains to the Enterprise SEO toolkit. Work directly with Product partners and Legal to plan & implement SEO strategies that align with internal KPIs and marketing goals. Assists with audits of site, QA of digital properties to ensure proper construction/ maximized visibility. Analyze online financial ecosystem, search engine results to identify competitive SEO opportunities within each Product line. Provide thought leadership as it relates to the growth of SEO at Citi. Maintain a close partnership and high level of synergy with Product, Technology, Operations, and Legal partners among others to progress overall objectives. Qualifications 6+ years of proven SEO experience in optimizing technically complex websites across Financial services, eCommerce companies. Understanding of technical SEO skills, including ability to evaluate HTML and JavaScript for SEO purposes and make recommendations. Experience with SEMRush, Ahrefs, Google Keyword Planner, Google Search Console, and other SEO Tools. Experience with Adobe Analytics to ensure end 2 end funnel conversion tracking and Jira, Confluence tools to ensure Agile Project management. Understanding of search engines, spiders, and ranking criteria. Excellent PowerPoint and presentation skills. Strong organizational and project management skills, with the ability to multitask and prioritize effectively. Thrives in a fast paced team environment that values accountability, continuous learning, and agility. Comfortable working in a small, lean team that requires active participation and high productivity. Understanding of Consumer Banking products, passion around emerging technologies and how they will change consumer experiences. Education Bachelor’s degree required in Business, Marketing or a related field; Master’s degree preferred. This job description provides a high level review of the types of work performed. Other job related duties may be assigned as required. Job Family Group: Marketing Job Family: Marketing Program Management Time Type: Full time Primary Location: Wilmington Delaware United States Primary Location Full Time Salary Range: $114,720.00 $172,080.00 In addition to salary, Citi’s offerings may also include, for eligible employees, discretionary and formulaic incentive and retention awards. Citi offers competitive employee benefits, including: medical, dental & vision coverage; 401(k); life, accident, and disability insurance; and wellness programs. Citi also offers paid time off packages, including planned time off (vacation), unplanned time off (sick leave), and paid holidays. For additional information regarding Citi employee benefits, please visit citibenefits.com. Available offerings may vary by jurisdiction, job level, and date of hire. Anticipated Posting Close Date: Oct 29, 2024 Citi is an equal opportunity and affirmative action employer. Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi. View the \"EEO is the Law\" poster. View the EEO is the Law Supplement. View the EEO Policy Statement. View the Pay Transparency Posting show less",
      "date_posted": null,
      "location": "Wilmington, DE",
      "remote": "Director of Demand Generation (Remote in US) with verification",
      "salary": "$114.7K/yr - $172.1K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4056241880/"
    },
    {
      "job_title": "Sr. Manager, Web & SEO",
      "company": "PitchBook",
      "description": "At PitchBook, we are always looking forward. We continue to innovate, evolve, and invest in ourselves to bring out the best in everyone. We’re deeply collaborative and thrive on the excitement, energy, and fun that reverberates throughout the company. Our extensive learning programs and mentorship opportunities help us create a culture of curiosity that pushes us to always find new solutions and better ways of doing things. The combination of a rapidly evolving industry and our high ambitions means there’s going to be some ambiguity along the way, but we excel when we challenge ourselves. We’re willing to take risks, fail fast, and do it all over again in the pursuit of excellence. If you have a good attitude and are willing to roll up your sleeves to get things done, PitchBook is the place for you. About the Role: The Digital Marketing team at PitchBook is instrumental in driving the company's growth by utilizing innovative digital strategies that bolster our Sales and Customer Success operations. This role is pivotal in managing our web and search engine optimization (SEO) strategies, ensuring they align with our broader business goals and effectively support the demand generation, client engagement, and full funnel marketing initiatives. The Senior Manager, Web & SEO will ensure that PitchBook’s digital presence reflects the brand accurately and meets strategic business objectives. The Senior Manager, Web & SEO will lead a team of web and SEO experts and professionals to enhance PitchBook’s digital experiences across its web properties. This role encompasses strategic oversight, operational management, and team development. In this role you will be responsible for driving exemplary user engagement, optimizing for Search, and enhancing web experiences and journeys. Additionally, you will be on the lookout for new opportunities, place smart bets to facilitate our long term digital growth, and remain hyper competitive in the industry. This role will collaborate cross team and cross departmentally to ensure alignment and efficacy of initiatives. By developing forward looking web strategies that integrate with our full funnel marketing and sales objectives, this leader will play a crucial role in transforming our website into a powerful tool for business growth and customer engagement. Primary Job Responsibilities: Oversee the recruitment, development, and retention of a high performing web and SEO team, fostering a culture of innovation, excellence, and growth Manage a team of web experts to develop a comprehensive web strategy that incorporates SEO to enhance site visibility and user engagement Lead the management of web infrastructure, user experience, and content optimization, ensuring alignment with business objectives Develop and execute strategies to establish and expand PitchBook’s web presence globally, ensuring alignment with international growth objectives and localized brand messaging Work across departments like Product, Engineering, and News and Editorial to ensure alignment and gain buy in Collaborate with cross functional teams, including Performance Marketing, Product Marketing, and Creative to ensure that web initiatives support overall marketing strategies and business objectives Implement rigorous testing and optimization strategies and methodologies to continually enhance the website's effectiveness in driving demand, enhancing customer journeys, and improving conversion rates Monitor and analyze web performance metrics, leveraging insights to make data driven decisions for website enhancements Oversee delivery of web projects from concept through execution, ensuring they meet quality standards and are completed within timeline and budget Stay abreast of the latest trends and technologies in web management and SEO, applying best practices to keep PitchBook at the forefront of digital innovation Support the vision and values of the company through role modeling and encouraging desired behaviors Participate in various company initiatives and projects as requested Skills and Qualifications: Bachelor’s degree 7+ years of experience in web management, digital marketing, or a related field 3+ years in a managerial role Expert knowledge in SEO, web analytics, and web technologies Strong leadership and project management skills, capable of directing and motivating a team Excellent communication and interpersonal skills, with the ability to interact at all levels of the organization and with external stakeholders Adept at managing against multiple and competing priorities simultaneously Proficiency with the Microsoft Office suite including in depth knowledge of Outlook, Word, and Excel with the ability to pick up new systems and software easily Benefits + Compensation at PitchBook: Physical Health Comprehensive health benefits Additional medical wellness incentives STD, LTD, AD&D, and life insurance Emotional Health Paid sabbatical program after four years Paid family and paternity leave Annual educational stipend Ability to apply for tuition reimbursement CFA exam stipend Robust training programs on industry and soft skills Employee assistance program Generous allotment of vacation days, sick days, and volunteer days Social Health Matching gifts program Employee resource groups Subsidized emergency childcare Dependent Care FSA Company wide events Employee referral bonus program Quarterly team building events Financial Health 401k match Shared ownership employee stock program Monthly transportation stipend Please be aware the above PitchBook benefit and perk offerings are subject to corresponding plan and policy documents and may change during the course of your employment. Compensation Annual base salary: $150,000 $180,000 Target annual bonus percentage: 15% Starting pay will be based on several factors and commensurate with qualifications & experience. We also have a location based compensation structure; there may be different ranges for candidates by location. Working Conditions: We believe our business and our culture are strongest when we work together in person. We also know that it’s helpful to have some flexibility to work remotely. Most roles work in the office 3+ days/week, and some are expected to work in the office 4 5 days/week. The current expectation for this role is that you are working in the office 3+ days/week and that you are in the office full time during the training period, for which the length varies by role. During an initial phone screen, the team will discuss expectations for this specific position. The job conditions for this position are in a standard office setting. Employees in this position use PC and phone on an on going basis throughout the day. Limited corporate travel may be required to remote offices or other business meetings and events. Life At PB: We are consistently recognized as a Best Place to Work and our culture is at the heart of our success. It’s our fundamental belief that people do and create great things and that people are the cornerstone of prosperity. We believe that proactively seeking out different points of view, listening to others, learning, and reflecting on what we’ve heard creates a sense of belonging within PitchBook and strengthens the PitchBook community. We are excited to get to know you and your background. Concerned that you might not meet every requirement? We encourage you to still apply as you might be the right candidate for the role or other roles at PitchBook. show less",
      "date_posted": null,
      "location": "Seattle, WA",
      "remote": "Onsite",
      "salary": "$150K/yr - $180K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4079243985/"
    },
    {
      "job_title": "Director, SEO",
      "company": "Gametime",
      "description": "About Us Live experiences help people cross today’s digital divide and focus on what truly connects us – the here, the now, this once in a lifetime moment that’s bringing us together. To fulfill Gametime’s mission of uniting the world through shared experiences, we make it easy for people to discover and access the live experiences that matter most. With platforms on iOS, Android, mobile web and desktop supporting more than 60,000 events across the US and Canada, we are reimagining the event ticket industry in order to move at the speed of life. The Role The Director, SEO is responsible for leading the organic search strategy to enhance the Gametime experience. This role plays a crucial part in driving customer acquisition and revenue growth through improving organic search visibility across major search engines. The ideal candidate will demonstrate strong strategic thinking, hands on leadership, and technical expertise to optimize SEO performance and achieve long term business goals. Above & Beyond: The Impact You'll Make: Develop & Execute SEO Strategy: Lead the SEO strategy to scale high quality organic traffic, improve search engine visibility, and establish SEO as a key revenue driver for the business. Opportunity Assessment: Identify and execute growth opportunities through keyword research and applying on page, technical, and off page SEO tactics. Content & Link Building Strategy: Develop a scalable and relevant content strategy that provides guidance to higher intent purchasers and partners with marketing and engineering teams. Cross Functional Collaboration: Ensure SEO requirements are integrated into product development by collaborating with Product, UX/UI, and Engineering teams. SEO Performance & Analytics: Leverage data driven insights to optimize performance, develop dashboards, and report on SEO metrics such as traffic, rankings, and conversions. Technical SEO Leadership: Conduct regular technical SEO audits and manage aspects like site architecture, crawlability, and indexation. Competitor Analysis: Monitor and analyze competitors’ SEO strategies, ensuring the company’s approach remains competitive. Testing Strategy: Execute A/B testing and split testing on landing pages to validate SEO effectiveness and drive user engagement. Always Be Curious: Skills You've Learned Along The Way: Technical Skills SEO Strategy & Tools: Proficient in Google Search Console, Ahrefs, SEMrush, Screaming Frog, and mobile analytics platforms. Data Analysis: Strong skills in analytics tools like Google Analytics and Looker, focusing on driving SEO impact on user acquisition and revenue. Technical SEO: Skilled in HTML, JavaScript, CSS, structured data, and API integrations for search optimization. Interpersonal Skills Collaboration: Ability to work effectively with cross functional teams, including product managers, engineers, and marketers. Communication: Excellent leadership and communication skills to influence and guide teams toward shared objectives. Problem Solving And Decision Making Critical Thinking: Strong problem solving abilities, particularly in competitive and fast paced environments. Proactive Approach: Constantly identifying growth opportunities and implementing data driven solutions. Leadership Style Strategic Thinking: A leader who can balance long term goals with short term tactical execution. Innovative Leadership: Ability to remain updated on technical SEO trends and implement new strategies to stay competitive. One Team, One Dream: What We Need To Work Together: Education: Bachelor’s degree in Marketing, Computer Science, or a related field. Experience: 8+ years in SEO, with at least 4 years in a leadership role, preferably in the e commerce, marketplace, or mobile app space. Certifications: SEO or digital marketing certifications are a plus. Preferred Qualifications Experience: Proven success in scaling SEO efforts for consumer facing mobile apps. Expertise: Strong understanding of mobile first indexing, app store optimization (ASO), and Product Led SEO. What Makes You A Gamechanger? Achieving significant increases in organic search traffic and conversions. Successfully developing and implementing scalable SEO strategies that drive revenue growth. Ensuring technical SEO improvements through audits and leading cross functional collaboration for SEO integration. At Gametime pay ranges are subject to change and assigned to a job based on specific market median of similar jobs according to 3rd party salary benchmark surveys. Individual pay within that range can vary for several reasons including skills/capabilities, experience, and available budget. United States Pay Range $190,000 $225,000 USD Gametime is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, veteran status, sex, parental status, gender identity or expression, transgender status, sexual orientation, national origin, age, disability or genetic information. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our company. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$190K/yr - $225K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4082641281/"
    },
    {
      "job_title": "Sr. Product Analyst, SEO",
      "company": "ZipRecruiter",
      "description": "We offer a hybrid work environment. Most US based positions can also be performed remotely (any exceptions will be noted in the Minimum Qualifications below.) Our Mission: To actively connect people to their next great opportunity. Who We Are: ZipRecruiter is a leading online employment marketplace. Powered by AI driven smart matching technology, the company actively connects job seekers with millions of businesses of all sizes through innovative mobile app, web, and email services, as well as partnerships with the best job sites on the web. ZipRecruiter has the #1 rated job search app on iOS & Android. Summary: We are seeking a Senior Decision Scientist with extensive hands on experience with SEO to join our team. The ideal candidate will leverage data driven insights to enhance our SEO strategy, improve website visibility, and drive organic traffic. You will collaborate closely with product management, engineering, and design to drive the development, prioritization, and planning of the product roadmap. Key Focuses: Descriptive Analysis: Utilize descriptive analysis to uncover insights related to user behavior. Monitor and report on SEO performance metrics. Keyword Research: Conduct keyword research and competitive analysis to identify opportunities for optimization and SEO content creation. Experimentation: Design and analyze A/B tests to evaluate the impact of SEO initiatives on user engagement and conversion. Data Visualization: Create dashboards and visualizations to communicate findings and recommendations to stakeholders effectively. Predictive Modeling: Building models to forecast future SEO performance, identify trends, and inform content and marketing strategies. Minimum Qualifications: Bachelor's degree in a quantitative field such as mathematics, computer science, statistics, or economics (or equivalent experience) 4+ years of product analytics experience Minimum of 1 year of experience in SEO analytics Experience designing experiments, testing, and utilizing statistical principles to inform business decisions Proficient in statistical computing and scripting languages such as Python, R, SQL Preferred Qualifications: Master’s or Ph.D. in a quantitative field such as mathematics, computer science, operations research, economics In depth knowledge and hands on experience in various areas, including probability and statistics theory, causal inference, experimental design and analysis, synthetic control, product ecosystems, and Bayesian inference Experience in product analytics with a focus on user acquisition The US base salary range for this full time position is $145,000 $177,500. Our salary ranges are determined by role, level, and location, and the range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location, role related knowledge and skills, depth of experience, relevant education or training, and additional role related considerations. Depending on the position offered, equity, bonuses, commission, or other forms of compensation may also be provided as part of a total compensation package, in addition to a full range of medical, financial, and other benefits. ZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics. Privacy Notice: For information about ZipRecruiter's collection and processing of job applicant personal data for this job, please see our Privacy Notice at: https://www.ziprecruiter.com/careers/job applicant privacy notice show less",
      "date_posted": null,
      "location": "Santa Monica, CA",
      "remote": "Remote",
      "salary": "$145K/yr - $177.5K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4091490834/"
    },
    {
      "job_title": "SEO Director | Bankrate",
      "company": "Red Ventures",
      "description": "This role can be filled remotely OR on a hybrid schedule based in our Fort Mill, SC Headquarters or our NYC Office (Tuesday through Thursday) with fully remote days (Mondays and Fridays each week). Bankrate is seeking an experienced Director of Search Engine Optimization (SEO) to help drive organic growth. As a Director of SEO, you’ll lead a team of growth marketing analysts and fully own the development of your business's short and long term strategy for Bankrate's categorical personal finance teams. Being a SEO Director at Bankrate allows you to work alongside an expert Editorial team, advanced Engineers, and a world class Design team to create a robust SEO strategy to drive brand visibility. As SEO Director, you will have the autonomy to build a strategy and work with internal product teams to develop tooling to support that strategy & learn faster. An SEO Director is an integral part of a successful marketing strategy. What You'll Do Own the organic performance of one (or more) of Bankrate’s vertical businesses and lead a team of 1 5 growth marketing analysts with varying experience levels. Analyze organic search landscapes to find opportunities that drive valuable traffic and bottom line value for the business in collaboration with our experience and business teams. Test, innovate, and build custom solutions with our world class digital marketing, data science, and big data talent. Set and experiment with content promotion strategy with experience and creative teams using a wide array of digital tools and channels Leverage our proprietary primary source marketing stack to report on everything from operational (production) progress to upper funnel demand capture, rank position, and full funnel visibility to conversion and P&L metrics. Keep our sites and pages technically optimized for mobile users and search performance including information architecture, schema management, semantic HTML, page speed, and other components of crawling and indexing performance. What We're Looking For Someone who is a Growth Marketing Thought Leader: A self starting, proven performer with at least 5 years of experience in SEO. A proven leader and developer of talent with a track record of driving strong performance and growth from your team. Always curious, with strong communication skills, confidence, and the ability to work with a variety of cross functional teams. Passionate about innovating in organic search, don’t accept theories at face value, and enjoy testing to prove the effectiveness of tactics. A frequent reader of SEO journals and newsletters. Stays close to industry trends. Opinionated about the long term direction of organic search and can translate it into strategy. Deeply familiar with Google’s quality rater guidelines, Google Search Central blog and SEO starter guides, Web.dev documentation, and the like. Diligent in tracking your competitive landscape. Capable of identifying emerging competitor tactics, changes to the SERP, and themes from algorithm updates and can proactively and quickly adapt strategy. Innovative thinking around using AI to improve team efficiency on monotonous tasks. Interested in full funnel testing and page optimization bringing in traffic through organic search + on page multivariate testing to optimize revenue per session. Someone with Technical SEO Expertise: Ability to work within Content Management System (CMS) like Wordpress and Storyblok Ability to collaborate with Bankrate’s Engineering to improve the CMS. Familiar with the Scrum Agile Framework of software development. Ability to use Microsoft Excel and Google Sheets tools like VLOOKUPs and Pivot Tables. Very comfortable working with data using tools Google Analytics, Looker Studio, Google Tag Manager, and similar reporting platforms. Ability to optimize SQL Queries or willingness to learn. Basic ability to work with HTML, CSS, and JS as it relates to SEO. Familiar with several SEO Suites and tools including: Ahrefs, SEMRush, SEOClarity, Botify, Google Search Console, and Screaming Frog. Excited to learn how to utilize several proprietary in house tools for audience identification and multivariate testing. Someone who is a Cross Functional Collaborator: Comfortable working with business leaders in forecasting, budgeting, sensitivity analysis, and business modeling. Innovative, on the spot, creative problem solver who demonstrates both technical and analytical skills; candidates must be comfortable measuring, interpreting, and making fast paced decisions based on large volumes of sales and marketing performance data. Compensation USA Compensation Range: $130,000 $180,000 Enrollment in Red Ventures Long Term Incentive Plan (Equity). Benefits Health Insurance Coverage (medical, dental, and vision) Life Insurance Short and Long Term Disability Insurance Flexible Spending Accounts Paid Time Off Holiday Pay 401(k) with match Employee Assistance Program Paid Parental Bonding Benefit Program Who We Are Founded in 2000, Red Ventures (RV) is home to a diverse portfolio of industry leading brands and businesses, strategic partnerships and proprietary technology – including Bankrate, Lonely Planet, The Points Guy, BestColleges and more. Together, RV helps millions of people worldwide make life’s most important decisions, accelerates digital adaptation, and innovates the online consumer experience by improving every step of the consumer journey – from first discovery of information, throughout the decision making process, to transactions. Headquartered south of Charlotte, NC, Red Ventures employs thousands of people across the US and Puerto Rico, with international offices in the UK and Brazil. For more information, visit https://redventures.com and follow @RedVentures on social platforms. We offer competitive salaries and a comprehensive benefits program for full time employees, including medical, dental and vision coverage, paid time off, life insurance, disability coverage, employee assistance program, 401(k) plan and a paid parental leave program. Red Ventures is an equal opportunity employer that does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or any other basis protected by law. Employment at Red Ventures is based solely on a person's merit and qualifications. We are committed to providing equal employment opportunities to qualified individuals with disabilities. This includes providing reasonable accommodation where appropriate. Should you require a reasonable accommodation to apply or participate in the job application or interview process, please contact accommodation@redventures.com. If you are based in California, we encourage you to read this important information for California residents linked here. O #SearchEngineOptimization #SEOJobs #Finservjobs Click here for more details regarding the employee privacy policy: https://www.redventures.com/legal/us emp privacy notice Questions about this Privacy Notice can be directed to employeerights@redventures.com. Alternatively, you may raise any questions or concerns to your manager, HR Business Partner, or through the Privacy Team. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$130K/yr - $180K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4037071880/"
    },
    {
      "job_title": "Lead Product Manager, SEO (Remote - United States)",
      "company": "Yelp",
      "description": "Summary For 20 years, Yelp has been synonymous with helping users discover and connect with great local businesses from restaurants and nail salons to movers and plumbers. With unmatched local business information, photos and review content, Yelp provides a one stop local platform to discover, connect and transact with local businesses of all sizes. Whether you're requesting a quote, joining a waitlist, or making a reservation, appointment or purchase, Yelp makes the experience easy for consumers. Currently, Yelp experiences 4 billion sessions and 100 million monthly active users in the US alone and has continued to grow organically. Yelp sees an opportunity for exponential growth by doubling down on efforts to address all local needs beyond finding restaurants. With potential for expansion in untapped markets and international areas, we expect transformational growth. The Product Manager, SEO is a critical role within our high performing product team to drive Yelp's SEO efforts. You will play a key role in achieving our vision of becoming the top SEO team in the market. Utilizing your strong skills and experience, you will own the SEO roadmap, implementing new strategies, and enhancing existing SEO levers such as structured data, internal linking, and meta optimization. You will collaborate with product and engineering teams with deep SEO expertise to identify leverage points and efficiencies. The culture at Yelp is a unique blend of a dynamic startup environment with the stability and resources of a successful public company. You will have full ownership of your focus area and be able to make fast decisions in a highly collaborative setting. This opportunity is fully remote and does not require you to be located in any particular state within the US. We welcome applicants from throughout the US. We’d love to have you apply, even if you don’t feel you meet every single requirement in this posting. At Yelp, we’re looking for great people, not just those who simply check off all the boxes. What You'll Do Own Yelp’s SEO efforts including creating new SEO levers, optimizing existing levers, testing strategy/execution, and contributing to cross company initiative as part of the SEO center of excellence. Develop and execute the vision and roadmap for SEO features. Understand both end users (search engines and Yelp visitors) and build products and features that will further enhance growth without negatively impacting the consumer experience. Partner closely with the tech organization, and other consumer PM teams, to ensure alignment, partnership and outcome delivery. Build an SEO toolkit that enables the turning of dials to support targeted growth.Use data to inform decision making on prioritization of roadmap and optimization of SEO experiments. Mentor, and support the hiring efforts to grow a world class SEO product team. What It Takes To Succeed Multiple years of SEO product management experience. Experience at a top tier consumer or marketplace business that is rooted in A/B testing and witnessed massive user growth is highly preferred. Demonstrated ability to understand a business and how to set product strategy. Strong understanding and track record of implementing SEO product growth mechanics, ideally in a consumer marketplace/social business. Proven experience in managing full product development lifecycle, from research and concept to release and future evolution in a high growth, scale up environment. Strong product sense and an ability to think about the business broadly. Experience fostering an inclusive, collaborative, and accountable team culture. Passionate about Yelp’s mission of connecting people to great local businesses. A Bachelor’s Degree or an equivalent work experience is required. What You'll Get Compensation range is $120,000 315,000 annually. You may also be offered a bonus, restricted stock units, and benefits. This opportunity has the option to be fully remote in all locations across the US. You can find more information about Yelp's five star benefits here! Closing At Yelp, we believe that diversity is an expression of all the unique characteristics that make us human: race, age, sexual orientation, gender identity, religion, disability, and education — and those are just a few. We recognize that diverse backgrounds and perspectives strengthen our teams and our product. The foundation of our diversity efforts are closely tied to our core values, which include “Playing Well With Others” and “Authenticity.” We’re proud to be an equal opportunity employer and consider qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition or disability. Actual salary offered may vary based on multiple factors, including but not limited to, an individual's location and experience. Pursuant to the San Francisco Fair Chance Ordinance and similar laws in other locations, we will consider for employment qualified applicants with arrest and conviction records. We are committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, you may contact us at accommodations recruiting@yelp.com or 415 969 8488. Note: Yelp does not accept agency resumes. Please do not forward resumes to any recruiting alias or employee. Yelp is not responsible for any fees related to unsolicited resumes. Recruiting and Applicant Privacy Notice show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "$120K/yr - $315K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4056068020/"
    },
    {
      "job_title": "Marketing Manager, SEO, Amazon Flex",
      "company": "Amazon",
      "description": "Description This is an exciting role which involves complete ownership of Search Engine Optimization for Amazon Flex globally. The successful candidate will create and lead a strategy to improve Amazon Flex rankings on search engines, identifying critical customer needs and gaps and working with internal stakeholders and regional teams to share these learnings. Responsibilities will span unpaid channels, and require the review of past data and trends in order to continually iterate strategy. You will demonstrate an ability to clearly communicate to the right target audience, and be in charge of developing and deploying online content at both a global and regional level. You will work extremely closely with regional marketing teams to ensure that content or optimizations are tailored for the right audience. A successful candidate will have experience in leading and executing a SEO strategy either in house or agency side. You will be an analytical thinker who loves solving problems and strives to provide an excellent customer experience from the first interaction with the Amazon Flex website. The candidate will be customer obsessed and focused on delivering results with clear ROI. Excellent skills in Excel are also a required. This role is based out of Seattle. NYC can be considered as needed. Key job responsibilities Build an SEO strategy, focusing on growing Amazon Flex’s organic reach across our regions and showing how you will deploy content to acquire our target audiences within our unique delivery areas. Write and deploy original content for the Amazon Flex website, tailored for the right audience. Scope third party applications to support with SEO tasks, provide training to worldwide marketing stakeholders. Be the SME on Amazon Flex customer search behavior, needs and gaps and work with internal stakeholders to enhance the customer experience in other areas of the business. Monitor Delivery Partner sentiment in specific regions and act as the expert on their needs, including communicating back to the larger Amazon Flex team. Constantly check search results, ranking and analytics to monitor performance and make recommendations for improvements. Keep up to date with ever changing algorithm updates. Work with internal teams to share and learn best practices, and drive results between marketplaces. Collaborate with technical partner teams to explain and prioritize technical issues. A day in the life About The Team At Amazon, we're working to be the most Customer centric company on earth. One customer experience that we’re constantly looking to take to a new level is how we fulfill and deliver orders. Our goal is to exceed the expectations of all our customers by ensuring that their orders, no matter how large or small, are delivered where and when they need them, as quickly, accurately, and cost effectively as possible. To meet this goal, Amazon is continually striving to innovate and provide best in class service levels through the introduction of pioneering new products and services in the last mile delivery space. We are doing this by building a world class last mile operation, significantly complimented by Amazon Flex. Amazon Flex works directly with independent contractors – called delivery partners – to make deliveries to our customers. With Amazon Flex, individuals can now be their own boss delivering Amazon packages. Basic Qualifications 4+ years of proven experience in SEO strategy and execution, including technical SEO, content optimization, and link building. Proficiency in SEO tools such as Google Analytics/Adobe Analytics, Google Search Console, Ahrefs, SEMrush, Screaming Frog, or similar. Strong understanding of technical SEO, including crawling, indexing, and rendering, with experience conducting and resolving SEO audits. Strong ability to analyze SEO performance data and translate insights into actionable recommendations. Understanding of international SEO concepts such as hreflang tags and optimizing for multilingual/multiregional sites. Proven ability to manage multiple SEO projects simultaneously while collaborating with cross functional teams Preferred Qualifications Hands on experience managing SEO for multi site or international websites. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $98,200/year in our lowest geographic market up to $179,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company Amazon.com Services LLC Job ID: A2853616 show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Onsite",
      "salary": "$98.2K/yr - $179.6K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4101115275/"
    },
    {
      "job_title": "Senior SEO Manager (Slack)",
      "company": "Salesforce",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Marketing & Communications Job Details About Salesforce We’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place. Slack is seeking a passionate and driven Senior SEO Manager to join our growing marketing team. In this role, you will play a critical part in developing and executing our global SEO strategy, driving organic growth across multiple regions. You are a highly analytical and collaborative individual with a proven track record of success in international SEO. You thrive in a fast paced environment and possess exceptional communication skills to effectively collaborate with cross functional teams. Responsibilities Global SEO Roadmap Ownership: Lead the development and execution of Slack's global SEO roadmap, collaborating closely with regional content teams and agencies to prioritize initiatives and drive organic growth. Collaboration & Strategy: Partner with product teams to ensure SEO requirements are integrated into the product roadmap, safeguarding SEO investments and advocating for organic search within the organization. Data Driven Decision Making: Utilize data to prioritize SEO initiatives, track performance, and measure the impact of improvements across regions. Continuously monitor industry trends and competitive landscapes to refine SEO strategies. Standardization & Best Practices: Establish and disseminate SEO best practices and guidelines across regions, ensuring consistency and alignment among teams. Performance Metrics: Define and track key performance indicators (KPIs) for SEO, working with regional teams to monitor progress and report on the health of technical SEO through audits and performance analysis. Cross Functional Leadership: Lead and motivate cross functional teams, fostering a collaborative environment to achieve shared goals. Effectively manage resources and scope to maintain project momentum and deliver results. Effective Communication: Communicate clearly and concisely with stakeholders at all levels, ensuring seamless collaboration and efficient resource allocation. Requirements 5+ Years of SEO Experience: Deep understanding of SEO methodologies, best practices, and industry trends, with a minimum of 5 years of hands on experience. International SEO Experience: Demonstrated success in managing and executing SEO strategies across multiple geographic regions, with a strong understanding of regional search nuances and cultural considerations. Multilingual SEO: Experience managing SEO for websites in different languages, including those you may not be fluent in. Hands on Approach: Willingness to \"roll up your sleeves\" and perform tasks such as on page optimization, content editing, and technical SEO analysis. Exceptional Project Management Skills: Proven ability to multitask, prioritize effectively, and manage multiple projects simultaneously to meet deadlines in a fast paced environment. Data Driven Approach: Strong analytical skills with the ability to leverage data to inform decisions, measure performance, and identify opportunities for improvement. Collaboration & Communication: Exceptional written and verbal communication skills, with the ability to build strong cross functional relationships and effectively convey complex information to both technical and non technical audiences. Technical Proficiency: Hands on experience with SEO tools such as SEMrush, Ahrefs, BrightEdge, and Screaming Frog. Bonus Points Experience working in the SaaS industry. Familiarity with agile methodologies. Benefits Competitive salary and benefits package. Opportunity to work on a globally recognized platform. Collaborative and supportive work environment. Be a part of a company that is changing the way the world works. If you are a passionate SEO professional with a proven track record of success and a desire to make a significant impact, we encourage you to apply! Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com. Salesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third party agency or company that does not have a signed agreement with Salesforce. Salesforce welcomes all. For Colorado based roles, the base salary hiring range for this position is $136,600 to $187,900. For Illinois based roles, the base salary hiring range for this position is $150,300 to $206,700. Compensation offered will be determined by factors such as location, level, job related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com. show less",
      "date_posted": null,
      "location": "Dallas, TX",
      "remote": "Onsite",
      "salary": "$136.6K/yr - $206.7K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102103769/"
    },
    {
      "job_title": "Senior Marketing Manager, SEO",
      "company": "Motion Recruitment",
      "description": "One of the world’s largest retail organizations is searching for a Senior SEO Manager to lead its SEO team and drive non paid traffic growth across its digital properties 100% Remotely. In this role, you will develop and implement a comprehensive SEO strategy that enhances visibility, improves search performance, and aligns with business objectives. You’ll lead a team of SEO experts, oversee technical and content optimization, and pioneer emerging trends like generative AI and content automation. This exciting position begins as a 3 month, W2 contract opportunity with a 100% remote schedule, competitive benefits, and the potential to extend or convert to permanent employment! Responsibilities: Develop and execute a strategic SEO roadmap to achieve ambitious traffic and revenue goals. Optimize technical SEO, including site architecture, crawlability, and mobile performance. Implement cutting edge content and link building strategies to enhance search rankings. Advocate for SEO best practices and educate internal stakeholders to foster organization wide alignment. Lead cross functional collaborations to integrate SEO with broader marketing and business initiatives. Stay ahead of industry trends, leveraging AI and automation to maintain a competitive edge. Define reporting frameworks, analyze performance metrics, and present insights to leadership. Qualifications: Bachelor’s degree required; advanced degrees are a plus. 10+ years of SEO experience, with a proven track record of driving organic search growth. Expertise in managing technical SEO, content strategies, and international optimization. Strong leadership experience, including managing teams of 5+ and cross functional collaboration. Proficiency in SEO tools, analytics platforms, and emerging digital marketing technologies. Excellent communication skills and the ability to translate technical concepts for diverse audiences. Motion Recruitment Partners is an Equal Opportunity Employer, including disability/vets. All applicants must be currently authorized to work on a full time basis in the country for which they are applying, and no sponsorship is currently available. Employment is subject to the successful completion of a pre employment screening. Accommodation will be provided in all parts of the hiring process as required under Motion Recruitment Employment Accommodation policy. Applicants need to make their needs known in advance. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$95/hr - $100/hr",
      "job_url": "https://www.linkedin.com/jobs/view/4101209765/"
    },
    {
      "job_title": "Designer, Web Presence (Growth & SEO)",
      "company": "Stripe",
      "description": "Who we are About Stripe Stripe is a financial infrastructure platform for businesses. Millions of companies from the world’s largest enterprises to the most ambitious startups use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career. About The Team Web Presence and Platform is organized into two pillars, each of which is grouped into pods that focus on the central tenets of Stripe's public mission. The Presence pillar creates industry leading designs for Stripe’s front door surfaces, educates customers about the power of our platform, and drives our business success. The Platform pillar builds the internal machinery that powers these surfaces, and is responsible for making our websites fast, stable, and easy to modify. Together we design and build stripe.com and other sites that amount to what is, for many, their first impression of Stripe. As such, WPP offers exciting opportunities to have a major impact on Stripe’s success. We want to make every pixel count, we want it to be enthralling, and we want to help other Stripes seamlessly benefit from our systematic work. What you’ll do As a Designer focused on Growth and SEO within the Web Presence and Platform (WPP) team, you will enhance Stripe’s organic search presence and user engagement through strategic design and content creation. Your role will blend creative and analytical skills, managing multiple projects in a fast paced environment to drive growth and engagement through innovative design solutions that captivate and convert users. Responsibilities Design and optimize organic landing pages for stripe.com to improve search visibility and user engagement Design and develop interactive content tools (e.g., calculators, generators, templates) that provide utility to prospective businesses. Ensure the accuracy and reliability of these interactive tools, maintaining a high level of quality and attention to detail Create visually engaging and user friendly designs that align with Stripe’s brand standards Collaborate with Product Marketing, Growth, and other cross functional teams to understand user needs and behaviors, provide design solutions based on those insights, and to ensure the interactive content meets both business objectives and user needs Track and report on key performance indicators related to interactive content, providing insights to leadership on its impact on growth Create and refine design systems to optimize the website for SEO and growth Conduct and analyze A/B and multivariate tests from a design perspective, implementing improvements based on findings, and analyze results to iterate and improve interactive content Implement and manage a growth process that drives key business metrics such as conversions, customer acquisition, and user engagement across our web presence Who you are We're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement. Minimum Requirements 5+ years of relevant design experience at a tech, product driven company, focusing on interactive content and growth Strong portfolio showcasing interactive content design, SEO projects, and growth outcomes Proven record in strategic thinking and decision making based on data and user insights Extensive experience with SEO and website design principles, A/B testing, and conversion rate optimization Meticulous attention to detail and strong problem solving abilities Expert understanding of the formal elements of design, including typography, layout, balance, and proportion Methodical and structured approach Excellent communication skills and ability to collaborate effectively in a cross functional environment Preferred Qualifications Demonstrated knowledge of software engineering workflows and principles Experience with conducting quantitative and qualitative user research Solid understanding of SEM and digital marketing Experience designing for international experiences Hybrid work at Stripe This role is available either in an office or a remote location (typically, 35+ miles or 56+ km from a Stripe office). Office assigned Stripes spend at least 50% of the time in a given month in their local office or with users. This hits a balance between bringing people together for in person collaboration and learning from each other, while supporting flexibility about how to do this in a way that makes sense for individuals and their teams. A remote location, in most cases, is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on sites, meet ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently or plan to live. Pay and benefits The annual US base salary range for this role is $152,700 $229,100. For sales roles, the range provided is the role’s On Target Earnings (\"OTE\") range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process. Additional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$152.7K/yr - $229.1K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4069017603/"
    },
    {
      "job_title": "Lead SEO Specialist",
      "company": "NerdWallet",
      "description": "Are you passionate about pioneering organic growth strategies and pushing the boundaries of SEO? NerdWallet is seeking a Lead SEO Specialist to join our dynamic team! In this leadership role, you'll be at the forefront of developing and executing innovative SEO strategies that align with our company's growth objectives. You’ll collaborate with a team of talented marketing managers and work closely with cross functional teams to ensure NerdWallet stays competitive in the digital landscape. Your primary responsibility is to drive innovation, manage the SEO team, and ensure the achievement of key performance indicators (KPIs) related to organic traffic and revenue growth. At NerdWallet, we prioritize a supportive, inclusive culture that values personal development, creativity, and collaboration. Come be part of a team where your contributions will shape our future! This role will report to the Head of Organic Growth. Where you can make an impact: Define and implement a robust organic user acquisition strategy focused on SEO and content optimization Prioritize top opportunities and align efforts across product, content, and marketing teams to ensure seamless execution of growth initiatives Conduct market research to uncover new traffic growth opportunities that align with the product roadmap Communicate and promote high impact acquisition plans across different audience channels Design and implement rapid testing frameworks to improve site engagement and membership conversion Utilize analytics tools to generate business insights and inform strategy Forecast audience growth and identify trends and opportunities for driving incremental revenue Own the organic user acquisition top line ensuring accountability for key metrics and effectively communicating strategic initiatives and actionable recommendations to senior stakeholders Provide regular performance reports and updates to senior management Enhance the user journey by addressing consumer pain points through data driven analysis Implement UX improvements to increase engagement and conversion rates Implement innovative SEO strategies to maintain and enhance search engine rankings Your experience: We recognize not everyone will meet all of the criteria. If you meet most of the criteria below and you’re excited about the opportunity and willing to learn, we’d love to hear from you. 7+ years of experience in SEO Demonstrated track record of delivering business outcomes or products that move the needle on company metrics Experience building strong cross functional partnerships as a thought leader within an organization Experience building content roadmaps with Content teams Experience with analyzing consumer needs and pain points and split testing to create a user first experience Proficient in Excel or Google Sheets Experience working in financial services or equivalent knowledge of personal finance Where: This role will be remote (based in the U.S.). We believe great work can be done anywhere. No matter where you are based, NerdWallet offers benefits and perks to support the physical, financial, and emotional well being of you and your family. What we offer: Work Hard, Stay Balanced (Life’s a series of balancing acts, eh?) Industry leading medical, dental, and vision health care plans for employees and their dependents Rejuvenation Policy – Vacation Time Off + 11 holidays + 4 Mental Health Days Off New Parent Leave for employees with a newborn child or a child placed with them for adoption or foster care Mental health support Paid sabbatical for Nerds to recharge, gain knowledge and pursue their interests Health and Dependent Care FSA and HSA Plan with monthly NerdWallet contribution Monthly Wellness Stipend, Cell Phone Stipend, and Wifi Stipend Work from home equipment stipend and co working space subsidy Have Some Fun! (Nerds are fun, too) Nerd led group initiatives – Employee Resource Groups for Parents, Diversity, and Inclusion, Women, LGBTQIA, and other communities Hackathons and team events across all teams and departments Company wide events like NerdLove (employee appreciation) and our annual Charity Auction Our Nerds love to make an impact by paying it forward – Take 8 hours of volunteer time off per quarter and donate to your favorite causes with a company match Plan for your future (And when you retire on your island, remember the little people) 401K with company match Be the first to test and benefit from our new financial products and tools Financial wellness, guidance, and unlimited access to a Certified Financial Planner (CFP) through Northstar Disability and Life Insurance with employer paid premiums If you are based in California, we encourage you to read this important information for California residents linked here. NerdWallet is committed to pursuing and hiring a diverse workforce and is proud to be an equal opportunity employer. We prohibit discrimination and harassment on the basis of any characteristic protected by applicable federal, state, or local law, so all qualified applicants will receive consideration for employment. NerdWallet participates in the Department of Homeland Security U.S. Citizenship and Immigration Services E Verify program for all US locations. For more information, please see: E Verify Participation Poster (English+Spanish/Español) Right to Work Poster (English) / (Spanish/Español) Base pay offered may vary within the posted range based on several factors, including but not limited to education, job related knowledge, skills, experience, and location. The pay range for this role is $112,000—$204,000 USD show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$112K/yr - $204K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4085890622/"
    },
    {
      "job_title": "Director, Content Marketing & SEO",
      "company": "PermitFlow",
      "description": "🚀 About PermitFlow PermitFlow’s mission is to streamline and simplify construction permitting in the $1.6 trillion United States construction market. Our software reduces time to permit, supporting permitting end to end including permit research, application preparation, submission, and monitoring. We’ve raised a $31m Series A led by Kleiner Perkins with participation from Initialized Capital, Y Combinator, Felicis Ventures, Altos Ventures, and the founders and executives from Zillow, PlanGrid, Thumbtack, Bluebeam, Uber, Procore, and more. Our team consists of architects, structural engineers, permitting experts, and workflow software specialists, all who have personally experienced the pain of permitting. ✋ Who you are? The Director, Content Marketing & SEO is a pivotal role responsible for creating and driving our full content strategy. This position requires an individual with strong experience in both content management and SEO in addition to a strong comfort with data. We’re looking for a strategic problem solver who is data driven, pragmatic, and process driven. You should be ready and excited to be a hands on operator, executing tactically as well as strategically. The Director will manage contracted content writers and other contractors, ensuring their efforts support the larger content and SEO vision. Tactically, this means owning keyword research, building a pipeline of relevant content ideas, and setting up our writers for success. This also means reviewing / copyediting content, posting content, and tracking results. As critical as tactical execution is a a willingness to experiment with AI and other novel data centric content strategies. We have a strong hypothesis that this individual will be able to have an outsized impact on the business via savvy adoption of new tools and techniques. We’re looking for a curious, driven tinkerer excited to design and run content / SEO experiments before formalizing long term programs around the most successful ones. ✅ What You’ll Do: Develop content strategies to further our position as thought leaders in the permitting space, making strategic decisions around channel, format, content, and more Own our SEO and website strategy, including keyword research, site architecture, and metrics tracking (incl. pipeline growth) Work with demand generation to identify and create content pieces serving the full marketing funnel, different personas, and campaigns Experiment with new content formats and channels (ex. webinars, customer interviews, video testimonials) Experiment and incorporate new technology and methodologies into our content and SEO programs, such as generative AI and programmatic SEO Create and develop our brand voice in such a way that our ICP and broader addressable market trust PermitFlow as a thought leader and source of truth Build and drive our content engine, creating a process for consistently producing high quality content pieces (likely involving a small group of freelance writers and contractors) Act as a copyeditor and reviewer to ensure high quality of external facing communications Communicate with sales and other departments to identity new content requirements, developing and executing on content in support of key campaigns and channels Stay apprised of the latest content marketing and SEO tactics and approaches to ensure our marketing remains fresh and ahead of the competition Report on key content and SEO metrics to track performance and identify opportunities to improve 🙌 Qualifications & Fit: Professional Background: 3+ years of experience supporting content and inbound strategies for B2B SaaS companies. Curiosity: Both SEO and Content are iterative programs. We’re looking for someone creative, proactive, and curious excited to experiment and push boundaries. Strong quant inclination: You can’t improve what you can’t measure. You love numbers, and you’re very comfortable in data tools. Strong communicator: Driven to \"cut through the noise\" with thoughtful, memorable and differentiating messages. Strong work ethic: You have the opportunity to build and lead a function as we grow. Motivated by a fast paced environment. Team player: Your success will be tied closely to the success of the functions you’re supporting. Seeing your success as their success is critical! NYC Based: This role is a hybrid role, with in person required Monday, Wednesday, and Friday in our Manhattan office. 💙 Benefits 📈 Equity packages 💰 Competitive Salary 🩺 100% Paid health, dental & vision coverage 🍽️ Lunch & Dinner provided w/ a fully stocked kitchen 🚍 Commuter benefits 🎤 Team building events 🌴 Unlimited PTO Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "Remote",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4077774996/"
    },
    {
      "job_title": "Web Channel and SEO Director",
      "company": "CVS Health",
      "description": "Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver. Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable. Position Summary The Web Channel Owner role for Aetna Medicare is a critical position in our Marketing organization, with accountability for the acquisition and engagement of members, prospects, and shoppers on the Aetna.com site, our landing pages, and our DTC Shop, Buy, and Enroll tool. This role will partner across the organization, working with Sales, Marketing, Analytics, MarTech, Content, UX, Research, Privacy, Compliance, and other teams to set the direction for and manage the execution and delivery of acquisition, conversion, and retention experiences. Supporting digital properties hosting more than 20M visits a year, this role will work across the organization to ensure our strategy, roadmap, priorities, and deliverables align to the needs of our users, our business, and our stakeholders. Key Responsibilities Own accountability for end to end public site experiences, for prospects and shoppers, from the homepage/landing page through the shopping portal Deliver digital experiences that realize our strategic marketing objectives and implement the contact strategies developed in partnership with our Acquisition, Retention, and Conversion Marketing teams Define, prioritize, and shepherd the delivery of Digital Marketing’s capabilities backlog for Aetna.com/Medicare, AllinaHealthAetnaMedicare.com, the Shop, Buy, and Enroll tool, and more, in partnership with the MarTech/Digital Product organization, and aligned with the Medicare Marketing, Sales, and Business teams Direct the day to day execution of our SEO program, managing our agency and directing both creative and technical development and publication Take ownership of customer journey mapping, defining the role of our sites in the prospect and member journeys and establishing the respective roles of the core site vs landing pages/microsites; ensure clarity of role and function in customer journey of all enterprise Medicare web assets Own critical KPIs, and support improvement via active monitoring and reporting, for metrics including organic traffic, engaged users, inbound calls, engagement and bounce rates, shopping rates, and task completion Serve as the Marketing lead for the integration of Aetna Medicare experiences into the core Aetna.com website Review and approve functional definitions, user stories, wireframes, page designs, content, copy, site structure, and functions Partner closely with the Paid Search and Display, Email marketing, and Media teams and agencies to ensure a through line for prospects from pre site touch to end of journey Support digital analytics and web sales forecasting, and own the first line of accountability for performance reporting during the annual enrollment period Provide operational support for website, landing page, and shopping tool initiatives, and support QA and validation of production deployments Drive strategic thinking in digital experience design, bringing a critical eye to initiatives and their execution; raise the average level of digital savvy across the org, and serve as a subject matter expert on digital experiences across the full spectrum and customer lifecycle Mentor the next generation of Digital Marketing leaders, and actively support the building, development, and retention of a diverse, high powered bench of Digital talent Required Qualifications 8+ years’ experience managing an enterprise marketing website in a matrixed, multistakeholder environment 5+ years’ experience managing a complex, multi step, multi integration DTC shopping/enrollment platform 3+ years’ experience with people leadership and management (2 4 direct reports) Deep proficiency with digital analytics at an enterprise scale, via tools such as Adobe Analytics/Customer Journey Analytics, Tableau, or Google Analytics Preferred Qualifications Demonstrated record of thinking strategically while leading tactically, thinking through multiple orders of consequences to solve problems and improve outcomes Proven track record of successful deliveries, with projects designed, shipped, and driven by application of digital analytics, user research, and other hard data, with directly measurable and documented positive outcomes History of driving improved organic user acquisition and increasing DTC shopping engagement Highly conversant in eCommerce experience design, DTC user acquisition, UX and content design, content strategy, digital product management, SEO, and accessibility Ability to lead without authority, exercising soft power and creativity to solve business challenges, rallying stakeholders behind non obvious solutions, and managing through disagreement to build consensus Strong combination of business, analytical, and technical acumen Demonstrated history of taking the lead, dealing with ambiguity, and delivering solutions that weren’t directed or predefined Strong storytelling and communication skills, able to convey critical digital strategy and impact realities and lessons to less digital native audiences Experience in healthcare or health services is highly preferred Experience in highly regulated industries is a strong plus Education Bachelor’s degree OR equivalent (4 years’ experience and High School Diploma/GED) required Pay Range The Typical Pay Range For This Role Is $100,000.00 $231,540.00 This pay range represents the base hourly rate or base annual full time salary for all positions in the job grade within which this position falls. The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors. This position is eligible for a CVS Health bonus, commission or short term incentive program in addition to the base pay range listed above. This position also includes an award target in the company’s equity award program. In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities. The Company offers a full range of medical, dental, and vision benefits. Eligible employees may enroll in the Company’s 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees. The Company provides a fully paid term life insurance plan to eligible employees, and short term and long term disability benefits. CVS Health also offers numerous well being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners. As for time off, Company employees enjoy Paid Time Off (“PTO”) or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. For more detailed information on available benefits, please visit Benefits | CVS Health We anticipate the application window for this opening will close on: 01/31/2025 Qualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state and local laws. show less",
      "date_posted": null,
      "location": "Hartford, CT",
      "remote": "Onsite",
      "salary": "$100K/yr - $231.5K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4098243357/"
    },
    {
      "job_title": "Head of SEO and Owned Media",
      "company": "Study.com",
      "description": "Our mission is to open the door to the life changing impact of education and help make education accessible for all. As a nimble growth stage start up, we've emerged as the leading online education platform helping over 30 million learners and educators each month. Study.com has earned numerous awards and it has been recognized as one of the most transformational companies in EdTech, living up to our commitment to all learners: Breakthroughs Start Here. From students and educators in over 9,000 school districts that use Study.com, to working adults striving to complete their college degree or gain professional certifications, we empower them to reach their full potential. Our product is our impact! Across our college programs alone we have saved students over $200M in tuition and enabled tens of thousands to become nurses, teachers, accountants and more. Additionally, as part of our mission we’ve donated over $27 million across social impact programs to learners and educators. Study.com, a leading online education technology company, is seeking a seasoned Head of SEO and Owned Media to lead growing our expansive traffic footprint. Study.com helps over 30 million learners and educators each month. SEO has been a key part of our strategy since inception, requiring a sustained, company wide effort. We are looking for a strategic, hands on leader with a proven track record in managing large scale owned media and SEO strategies, including content, technical onsite, offsite SEO and brand. The ideal candidate will have a blend of technical expertise, creative content planning, and leadership skills to drive our visibility and audiences across for various segments of our business and millions of keywords. This role is based in our Mountain View, CA office and is hybrid in office Mondays, Wednesdays, and Thursdays. What You'll Do Develop and execute a comprehensive SEO strategy to increase organic search traffic, improve SERP rankings, and drive user engagement for our key direct to consumer business segments. Analyze and leverage data driven insights to identify growth opportunities and optimize content across multiple owned media platforms – including Google Search, YouTube, TikTok, forums and more. Conduct technical SEO audits and implement necessary changes to improve site architecture, performance, and other technical elements affecting SEO performance. Direct with cross functional teams, including content, marketing, product, and engineering, to help meet SEO goals which are aligned with company objectives. Develop and execute strategy to grow the brand, scale outreach and ultimately increase authority, relevant mentions and backlinks. Lead strategy and execution for LLM injection and staying relevant in a shifting SEO landscape (AI Overviews, ChatGPT Search, Perplexity, etc.) Lead, mentor, and grow the global owned media and SEO team, providing guidance, setting expectations and driving accountability to achieve team and company goals. Manage relationships with any SEO related external vendors or partners as needed. Stay updated with the latest SEO trends, Google algorithm updates, and industry best practices to ensure a competitive edge in search rankings. Optimize the use of machine learning tools, AI and AI agents / automation to enhance team efficiency across all parts of the SEO optimization workflow to maximize SEO performance at scale. Manage the team that is responsible for scaling Study.com’s ambassador and influencer program in owned media channels through strategic content initiatives and partners. Monitor, report, and analyze SEO and owned channels performance metrics, adjusting strategies as needed to achieve desired results. Leverage SEO to change the world and do well by doing good. What You'll Bring To The Role 15+ years of experience in SEO with a track record of successfully managing and growing high traffic websites (direct to consumer and SaaS experience a plus). Demonstrated mastery of “hands on” or “hands off” approaches as a leader. Know the details in your area while understanding the broader strategy to connect the dots quickly. Must be willing and able to lead a team as well as roll up their sleeves to get things done. Proven experience directly inspiring and managing high performance teams in a dynamic fast paced environment that requires executional excellence and speed. Strong understanding of ranking factors, search engine optimization practices, and content marketing strategies, including how AI impacts the future of SEO. High technical proficiency with SEO tools (e.g., SEMrush, Ahrefs, Moz, SimilarWeb), web analytics and data analysis (Excel, Tableau, BigQuery). Experience with AI and machine learning applications in SEO and content marketing. Excellent analytical, organizational, and project management skills. Strong communication and interpersonal abilities to effectively collaborate all levels and stakeholders. Ability to think creatively, strategically, and identify and resolve problems efficiently. The salary range for this position is $150,000 $190,000 per year. Pay and is dependent upon factors including skills, work experience, business needs, and market demands. At Study.com, We Know That Strong Communities Are Built On The Power Of Our Diversity, And We Respect And Strive To Understand For The Diverse Identities, Race, Ethnicities, Backgrounds, And Perspectives Of Our Team Members. Our Work And Company Culture Have Been Consistently Recognized, Including Inc. Best Place to Work Fortune Great Places to Work – Best Workplaces in the Bay Area Golden Bridge Awards – Gold Winner, Corporate Social Responsibility San Francisco Business Times & Silicon Valley Business Journal – Best Places to Work Study.com provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran or disability status. In addition to federal law requirements. Study.com complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. Additionally, qualified applicants with arrest and conviction records will be considered for the position in accordance with applicable state and local laws. show less",
      "date_posted": null,
      "location": "Mountain View, CA",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$150K/yr - $190K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4079558221/"
    },
    {
      "job_title": "SEO/SEM & PPC MARKETING SPECIALIST (On-Site Work Only /No remote work)",
      "company": "TLF Apparel",
      "description": "Job Description TLF’s SEO / SEM & PPC Marketing Specialist you will drive brand awareness and sales via customer acquisition strategies for www.TLFapparel.com and TLF’s Custom App. As an expert in SEO / SEM & PPC marketing, D2C lifecycle marketing, ecommerce consumer goods and shopping, and conversion optimization, you will use your expert knowledge in web, marketing, branding, and media buying strategies via organic and paid search, PPC, SEO, and SEM to leverage best practice digital marketing and growth hacking techniques. This position will be responsible for daily/weekly/monthly campaign development, media buying, implementation, on site and offsite SEO and backlinking, while reporting the corresponding data and KPI’s for these initiatives to the marketing department, leadership, and CEO on a daily/weekly/monthly/quarterly/ and annual basis. Job Description (Including But Not Limited To The Below) POSITION ROLES & RESPONSIBILITIES: Responsible for the day to day internal project planning, management, and scheduling of all digital marketing programs from conceptual development, campaign build out, media buying, through program delivery (publishing all digital marketing content in each platform) from top of funnel to bottom of funnel. Responsible for developing and executing well thought out digital marketing plans and creative content, including landing pages, sign up forms, customer data capturing, content marketing, SEO, video and image campaigns, copy, and CTA’s. Responsible for the development, management, and execution of a 7 figure annual adverting budget (operated with no less than a $350k a month digital marketing spend and budget). Create, implement, track, analyze and optimize large scale complex paid advertising campaigns on Google, Google Merchant and Shopping, Pinterest, X (Twitter), YouTube, Bing, Yahoo, Criteo and affiliate marketing platforms from top of funnel to bottom of funnel. Create, implement, track, analyze and optimize large scale complex digital marketing for all paid search (Google, Bing, Yahoo), Expert in Google Shopping and Google Merchant, Tiktok Shopping, X (Twitter) Shopping, Pinterest Shopping and catalog feeds and management. Expert in top of funnel to bottom of funnel for traffic, prospecting, acquisition, and retargeting, and ad spend management processes including daily reporting, performance analysis, bid and ROAS optimization. Track and provide reports on all marketing KPI’s, including lead conversion and ROAS/ROI of all marketing programs Manage, track, analyze, and optimize Google Search Console, SEMrush, and Triple Whale, reporting, research, platform auditing, and KPI management Expert in setting up, maintaining, optimization, reporting, and tracking data across all areas of G4 Expert in GTM pixel/tag management (Google Tag Manager) and implementation on all platforms and TLFapparel.com, as well as mapping of 1st party data for media usage and audience segmentation, and analyze 1st and third party attribution for reporting and attribution accuracy Strategize, Manage, and Implement audits, ongoing keyword analysis, research and optimization, competitive analysis and benchmarking, on site and off site marketing and affiliate implementation and optimization strategies, and back link strategies. Responsible for creating storylines, copy, CTA’s, and subject lines; developing and optimizing audiences and LAL’s, audience segmentation, and overall strategy behind all digital campaigns using analytics and strong narratives and assets that bring to life the company’s brand voice and messaging. Create project briefs and execute strategy working in harmony with creative designers, video production teams, and web team regarding the creation and deployment of all digital marketing campaigns and strategies and content/assets and on and offsite SEO needs, while developing timelines and ensuring the overall quality of the all initiatives. Create and deliver weekly, monthly, and quarterly reporting on campaign performance QUALIFICATIONS / SKILLS / REQUIREMENTS: Bachelor’s Degree in Marketing, Computer Science, or a related field Must have 3 year’s experience with Shopify Plus for ecommerce shopping and Hydrogen and Headless sites on Shopify’s Platform Highly proficient in web design, web optimization, H1 H5 tags , onsite and off site SEO, SEM, backlinking, and competitive benchmarking Must have managed and personally published, executed, and optimized a 7 figure annual budget for digital platforms (including but not limited to FB, IG, TikTok, YouTube, Google, Bind, Yahoo, X(Twitter), Pinterest, and Google Merchant and Shopping and operated with no less than a $350k a month digital marketing spend and budget withing the last 2 years Must have 7 years of experience in e commerce marketing and ecommerce shopping, paid and organic social, digital advertising, and SEO/SEM/PPC Must have 7 years of experience with apps and tools (such as: Google Analytics/ GA4, Google Search Console, Google Trends, Google Tag Manager, SEMrush, Triple Whale, Ecommerce Store Apps, Shopify, etc) Certified Google Analytics and Google Adwords Must have no less than 3 recent years experience in D2C consumer marketing, full funnel optimization Strong experience using Google Search Console, Google Trends Strong experience with bid management tools Strong Experience with A/B and multivariate experiments Up to date with the latest trends and best practices in SEO and SEM and search engine algorithms and use of AI and ChatGTP Excellent understanding of pixel implementation and tracking URL’s Expert skills with Microsoft Excel (must be comfortable analyzing large quantities of data utilizing advanced Excel formulas) Experience with creative design and Web Design, UX/UI, Adobe XD, Photoshop, Illustrator, and video production Strong quantitative, analytical and problem solving skills Proven record of business analysis driven and fact based decision making Highly productive and efficient with excellent time management skills Strong attention to detail, excellent organization skills, and ability to manage multiple projects/responsibilities through completion with minimal supervision Excellent verbal and written communication skills, including the ability to influence and persuade others with diplomacy and tact Company Description TLF was established in 2012 as a premium athletic and lifestyle apparel brand, pioneering a new category of Gym To Street® Wear products engineered for your toughest training sessions, designed to carry you through the rest of your day for wherever life takes you. Our mission is to provide products designed to push the limits of innovation and human performance to the highest possible level via fit, wearability, and functionality while simultaneously providing an exclusive sense of style and unparalleled quality. Our products are distributed and sold globally direct to consumers via TLFapparel.com and our TLF App. Join our team and work in a fun, fast paced, energetic environment with endless potential for individual and professional career growth. Our company culture does not micromanage its team members. Instead, we thrive on empowering people to be self motivated professionals who challenge themselves to work harder, smarter, and more efficiently as individuals and as part of a team. This winning formula creates a culture that inspires individuals and team members to continually set new and unprecedented goals that will continue to drive TLF to become a global leader in Gym To Street® Wear. What are you waiting for? Join the TLF “FAM“ and create a lasting career that will never feel like a job but instead like you are fulfilling a passion that will make history! Let’s REDEFINE IMPOSSIBLE® and TAKE LIFE FURTHER® together. BENEFITS (for full time employees only): Medical Dental Vision A free gym membership to TLF’s state of the art gym (aka TLF TRAINING LAB®) Access perks (A discounted database that offers a network of consumer perks) Chill, refuel, and recharge in our awesome employee lounge (unlimited coffee and tea) PS5 stations for gamers A monthly product allowance ($100) for our premium Gym To Street® Wear Continued education programs & training Employee team building events TIME OFF BENEFITS (for full time employees only): Vacation: 2 weeks a year (accrued at a rate of 3.08 per pay period) Sick Days: 6 days a year (accrued at a rate of 1.85 per pay period) Personal Days (PTO’s) 4 days a year (1 day accrued every quarter) 9 Paid Holidays 1 Floating Holiday (a day of your choosing) PART TIME/INTERN BENEFITS: TLF is an equal opportunity employer. We value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. TLF was established in 2012 as a premium athletic and lifestyle apparel brand, pioneering a new category of Gym To Street® Wear products engineered for your toughest training sessions, designed to carry you through the rest of your day for wherever life takes you. Our mission is to provide products designed to push the limits of innovation and human performance to the highest possible level via fit, wearability, and functionality while simultaneously providing an exclusive sense of style and unparalleled quality. Our products are distributed and sold globally direct to consumers via TLFapparel.com and our TLF App. Join our team and work in a fun, fast paced, energetic environment with endless potential for individual and professional career growth. Our company culture does not micromanage its team members. Instead, we thrive on empowering people to be self motivated professionals who challenge themselves to work harder, smarter, and more efficiently as individuals and as part of a team. This winning formula creates a culture that inspires individuals and team members to continually set new and unprecedented goals that will continue to drive TLF to become a global leader in Gym To Street® Wear. What are you waiting for? Join the TLF “FAM“ and create a lasting career that will never feel like a job but instead like you are fulfilling a passion that will make history! Let’s REDEFINE IMPOSSIBLE® and TAKE LIFE FURTHER® together. BENEFITS (for full time employees only): Medical Dental Vision A free gym membership to TLF’s state of the art gym (aka TLF TRAINING LAB®) Access perks (A discounted database that offers a network of consumer perks) Chill, refuel, and recharge in our awesome employee lounge (unlimited coffee and tea) PS5 stations for gamers A monthly product allowance ($100) for our premium Gym To Street® Wear Continued education programs & training Employee team building events TIME OFF BENEFITS (for full time employees only): Vacation: 2 weeks a year (accrued at a rate of 3.08 per pay period) Sick Days: 6 days a year (accrued at a rate of 1.85 per pay period) Personal Days (PTO’s) 4 days a year (1 day accrued every quarter) 9 Paid Holidays 1 Floating Holiday (a day of your choosing) PART TIME/INTERN BENEFITS: TLF is an equal opportunity employer. We value diversity at our company. We don't discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. show less",
      "date_posted": null,
      "location": "Fort Lauderdale, FL",
      "remote": "Onsite",
      "salary": "$350K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4091928816/"
    },
    {
      "job_title": "Marketing Manager, SEO, Amazon Flex",
      "company": "Amazon",
      "description": "Description This is an exciting role which involves complete ownership of Search Engine Optimization for Amazon Flex globally. The successful candidate will create and lead a strategy to improve Amazon Flex rankings on search engines, identifying critical customer needs and gaps and working with internal stakeholders and regional teams to share these learnings. Responsibilities will span unpaid channels, and require the review of past data and trends in order to continually iterate strategy. You will demonstrate an ability to clearly communicate to the right target audience, and be in charge of developing and deploying online content at both a global and regional level. You will work extremely closely with regional marketing teams to ensure that content or optimizations are tailored for the right audience. A successful candidate will have experience in leading and executing a SEO strategy either in house or agency side. You will be an analytical thinker who loves solving problems and strives to provide an excellent customer experience from the first interaction with the Amazon Flex website. The candidate will be customer obsessed and focused on delivering results with clear ROI. Excellent skills in Excel are also a required. This role is based out of Seattle. NYC can be considered as needed. Key job responsibilities Build an SEO strategy, focusing on growing Amazon Flex’s organic reach across our regions and showing how you will deploy content to acquire our target audiences within our unique delivery areas. Write and deploy original content for the Amazon Flex website, tailored for the right audience. Scope third party applications to support with SEO tasks, provide training to worldwide marketing stakeholders. Be the SME on Amazon Flex customer search behavior, needs and gaps and work with internal stakeholders to enhance the customer experience in other areas of the business. Monitor Delivery Partner sentiment in specific regions and act as the expert on their needs, including communicating back to the larger Amazon Flex team. Constantly check search results, ranking and analytics to monitor performance and make recommendations for improvements. Keep up to date with ever changing algorithm updates. Work with internal teams to share and learn best practices, and drive results between marketplaces. Collaborate with technical partner teams to explain and prioritize technical issues. A day in the life About The Team At Amazon, we're working to be the most Customer centric company on earth. One customer experience that we’re constantly looking to take to a new level is how we fulfill and deliver orders. Our goal is to exceed the expectations of all our customers by ensuring that their orders, no matter how large or small, are delivered where and when they need them, as quickly, accurately, and cost effectively as possible. To meet this goal, Amazon is continually striving to innovate and provide best in class service levels through the introduction of pioneering new products and services in the last mile delivery space. We are doing this by building a world class last mile operation, significantly complimented by Amazon Flex. Amazon Flex works directly with independent contractors – called delivery partners – to make deliveries to our customers. With Amazon Flex, individuals can now be their own boss delivering Amazon packages. Basic Qualifications 4+ years of proven experience in SEO strategy and execution, including technical SEO, content optimization, and link building. Proficiency in SEO tools such as Google Analytics/Adobe Analytics, Google Search Console, Ahrefs, SEMrush, Screaming Frog, or similar. Strong understanding of technical SEO, including crawling, indexing, and rendering, with experience conducting and resolving SEO audits. Strong ability to analyze SEO performance data and translate insights into actionable recommendations. Understanding of international SEO concepts such as hreflang tags and optimizing for multilingual/multiregional sites. Proven ability to manage multiple SEO projects simultaneously while collaborating with cross functional teams Preferred Qualifications Hands on experience managing SEO for multi site or international websites. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $98,200/year in our lowest geographic market up to $179,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company Amazon.com Services LLC Job ID: A2853616 show less",
      "date_posted": null,
      "location": "Bellevue, WA",
      "remote": "Onsite",
      "salary": "$98.2K/yr - $179.6K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4101115276/"
    },
    {
      "job_title": "Senior SEO Manager (Slack)",
      "company": "Salesforce",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Marketing & Communications Job Details About Salesforce We’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place. Slack is seeking a passionate and driven Senior SEO Manager to join our growing marketing team. In this role, you will play a critical part in developing and executing our global SEO strategy, driving organic growth across multiple regions. You are a highly analytical and collaborative individual with a proven track record of success in international SEO. You thrive in a fast paced environment and possess exceptional communication skills to effectively collaborate with cross functional teams. Responsibilities Global SEO Roadmap Ownership: Lead the development and execution of Slack's global SEO roadmap, collaborating closely with regional content teams and agencies to prioritize initiatives and drive organic growth. Collaboration & Strategy: Partner with product teams to ensure SEO requirements are integrated into the product roadmap, safeguarding SEO investments and advocating for organic search within the organization. Data Driven Decision Making: Utilize data to prioritize SEO initiatives, track performance, and measure the impact of improvements across regions. Continuously monitor industry trends and competitive landscapes to refine SEO strategies. Standardization & Best Practices: Establish and disseminate SEO best practices and guidelines across regions, ensuring consistency and alignment among teams. Performance Metrics: Define and track key performance indicators (KPIs) for SEO, working with regional teams to monitor progress and report on the health of technical SEO through audits and performance analysis. Cross Functional Leadership: Lead and motivate cross functional teams, fostering a collaborative environment to achieve shared goals. Effectively manage resources and scope to maintain project momentum and deliver results. Effective Communication: Communicate clearly and concisely with stakeholders at all levels, ensuring seamless collaboration and efficient resource allocation. Requirements 5+ Years of SEO Experience: Deep understanding of SEO methodologies, best practices, and industry trends, with a minimum of 5 years of hands on experience. International SEO Experience: Demonstrated success in managing and executing SEO strategies across multiple geographic regions, with a strong understanding of regional search nuances and cultural considerations. Multilingual SEO: Experience managing SEO for websites in different languages, including those you may not be fluent in. Hands on Approach: Willingness to \"roll up your sleeves\" and perform tasks such as on page optimization, content editing, and technical SEO analysis. Exceptional Project Management Skills: Proven ability to multitask, prioritize effectively, and manage multiple projects simultaneously to meet deadlines in a fast paced environment. Data Driven Approach: Strong analytical skills with the ability to leverage data to inform decisions, measure performance, and identify opportunities for improvement. Collaboration & Communication: Exceptional written and verbal communication skills, with the ability to build strong cross functional relationships and effectively convey complex information to both technical and non technical audiences. Technical Proficiency: Hands on experience with SEO tools such as SEMrush, Ahrefs, BrightEdge, and Screaming Frog. Bonus Points Experience working in the SaaS industry. Familiarity with agile methodologies. Benefits Competitive salary and benefits package. Opportunity to work on a globally recognized platform. Collaborative and supportive work environment. Be a part of a company that is changing the way the world works. If you are a passionate SEO professional with a proven track record of success and a desire to make a significant impact, we encourage you to apply! Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com. Salesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third party agency or company that does not have a signed agreement with Salesforce. Salesforce welcomes all. For Colorado based roles, the base salary hiring range for this position is $136,600 to $187,900. For Illinois based roles, the base salary hiring range for this position is $150,300 to $206,700. Compensation offered will be determined by factors such as location, level, job related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com. show less",
      "date_posted": null,
      "location": "Denver, CO",
      "remote": "Onsite",
      "salary": "$136.6K/yr - $206.7K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102106589/"
    },
    {
      "job_title": "Senior SEO Manager (Slack)",
      "company": "Salesforce",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Marketing & Communications Job Details About Salesforce We’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place. Slack is seeking a passionate and driven Senior SEO Manager to join our growing marketing team. In this role, you will play a critical part in developing and executing our global SEO strategy, driving organic growth across multiple regions. You are a highly analytical and collaborative individual with a proven track record of success in international SEO. You thrive in a fast paced environment and possess exceptional communication skills to effectively collaborate with cross functional teams. Responsibilities Global SEO Roadmap Ownership: Lead the development and execution of Slack's global SEO roadmap, collaborating closely with regional content teams and agencies to prioritize initiatives and drive organic growth. Collaboration & Strategy: Partner with product teams to ensure SEO requirements are integrated into the product roadmap, safeguarding SEO investments and advocating for organic search within the organization. Data Driven Decision Making: Utilize data to prioritize SEO initiatives, track performance, and measure the impact of improvements across regions. Continuously monitor industry trends and competitive landscapes to refine SEO strategies. Standardization & Best Practices: Establish and disseminate SEO best practices and guidelines across regions, ensuring consistency and alignment among teams. Performance Metrics: Define and track key performance indicators (KPIs) for SEO, working with regional teams to monitor progress and report on the health of technical SEO through audits and performance analysis. Cross Functional Leadership: Lead and motivate cross functional teams, fostering a collaborative environment to achieve shared goals. Effectively manage resources and scope to maintain project momentum and deliver results. Effective Communication: Communicate clearly and concisely with stakeholders at all levels, ensuring seamless collaboration and efficient resource allocation. Requirements 5+ Years of SEO Experience: Deep understanding of SEO methodologies, best practices, and industry trends, with a minimum of 5 years of hands on experience. International SEO Experience: Demonstrated success in managing and executing SEO strategies across multiple geographic regions, with a strong understanding of regional search nuances and cultural considerations. Multilingual SEO: Experience managing SEO for websites in different languages, including those you may not be fluent in. Hands on Approach: Willingness to \"roll up your sleeves\" and perform tasks such as on page optimization, content editing, and technical SEO analysis. Exceptional Project Management Skills: Proven ability to multitask, prioritize effectively, and manage multiple projects simultaneously to meet deadlines in a fast paced environment. Data Driven Approach: Strong analytical skills with the ability to leverage data to inform decisions, measure performance, and identify opportunities for improvement. Collaboration & Communication: Exceptional written and verbal communication skills, with the ability to build strong cross functional relationships and effectively convey complex information to both technical and non technical audiences. Technical Proficiency: Hands on experience with SEO tools such as SEMrush, Ahrefs, BrightEdge, and Screaming Frog. Bonus Points Experience working in the SaaS industry. Familiarity with agile methodologies. Benefits Competitive salary and benefits package. Opportunity to work on a globally recognized platform. Collaborative and supportive work environment. Be a part of a company that is changing the way the world works. If you are a passionate SEO professional with a proven track record of success and a desire to make a significant impact, we encourage you to apply! Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com. Salesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third party agency or company that does not have a signed agreement with Salesforce. Salesforce welcomes all. For Colorado based roles, the base salary hiring range for this position is $136,600 to $187,900. For Illinois based roles, the base salary hiring range for this position is $150,300 to $206,700. Compensation offered will be determined by factors such as location, level, job related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com. show less",
      "date_posted": null,
      "location": "Atlanta, GA",
      "remote": "Onsite",
      "salary": "$136.6K/yr - $206.7K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102106590/"
    },
    {
      "job_title": "Senior SEO Manager (Slack)",
      "company": "Salesforce",
      "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Marketing & Communications Job Details About Salesforce We’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place. Slack is seeking a passionate and driven Senior SEO Manager to join our growing marketing team. In this role, you will play a critical part in developing and executing our global SEO strategy, driving organic growth across multiple regions. You are a highly analytical and collaborative individual with a proven track record of success in international SEO. You thrive in a fast paced environment and possess exceptional communication skills to effectively collaborate with cross functional teams. Responsibilities Global SEO Roadmap Ownership: Lead the development and execution of Slack's global SEO roadmap, collaborating closely with regional content teams and agencies to prioritize initiatives and drive organic growth. Collaboration & Strategy: Partner with product teams to ensure SEO requirements are integrated into the product roadmap, safeguarding SEO investments and advocating for organic search within the organization. Data Driven Decision Making: Utilize data to prioritize SEO initiatives, track performance, and measure the impact of improvements across regions. Continuously monitor industry trends and competitive landscapes to refine SEO strategies. Standardization & Best Practices: Establish and disseminate SEO best practices and guidelines across regions, ensuring consistency and alignment among teams. Performance Metrics: Define and track key performance indicators (KPIs) for SEO, working with regional teams to monitor progress and report on the health of technical SEO through audits and performance analysis. Cross Functional Leadership: Lead and motivate cross functional teams, fostering a collaborative environment to achieve shared goals. Effectively manage resources and scope to maintain project momentum and deliver results. Effective Communication: Communicate clearly and concisely with stakeholders at all levels, ensuring seamless collaboration and efficient resource allocation. Requirements 5+ Years of SEO Experience: Deep understanding of SEO methodologies, best practices, and industry trends, with a minimum of 5 years of hands on experience. International SEO Experience: Demonstrated success in managing and executing SEO strategies across multiple geographic regions, with a strong understanding of regional search nuances and cultural considerations. Multilingual SEO: Experience managing SEO for websites in different languages, including those you may not be fluent in. Hands on Approach: Willingness to \"roll up your sleeves\" and perform tasks such as on page optimization, content editing, and technical SEO analysis. Exceptional Project Management Skills: Proven ability to multitask, prioritize effectively, and manage multiple projects simultaneously to meet deadlines in a fast paced environment. Data Driven Approach: Strong analytical skills with the ability to leverage data to inform decisions, measure performance, and identify opportunities for improvement. Collaboration & Communication: Exceptional written and verbal communication skills, with the ability to build strong cross functional relationships and effectively convey complex information to both technical and non technical audiences. Technical Proficiency: Hands on experience with SEO tools such as SEMrush, Ahrefs, BrightEdge, and Screaming Frog. Bonus Points Experience working in the SaaS industry. Familiarity with agile methodologies. Benefits Competitive salary and benefits package. Opportunity to work on a globally recognized platform. Collaborative and supportive work environment. Be a part of a company that is changing the way the world works. If you are a passionate SEO professional with a proven track record of success and a desire to make a significant impact, we encourage you to apply! Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com. Salesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third party agency or company that does not have a signed agreement with Salesforce. Salesforce welcomes all. For Colorado based roles, the base salary hiring range for this position is $136,600 to $187,900. For Illinois based roles, the base salary hiring range for this position is $150,300 to $206,700. Compensation offered will be determined by factors such as location, level, job related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com. show less",
      "date_posted": null,
      "location": "Chicago, IL",
      "remote": "Onsite",
      "salary": "$136.6K/yr - $206.7K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4102108252/"
    },
    {
      "job_title": "SEO Strategist",
      "company": "Verizon",
      "description": "When you join Verizon You want more out of a career. A place to share your ideas freely — even if they’re daring or different. Where the true you can learn, grow, and thrive. At Verizon, we power and empower how people live, work and play by connecting them to what brings them joy. We do what we love — driving innovation, creativity, and impact in the world. Our V Team is a community of people who anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together — lifting our communities and building trust in how we show up, everywhere & always. Want in? Join the V Team Life. What You’ll Be Doing... The Verizon Consumer Group is looking for a passionate SEO Strategist to join our growing and dynamic team. The role would be supporting the consumer home internet business by optimizing site experiences including on page, technical, and off page strategies and tactics. In addition to a deep understanding of all aspects of search engine optimization, the position also requires partnership across several marketing, design, and development teams to ensure search is at the forefront of the website strategy. The ideal candidate should be a data first marketer, who is comfortable supporting the creation and execution of large scale strategic initiatives for verizon.com. This is a rare opportunity to help pave the digital future for an innovative and integral brand. Responsibilities Include Supporting cohesive, compelling SEO strategies that guide the development & content processes. This may include site crawls, content audits, linking strategies, redirect mapping, local, and data analysis of site performance. Providing actionable insights for site improvement based on data and competitive gap analysis. Measuring and reporting out on the effectiveness of organic and marketing strategies and performance. Performing keyword research and on page optimizations for key marketing landing pages, articles, and ecommerce pages. Communicating strategic visions to internal stakeholders and partnering across business units, including merchandising, design, development, and IT teams. Managing product and project launches across the organization, including creating tickets, performing QAs, and keeping track of several fast moving pieces. Establishing and promoting SEO guidelines, best practices, and standards across business units, as well as expanding relationship with paid search for holistic search opportunities. Maintaining expert level understanding of latest industry trends, guidelines, and algorithm changes including AI, SGE, Helpful Content Updates, and more. What We’re Looking For You’ll need to have: Bachelor’s degree or four or more years of work experience. Four or more years of relevant experience required, demonstrated through work experience and/or military experience. Experience creating, presenting, and managing multiple SEO data and analysis projects at once. Experience with SEO tools to inform SEO strategy including but not limited to Google Sheets, Google Search Console, Adobe Analytics (Omniture), Looker Studio (Google Data Studio), SEMRush, SimilarWebPro, Ahrefs, Botify, and Screaming Frog. Experience communicating the value Search, Branding, Content, and IA have on KPIs and business drivers. Experience in measurement of both organic and paid search data. Even Better If You Have Marketing/agency/consultative services experience in SEO. Strong written and verbal communication skills, including email, presentations, and slide decks. If Verizon and this role sound like a fit for you, we encourage you to apply even if you don’t meet every “even better” qualification listed above. Where you’ll be working In this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager. Scheduled Weekly Hours 40 Equal Employment Opportunity We’re proud to be an equal opportunity employer and celebrate our employees’ differences, including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. At Verizon, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion page to learn more. Our benefits are designed to help you move forward in your career, and in areas of your life outside of Verizon. From health and wellness benefits, short term incentives, 401(k) Savings Plan, stock incentive programs, paid time off, parental leave, adoption assistance and tuition assistance, plus other incentives, we’ve got you covered with our award winning total rewards package. For part timers, your coverage will vary as you may be eligible for some of these benefits depending on your individual circumstances. If you are hired into a California, Colorado, Connecticut, Hawaii, Illinois, Maryland, Minnesota, Nevada, New York, Rhode Island, Washington or Washington, D.C. work location, the compensation range for this position is between $89,000.00 and $166,000.00 annually based on a full time schedule. The salary will vary depending on your location and confirmed job related skills and experience. This is an incentive based position with the potential to earn more. For part time roles, your compensation will be adjusted to reflect your hours. show less",
      "date_posted": null,
      "location": "Basking Ridge, NJ",
      "remote": "Lead SEO & Web Development Specialist -Remote with verification",
      "salary": "$89K/yr - $166K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4099346313/"
    },
    {
      "job_title": "Director, Content Marketing & SEO",
      "company": "PermitFlow",
      "description": "🚀 About PermitFlow PermitFlow’s mission is to streamline and simplify construction permitting in the $1.6 trillion United States construction market. Our software reduces time to permit, supporting permitting end to end including permit research, application preparation, submission, and monitoring. We’ve raised a $31m Series A led by Kleiner Perkins with participation from Initialized Capital, Y Combinator, Felicis Ventures, Altos Ventures, and the founders and executives from Zillow, PlanGrid, Thumbtack, Bluebeam, Uber, Procore, and more. Our team consists of architects, structural engineers, permitting experts, and workflow software specialists, all who have personally experienced the pain of permitting. ✋ Who you are? The Director, Content Marketing & SEO is a pivotal role responsible for creating and driving our full content strategy. This position requires an individual with strong experience in both content management and SEO in addition to a strong comfort with data. We’re looking for a strategic problem solver who is data driven, pragmatic, and process driven. You should be ready and excited to be a hands on operator, executing tactically as well as strategically. The Director will manage contracted content writers and other contractors, ensuring their efforts support the larger content and SEO vision. Tactically, this means owning keyword research, building a pipeline of relevant content ideas, and setting up our writers for success. This also means reviewing / copyediting content, posting content, and tracking results. As critical as tactical execution is a a willingness to experiment with AI and other novel data centric content strategies. We have a strong hypothesis that this individual will be able to have an outsized impact on the business via savvy adoption of new tools and techniques. We’re looking for a curious, driven tinkerer excited to design and run content / SEO experiments before formalizing long term programs around the most successful ones. ✅ What You’ll Do: Develop content strategies to further our position as thought leaders in the permitting space, making strategic decisions around channel, format, content, and more Own our SEO and website strategy, including keyword research, site architecture, and metrics tracking (incl. pipeline growth) Work with demand generation to identify and create content pieces serving the full marketing funnel, different personas, and campaigns Experiment with new content formats and channels (ex. webinars, customer interviews, video testimonials) Experiment and incorporate new technology and methodologies into our content and SEO programs, such as generative AI and programmatic SEO Create and develop our brand voice in such a way that our ICP and broader addressable market trust PermitFlow as a thought leader and source of truth Build and drive our content engine, creating a process for consistently producing high quality content pieces (likely involving a small group of freelance writers and contractors) Act as a copyeditor and reviewer to ensure high quality of external facing communications Communicate with sales and other departments to identity new content requirements, developing and executing on content in support of key campaigns and channels Stay apprised of the latest content marketing and SEO tactics and approaches to ensure our marketing remains fresh and ahead of the competition Report on key content and SEO metrics to track performance and identify opportunities to improve 🙌 Qualifications & Fit: Professional Background: 3+ years of experience supporting content and inbound strategies for B2B SaaS companies. Curiosity: Both SEO and Content are iterative programs. We’re looking for someone creative, proactive, and curious excited to experiment and push boundaries. Strong quant inclination: You can’t improve what you can’t measure. You love numbers, and you’re very comfortable in data tools. Strong communicator: Driven to \"cut through the noise\" with thoughtful, memorable and differentiating messages. Strong work ethic: You have the opportunity to build and lead a function as we grow. Motivated by a fast paced environment. Team player: Your success will be tied closely to the success of the functions you’re supporting. Seeing your success as their success is critical! NYC Based: This role is a hybrid role, with in person required Monday, Wednesday, and Friday in our Manhattan office. 💙 Benefits 📈 Equity packages 💰 Competitive Salary 🩺 100% Paid health, dental & vision coverage 🍽️ Lunch & Dinner provided w/ a fully stocked kitchen 🚍 Commuter benefits 🎤 Team building events 🌴 Unlimited PTO Compensation Range: $120K $160K show less",
      "date_posted": null,
      "location": "New York, NY",
      "remote": "VP, Data-Driven Marketing - Remote with verification",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4077776619/"
    }
  ]
}