{
  "metadata": {
    "job_title": "marketing_analyst",
    "company": "lhh",
    "timestamp": "2024-12-31 17:52:25",
    "file_id": "64621"
  },
  "jobs": [
    {
      "job_title": "Marketing Analyst",
      "company": "LHH",
      "description": "Marketing Campaign and Data Analyst Location: Remote Compensation: Starting at $70k Job Description: We are looking for a talented Marketing and Data Analyst to join our agency client's team. This role involves managing leads, executing marketing campaigns, analyzing results, and reporting for our clients. While agency experience is beneficial, it is not required. Key Responsibilities: Manage lead generation and campaign execution Track and analyze campaign performance, providing detailed reports Handle and execute marketing automation campaigns, including email campaigns and automation of inbound lead processing Manage sales funnel leads and conduct A/B testing on landing pages Analyze paid search performance, including ad copy, PPC, and budget results Identify areas for improvement and develop actionable recommendations Advise clients on strategies to enhance campaign effectiveness Communicate opportunities and insights within the internal team Qualifications: Minimum of 5 years of experience in marketing and data analysis Proficiency with Salesforce and marketing automation tools (e.g., Pardot) Experience in executing marketing automation activities Skilled in A/B testing and reporting on findings Strong analytical and problem solving abilities Excellent communication skills If you are a data driven marketing professional with a knack for optimizing campaigns and delivering strategic insights, we would love to hear from you! show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "Starting at $70K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4102651594/"
    },
    {
      "job_title": "Senior Marketing Analyst, Advanced Analytics",
      "company": "Siemens Digital Industries Software",
      "description": "Company Overview: Join our dynamic team at Siemens Digital Industries Software, where we are committed to driving growth and innovation in the marketing analytics space. We leverage cutting edge technologies and methodologies to deliver actionable insights that shape our marketing strategies and drive business success. Position Overview: We are seeking a highly skilled and experienced Senior Marketing Analyst, Advanced Analytics to join our team. The ideal candidate will have a strong background in marketing analytics, with a focus on advanced data analysis, revenue measurement, and strategic insights. This role will be instrumental in optimizing our marketing efforts and driving revenue growth. Key Responsibilities: Develop and implement advanced analytics strategies to support marketing initiatives. Utilize Forrester’s B2B Revenue Waterfall™ to align marketing and sales efforts around customer value and maximize revenue potential. Analyze and interpret complex data sets to provide actionable insights and recommendations. Measure and evaluate marketing performance using functional and impact metrics, ensuring alignment with business goals. Understand and support web analytics to track and optimize online marketing efforts. Leverage Microsoft Power BI for data visualization and reporting. Perform data cleaning and data engineering using dbt (data build tool). Utilize Oracle and Snowflake databases for data management and analysis. Apply knowledge of marketing technology, including Oracle Eloqua, Segment Data Capture, and Twilio Engage CDP. Collaborate with cross functional teams to identify and address opportunities within buying groups. Create and maintain dashboards and reports to track key performance indicators (KPIs) and marketing effectiveness. Conduct in depth analysis of marketing campaigns, customer behavior, and market trends. Present findings and recommendations to senior leadership and stakeholders. Qualifications: Bachelor’s degree in Marketing, Business, Statistics, or a related field; Master’s degree preferred. 10+ years of experience in marketing analytics or a related field. Proficiency in data analysis tools and software (e.g., SQL, Python, R, Tableau). Strong understanding of Forrester’s B2B Revenue Waterfall™ and its application in marketing and sales alignment. Experience with functional and impact metrics to measure marketing performance. Excellent analytical, problem solving, and communication skills. Ability to work collaboratively in a fast paced, dynamic environment. Soft Skills: Team Collaboration: Ability to work effectively with cross functional teams to achieve common goals. Adaptability: Flexibility to adjust to changing priorities and new challenges. Leadership: Capability to lead projects and mentor junior team members. Communication Skills: Strong verbal and written communication skills to convey complex information clearly. Attention to Detail: Keen eye for detail to ensure accuracy in data analysis and reporting. Strategic Thinking: Ability to think critically and strategically to drive business decisions. Process Optimization: Skills in optimizing processes to improve efficiency and effectiveness. Data Driven Decision Making: Proficiency in using data to inform and drive decision making processes. Cross Functional Collaboration: Experience working across different departments to achieve business objectives. Project Management: Strong project management skills to handle multiple tasks and deadlines. Advanced Analytics Skills: Expertise in advanced analytics techniques and tools. Stakeholder Engagement: Ability to engage and influence stakeholders at various levels of the organization. We look forward to welcoming a talented Senior Marketing Analyst to our team who is passionate about leveraging advanced analytics to drive marketing success and revenue growth. Apply today and be part of our innovative journey! Why us? Working at Siemens Software means flexibility Choosing between working at home and the office at other times is the norm here. We offer great benefits and rewards, as you'd expect from a world leader in industrial software. A collection of over 377,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit, and business need. Bring your curiosity and creativity and help us shape tomorrow! Siemens Software. Transform the Everyday The salary range for this position is $101,900 to $183,400 and this role is eligible to earn incentive compensation. The actual compensation offered is based on the successful candidate’s work location as well as additional factors, including job related skills, experience, and relevant education/training. Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible for time off in accordance with Company policies, including paid sick leave, paid parental leave, PTO (for non exempt employees) or non accrued flexible vacation (for exempt employees). #SWSaaS Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. Reasonable Accommodations If you require a reasonable accommodation in completing a job application, interviewing, completing any pre employment testing, or otherwise participating in the employee selection process, please fill out the accommodations form by clicking on this link Accommodation for disability form. If you’re unable to complete the form, you can reach out to our AskHR team for support at 1 866 743 6367. Please note our AskHR representatives do not have visibility of application or interview status. EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here. show less",
      "date_posted": null,
      "location": "Bellevue, WA",
      "remote": "Remote",
      "salary": "$101.9K/yr - $183.4K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4098191434/"
    },
    {
      "job_title": "Senior Marketing Analyst, Member",
      "company": "Carrot Fertility",
      "description": "About Carrot Carrot Fertility is the leading global fertility and family building platform providing care for everyone, everywhere. Trusted by more than a thousand multinational employers, health plans, and health systems, Carrot's comprehensive clinical program delivers industry leading cost savings for employers and award winning experiences for millions of people worldwide. From maternity through menopause and pre pregnancy through parenting, Carrot is dedicated to expanding access and improving outcomes. Carrot empowers members with compassionate, personalized, and inclusive support. The Role The Senior Marketing Analyst will serve as the analytics SME on the Growth and Engagement team, responsible for extracting, connecting, and analyzing complex member data across multiple sources (e.g., web, paid and unpaid marketing channels, marketing automation platforms, enterprise data warehouse) on a formal and ad hoc basis to effectively measure, benchmark, and evaluate the performance of member engagement campaigns, experiments, and other growth initiatives and make recommendations for improvements that will drive increased member engagement and revenue. About Candidates should possess exceptional collaboration and organizational skills, a keen eye for detail to quickly find, escalate, and resolve data discrepancies, and a deep sense of curiosity and creativity to get to the root of what the data is telling us about our members and what we can do as a result of the data to increase conversions across the member journey – from enrollment to engagement to retention. This role will: Own the marketing member data strategy Define and maintain team KPIs aligned with achieving business objectives and to identify trends, measure improvements over time, and tell the ROI story Conduct quality checks and drive continuous improvement in data collection, integration, and accuracy to instill confidence in data integrity among teams Collaborate with BI, data science, product, and engineering to meet current and future data collection needs that will enable the reliable build out and delivery of hyper targeted, personalized member campaigns, and ways to leverage advanced analytics and predictive insights for opportunity sizing and deeper engagement and growth Mentor team members and contribute to the BI body of knowledge through discussion and documentation This position combines deep analytical expertise with strategic thinking to help drive meaningful and sustainable member engagement, outcomes, and, importantly, revenue for our business. You will excel as a trusted advisor and creative problem solver and be able to navigate complex problems and processes while delivering well structured models and rigorous analyses tailored to business needs. The Team The Growth and Engagement team consists of high performers dedicated to ensuring employees are aware of the Carrot benefit, how to enroll, and how to maximize its value to drive sustainable and predictable engagement, retention, and revenue. This senior individual contributor role reports directly to the VP of Growth & Engagement and operates as an embedded extension of the Business Intelligence team, with close collaboration with Business Intelligence, Marketing Operations, Product, and Engineering. Minimum Qualifications Bachelor’s Degree in a quantitative field (statistics, marketing analytics, CS, or related) with a minimum of 5 7 years of relevant experience. 3+ years of hands on experience with B2C or B2B2C marketing analytics, A/B testing, campaign measurement, and lifecycle optimization across channels like email, SMS, social media, SEM. Experience in healthcare, tech, and/or health tech space is a plus. Familiarity with engagement based models and strategies and ways your work enabled revenue growth Proficiency with data warehouse platforms (e.g., Snowflake, AWS), web analytics tools (Google Analytics), paid marketing platforms (Google, Facebook), and marketing automation platforms (Blueshift, Salesforce Marketing Cloud) Experience with conversion funnel analytics, customer segmentation and personalized targeting strategies. Working knowledge of Python for data analysis. Familiarity with advanced analytics, machine learning, and predictive modeling techniques. Experience using dbt to model, test, and document data. Advanced knowledge of SQL and ability to write efficient and complex SQL queries. Experience with statistics concepts and analysis (e.g., hypothesis testing, regression). Expertise with data visualization software (e.g., Tableau, Domo). Comfort working with version control systems (Git preferred). Ability to execute on ambiguously defined questions and translate business requirements into technical requirements. Experience with best practices surrounding data governance, data modeling, and data quality. Excellent organizational skills with the ability to prioritize and adapt in a fast paced, high growth environment. Strong communication and data presentation skills with both marketing and technical teams. Compensation Carrot offers a holistic Total Rewards package designed to support our employees in all aspects of their life inside and outside of work, including health and wellness benefits, retirement savings plans, short and long term incentives, parental leave, family forming assistance, and a competitive compensation package. The starting base salary for this position will range from $140,000.00 $160,000.00. Actual compensation may vary from posted base salary depending on your confirmed job related skills and experience. Why Carrot? Carrot has received national and international recognition for its pioneering work, including Best Diversity, Equity, & Inclusion Product from the Anthem Awards, Fast Company's Most Innovative Companies, CNBC's 100 Barrier Breaking Startups, and more. Carrot is regularly featured in media reporting on issues related to the future of work, women in leadership, healthcare innovation and diversity, equity, and inclusion, including MSNBC, The Economist, Bloomberg, The Wall Street Journal, CNBC, National Public Radio, Harvard Business Review, and more. Carrot teams span more than 40 states across the United States and dozens of countries around the world. Carrot has received numerous workplace awards, including Fortune's Best Workplaces in Healthcare, Quartz’s Best Companies for Remote Workers, and Great Place to Work and Age Friendly Employer certifications. Learn more at carrotfertility.com. show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$140K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4007084974/"
    },
    {
      "job_title": "Sr. Marketing Analyst, NA Sales & Marketing",
      "company": "Amazon",
      "description": "Description The Amazon Cross Devices Marketing team is seeking an experienced Sr. Business Analyst with broad technical skills to develop in depth business understanding, perform deep dives, develop data visualizations and build automation solutions that drive business decision making and process improvement. The ideal candidate will draw upon advanced analytical, problem solving skills, and passion for delivering business insights and analytics. We look for candidates who are excellent communicators, self motivated, flexible, hardworking, and who like to have fun. This is critical role for the organization and requires an individual with effective communication skills, outstanding business acumen, and the ability to work across various functional teams and internal partner teams. We are looking for individuals who are self starters comfortable with ambiguity, demonstrate strong attention to detail, and have the ability to work in a fast paced and ever changing environment. Key job responsibilities This role will be responsible for providing regular analysis and insight to marketing channel and Devices product line leaders.This role will be expected to proactively identify trends and facilitate analysis to identify issues and opportunities that impact Devices and Amazon wide traffic. The ideal candidate will have an extensive background in running SQL queries, performing deep dives and generating actionable insights. About The Team Amazon Devices—the team behind the best selling Amazon Echo, Kindle E Reader, Fire Tablet, Fire TV, and Ring, Blink, and eero Home Security product lines—is seeking a high performing, innovative, results oriented and customer obsessed, Sr. Marketing Analyst. As part of the cross devices marketing group, we operate in one of the most diverse businesses at Amazon, empowered to explore new ideas, channels, and tools, setting the stage for how we’ll do business tomorrow. Basic Qualifications Bachelor's degree 5+ years of writing SQL queries , performing deep dives and creating business intelligence reports using Tableau, Power BI experience Designing and implementing reporting solutions to enable stakeholders to manage the business and make effective decisions. Building and monitoring related key performance indicators (KPIs) to measure, control, and benchmark reporting processes. In depth business understanding and the ability to defining requirements, using data and metrics to draw business insights. Results oriented, prioritizes work activities, plans and stays organized in order to meet commitments. Ability to deal with ambiguity and competing objectives in a fast paced environment. Strong written, verbal communication, and presentation skills to senior audience. Preferred Qualifications Master's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field Fluency in a modeling language such as Python or R Strong background in statistics methodology, applications to business problems, and/or big data Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $128,600/year in our lowest geographic market up to $212,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company Amazon.com Services LLC Job ID: A2849244 show less",
      "date_posted": null,
      "location": "Seattle, WA",
      "remote": "Onsite",
      "salary": "$128.6K/yr - $212.6K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4096034833/"
    },
    {
      "job_title": "Sr. Marketing Analyst, NA Sales & Marketing",
      "company": "Amazon",
      "description": "Description The Amazon Cross Devices Marketing team is seeking an experienced Sr. Business Analyst with broad technical skills to develop in depth business understanding, perform deep dives, develop data visualizations and build automation solutions that drive business decision making and process improvement. The ideal candidate will draw upon advanced analytical, problem solving skills, and passion for delivering business insights and analytics. We look for candidates who are excellent communicators, self motivated, flexible, hardworking, and who like to have fun. This is critical role for the organization and requires an individual with effective communication skills, outstanding business acumen, and the ability to work across various functional teams and internal partner teams. We are looking for individuals who are self starters comfortable with ambiguity, demonstrate strong attention to detail, and have the ability to work in a fast paced and ever changing environment. Key job responsibilities This role will be responsible for providing regular analysis and insight to marketing channel and Devices product line leaders.This role will be expected to proactively identify trends and facilitate analysis to identify issues and opportunities that impact Devices and Amazon wide traffic. The ideal candidate will have an extensive background in running SQL queries, performing deep dives and generating actionable insights. About The Team Amazon Devices—the team behind the best selling Amazon Echo, Kindle E Reader, Fire Tablet, Fire TV, and Ring, Blink, and eero Home Security product lines—is seeking a high performing, innovative, results oriented and customer obsessed, Sr. Marketing Analyst. As part of the cross devices marketing group, we operate in one of the most diverse businesses at Amazon, empowered to explore new ideas, channels, and tools, setting the stage for how we’ll do business tomorrow. Basic Qualifications Bachelor's degree 5+ years of writing SQL queries , performing deep dives and creating business intelligence reports using Tableau, Power BI experience Designing and implementing reporting solutions to enable stakeholders to manage the business and make effective decisions. Building and monitoring related key performance indicators (KPIs) to measure, control, and benchmark reporting processes. In depth business understanding and the ability to defining requirements, using data and metrics to draw business insights. Results oriented, prioritizes work activities, plans and stays organized in order to meet commitments. Ability to deal with ambiguity and competing objectives in a fast paced environment. Strong written, verbal communication, and presentation skills to senior audience. Preferred Qualifications Master's degree in finance, accounting, business, economics, engineering , analytics, mathematics, statistics or a related technical or quantitative field Fluency in a modeling language such as Python or R Strong background in statistics methodology, applications to business problems, and/or big data Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how we hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner. Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $128,600/year in our lowest geographic market up to $212,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site. Company Amazon.com Services LLC Job ID: A2817724 show less",
      "date_posted": null,
      "location": "Seattle, WA",
      "remote": "Onsite",
      "salary": "$128.6K/yr - $212.6K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4063567110/"
    },
    {
      "job_title": "Senior Marketing Analyst, Advanced Analytics",
      "company": "Siemens Digital Industries Software",
      "description": "Company Overview: Join our dynamic team at Siemens Digital Industries Software, where we are committed to driving growth and innovation in the marketing analytics space. We leverage cutting edge technologies and methodologies to deliver actionable insights that shape our marketing strategies and drive business success. Position Overview: We are seeking a highly skilled and experienced Senior Marketing Analyst, Advanced Analytics to join our team. The ideal candidate will have a strong background in marketing analytics, with a focus on advanced data analysis, revenue measurement, and strategic insights. This role will be instrumental in optimizing our marketing efforts and driving revenue growth. Key Responsibilities: Develop and implement advanced analytics strategies to support marketing initiatives. Utilize Forrester’s B2B Revenue Waterfall™ to align marketing and sales efforts around customer value and maximize revenue potential. Analyze and interpret complex data sets to provide actionable insights and recommendations. Measure and evaluate marketing performance using functional and impact metrics, ensuring alignment with business goals. Understand and support web analytics to track and optimize online marketing efforts. Leverage Microsoft Power BI for data visualization and reporting. Perform data cleaning and data engineering using dbt (data build tool). Utilize Oracle and Snowflake databases for data management and analysis. Apply knowledge of marketing technology, including Oracle Eloqua, Segment Data Capture, and Twilio Engage CDP. Collaborate with cross functional teams to identify and address opportunities within buying groups. Create and maintain dashboards and reports to track key performance indicators (KPIs) and marketing effectiveness. Conduct in depth analysis of marketing campaigns, customer behavior, and market trends. Present findings and recommendations to senior leadership and stakeholders. Qualifications: Bachelor’s degree in Marketing, Business, Statistics, or a related field; Master’s degree preferred. 10+ years of experience in marketing analytics or a related field. Proficiency in data analysis tools and software (e.g., SQL, Python, R, Tableau). Strong understanding of Forrester’s B2B Revenue Waterfall™ and its application in marketing and sales alignment. Experience with functional and impact metrics to measure marketing performance. Excellent analytical, problem solving, and communication skills. Ability to work collaboratively in a fast paced, dynamic environment. Soft Skills: Team Collaboration: Ability to work effectively with cross functional teams to achieve common goals. Adaptability: Flexibility to adjust to changing priorities and new challenges. Leadership: Capability to lead projects and mentor junior team members. Communication Skills: Strong verbal and written communication skills to convey complex information clearly. Attention to Detail: Keen eye for detail to ensure accuracy in data analysis and reporting. Strategic Thinking: Ability to think critically and strategically to drive business decisions. Process Optimization: Skills in optimizing processes to improve efficiency and effectiveness. Data Driven Decision Making: Proficiency in using data to inform and drive decision making processes. Cross Functional Collaboration: Experience working across different departments to achieve business objectives. Project Management: Strong project management skills to handle multiple tasks and deadlines. Advanced Analytics Skills: Expertise in advanced analytics techniques and tools. Stakeholder Engagement: Ability to engage and influence stakeholders at various levels of the organization. We look forward to welcoming a talented Senior Marketing Analyst to our team who is passionate about leveraging advanced analytics to drive marketing success and revenue growth. Apply today and be part of our innovative journey! Why us? Working at Siemens Software means flexibility Choosing between working at home and the office at other times is the norm here. We offer great benefits and rewards, as you'd expect from a world leader in industrial software. A collection of over 377,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit, and business need. Bring your curiosity and creativity and help us shape tomorrow! Siemens Software. Transform the Everyday The salary range for this position is $101,900 to $183,400 and this role is eligible to earn incentive compensation. The actual compensation offered is based on the successful candidate’s work location as well as additional factors, including job related skills, experience, and relevant education/training. Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible for time off in accordance with Company policies, including paid sick leave, paid parental leave, PTO (for non exempt employees) or non accrued flexible vacation (for exempt employees). #SWSaaS Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. Reasonable Accommodations If you require a reasonable accommodation in completing a job application, interviewing, completing any pre employment testing, or otherwise participating in the employee selection process, please fill out the accommodations form by clicking on this link Accommodation for disability form. If you’re unable to complete the form, you can reach out to our AskHR team for support at 1 866 743 6367. Please note our AskHR representatives do not have visibility of application or interview status. EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here. show less",
      "date_posted": null,
      "location": "Wilsonville, OR",
      "remote": "Remote",
      "salary": "$101.9K/yr - $183.4K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4098188636/"
    },
    {
      "job_title": "Senior Marketing Analyst, Advanced Analytics",
      "company": "Siemens Digital Industries Software",
      "description": "Company Overview: Join our dynamic team at Siemens Digital Industries Software, where we are committed to driving growth and innovation in the marketing analytics space. We leverage cutting edge technologies and methodologies to deliver actionable insights that shape our marketing strategies and drive business success. Position Overview: We are seeking a highly skilled and experienced Senior Marketing Analyst, Advanced Analytics to join our team. The ideal candidate will have a strong background in marketing analytics, with a focus on advanced data analysis, revenue measurement, and strategic insights. This role will be instrumental in optimizing our marketing efforts and driving revenue growth. Key Responsibilities: Develop and implement advanced analytics strategies to support marketing initiatives. Utilize Forrester’s B2B Revenue Waterfall™ to align marketing and sales efforts around customer value and maximize revenue potential. Analyze and interpret complex data sets to provide actionable insights and recommendations. Measure and evaluate marketing performance using functional and impact metrics, ensuring alignment with business goals. Understand and support web analytics to track and optimize online marketing efforts. Leverage Microsoft Power BI for data visualization and reporting. Perform data cleaning and data engineering using dbt (data build tool). Utilize Oracle and Snowflake databases for data management and analysis. Apply knowledge of marketing technology, including Oracle Eloqua, Segment Data Capture, and Twilio Engage CDP. Collaborate with cross functional teams to identify and address opportunities within buying groups. Create and maintain dashboards and reports to track key performance indicators (KPIs) and marketing effectiveness. Conduct in depth analysis of marketing campaigns, customer behavior, and market trends. Present findings and recommendations to senior leadership and stakeholders. Qualifications: Bachelor’s degree in Marketing, Business, Statistics, or a related field; Master’s degree preferred. 10+ years of experience in marketing analytics or a related field. Proficiency in data analysis tools and software (e.g., SQL, Python, R, Tableau). Strong understanding of Forrester’s B2B Revenue Waterfall™ and its application in marketing and sales alignment. Experience with functional and impact metrics to measure marketing performance. Excellent analytical, problem solving, and communication skills. Ability to work collaboratively in a fast paced, dynamic environment. Soft Skills: Team Collaboration: Ability to work effectively with cross functional teams to achieve common goals. Adaptability: Flexibility to adjust to changing priorities and new challenges. Leadership: Capability to lead projects and mentor junior team members. Communication Skills: Strong verbal and written communication skills to convey complex information clearly. Attention to Detail: Keen eye for detail to ensure accuracy in data analysis and reporting. Strategic Thinking: Ability to think critically and strategically to drive business decisions. Process Optimization: Skills in optimizing processes to improve efficiency and effectiveness. Data Driven Decision Making: Proficiency in using data to inform and drive decision making processes. Cross Functional Collaboration: Experience working across different departments to achieve business objectives. Project Management: Strong project management skills to handle multiple tasks and deadlines. Advanced Analytics Skills: Expertise in advanced analytics techniques and tools. Stakeholder Engagement: Ability to engage and influence stakeholders at various levels of the organization. We look forward to welcoming a talented Senior Marketing Analyst to our team who is passionate about leveraging advanced analytics to drive marketing success and revenue growth. Apply today and be part of our innovative journey! Why us? Working at Siemens Software means flexibility Choosing between working at home and the office at other times is the norm here. We offer great benefits and rewards, as you'd expect from a world leader in industrial software. A collection of over 377,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit, and business need. Bring your curiosity and creativity and help us shape tomorrow! Siemens Software. Transform the Everyday The salary range for this position is $101,900 to $183,400 and this role is eligible to earn incentive compensation. The actual compensation offered is based on the successful candidate’s work location as well as additional factors, including job related skills, experience, and relevant education/training. Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible for time off in accordance with Company policies, including paid sick leave, paid parental leave, PTO (for non exempt employees) or non accrued flexible vacation (for exempt employees). #SWSaaS Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. Reasonable Accommodations If you require a reasonable accommodation in completing a job application, interviewing, completing any pre employment testing, or otherwise participating in the employee selection process, please fill out the accommodations form by clicking on this link Accommodation for disability form. If you’re unable to complete the form, you can reach out to our AskHR team for support at 1 866 743 6367. Please note our AskHR representatives do not have visibility of application or interview status. EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here. show less",
      "date_posted": null,
      "location": "Plano, TX",
      "remote": "Remote",
      "salary": "$101.9K/yr - $183.4K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4098189578/"
    },
    {
      "job_title": "Senior Marketing Analyst, Advanced Analytics",
      "company": "Siemens Digital Industries Software",
      "description": "Company Overview: Join our dynamic team at Siemens Digital Industries Software, where we are committed to driving growth and innovation in the marketing analytics space. We leverage cutting edge technologies and methodologies to deliver actionable insights that shape our marketing strategies and drive business success. Position Overview: We are seeking a highly skilled and experienced Senior Marketing Analyst, Advanced Analytics to join our team. The ideal candidate will have a strong background in marketing analytics, with a focus on advanced data analysis, revenue measurement, and strategic insights. This role will be instrumental in optimizing our marketing efforts and driving revenue growth. Key Responsibilities: Develop and implement advanced analytics strategies to support marketing initiatives. Utilize Forrester’s B2B Revenue Waterfall™ to align marketing and sales efforts around customer value and maximize revenue potential. Analyze and interpret complex data sets to provide actionable insights and recommendations. Measure and evaluate marketing performance using functional and impact metrics, ensuring alignment with business goals. Understand and support web analytics to track and optimize online marketing efforts. Leverage Microsoft Power BI for data visualization and reporting. Perform data cleaning and data engineering using dbt (data build tool). Utilize Oracle and Snowflake databases for data management and analysis. Apply knowledge of marketing technology, including Oracle Eloqua, Segment Data Capture, and Twilio Engage CDP. Collaborate with cross functional teams to identify and address opportunities within buying groups. Create and maintain dashboards and reports to track key performance indicators (KPIs) and marketing effectiveness. Conduct in depth analysis of marketing campaigns, customer behavior, and market trends. Present findings and recommendations to senior leadership and stakeholders. Qualifications: Bachelor’s degree in Marketing, Business, Statistics, or a related field; Master’s degree preferred. 10+ years of experience in marketing analytics or a related field. Proficiency in data analysis tools and software (e.g., SQL, Python, R, Tableau). Strong understanding of Forrester’s B2B Revenue Waterfall™ and its application in marketing and sales alignment. Experience with functional and impact metrics to measure marketing performance. Excellent analytical, problem solving, and communication skills. Ability to work collaboratively in a fast paced, dynamic environment. Soft Skills: Team Collaboration: Ability to work effectively with cross functional teams to achieve common goals. Adaptability: Flexibility to adjust to changing priorities and new challenges. Leadership: Capability to lead projects and mentor junior team members. Communication Skills: Strong verbal and written communication skills to convey complex information clearly. Attention to Detail: Keen eye for detail to ensure accuracy in data analysis and reporting. Strategic Thinking: Ability to think critically and strategically to drive business decisions. Process Optimization: Skills in optimizing processes to improve efficiency and effectiveness. Data Driven Decision Making: Proficiency in using data to inform and drive decision making processes. Cross Functional Collaboration: Experience working across different departments to achieve business objectives. Project Management: Strong project management skills to handle multiple tasks and deadlines. Advanced Analytics Skills: Expertise in advanced analytics techniques and tools. Stakeholder Engagement: Ability to engage and influence stakeholders at various levels of the organization. We look forward to welcoming a talented Senior Marketing Analyst to our team who is passionate about leveraging advanced analytics to drive marketing success and revenue growth. Apply today and be part of our innovative journey! Why us? Working at Siemens Software means flexibility Choosing between working at home and the office at other times is the norm here. We offer great benefits and rewards, as you'd expect from a world leader in industrial software. A collection of over 377,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality, and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit, and business need. Bring your curiosity and creativity and help us shape tomorrow! Siemens Software. Transform the Everyday The salary range for this position is $101,900 to $183,400 and this role is eligible to earn incentive compensation. The actual compensation offered is based on the successful candidate’s work location as well as additional factors, including job related skills, experience, and relevant education/training. Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible for time off in accordance with Company policies, including paid sick leave, paid parental leave, PTO (for non exempt employees) or non accrued flexible vacation (for exempt employees). #SWSaaS Equal Employment Opportunity Statement Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. Reasonable Accommodations If you require a reasonable accommodation in completing a job application, interviewing, completing any pre employment testing, or otherwise participating in the employee selection process, please fill out the accommodations form by clicking on this link Accommodation for disability form. If you’re unable to complete the form, you can reach out to our AskHR team for support at 1 866 743 6367. Please note our AskHR representatives do not have visibility of application or interview status. EEO is the Law Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Pay Transparency Non Discrimination Provision Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. California Privacy Notice California residents have the right to receive additional notices about their personal information. To learn more, click here. show less",
      "date_posted": null,
      "location": "Livonia, MI",
      "remote": "Remote",
      "salary": "$101.9K/yr - $183.4K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4098185946/"
    },
    {
      "job_title": "Senior Digital Marketing Analyst- Remote",
      "company": "TE Connectivity",
      "description": "At TE, you will unleash your potential working with people from diverse backgrounds and industries to create a safer, sustainable and more connected world. As a member of the Digital Data Networks (DDN) Marketing team, the Senior Digital Marketing Analyst is responsible for driving extraordinary digital experience for DDN’s target customers This position reports to the Digital Marketing Manager of DDN and is responsible for optimizing customer paths across digital channels (including but not limited to TE.com, search, paid & earned media and distributor websites), displaying compelling content and generating insights from analytics for further improvements. The role will ensure a best in class digital experience that generates awareness, engagement, leads and ultimately business growth in target markets and from target customers. The ideal candidate will have demonstrated experience planning & implementing digital enhancements to fulfill customer needs and solve business problems, leading cross functional teams to plan and take solid actions to implement solutions, as well as measuring program effectiveness to generate and enable business growth. The person should have a keen eye for commercial needs that tie with digital trends and solutions. This individual must be skilled in cross functional and matrixed organizations. She/he will be self directed and able to flawlessly execute on a broad spectrum of digital projects while partnering with multiple stakeholders globally. Responsibilities Identify and prioritize commercial needs and problems to solve via digital enhancements Plan and manage digital enhancements to expand customer reach and improve customer experience across channels Lead cross functional teams & workshops to initiate, align and track collaborative digital experience improvement efforts. Manage digital properties & platforms to deliver an excellent experience, driving revenue potential and brand relevance. Execute organic and paid search plans that will increase findability, conduct keyword research and manage process to optimize content for improved search effectiveness. Manage the DDN website pages and identify opportunities for navigation experience improvement and support strategic business growth goals. Conduct digital analysis to generate customer journey insights and identify opportunities for better customer experience & business growth. Make recommendations for technology and digital capabilities that will enable the business unit to deliver an optimized & personalized customer experience across channels. Background & Qualifications BA/BS – preferably advanced education and/or coursework At least 7 years’ experience in digital marketing Good understanding of B2B customer journey, with customer centric and commercial driven mindset Result oriented mindset, with ability and willingness to challenge the status quo Strong project management skills Excellent interpersonal, organizational and leadership skills Experience with the full marketing mix across paid, owned, and earned channels Proficient in mainstream digital platforms & tools, including but not limited to SEO/SEM (SEMrush, Google Ads), content publishing (AEM), analysis (Adobe/Google Analytics,), and proficient in MS Office. Strong analytics skills to drive insights & measure success Competencies SET: Strategy, Execution, Talent (for managers) Values: Integrity, Accountability, Teamwork, Innovation About Te Connectivity TE Connectivity is a global industrial technology leader creating a safer, sustainable, productive, and connected future. Our broad range of connectivity and sensor solutions enable the distribution of power, signal and data to advance next generation transportation, renewable energy, automated factories, data centers, medical technology and more. With more than 85,000 employees, including 8,000 engineers, working alongside customers in approximately 140 countries. TE ensures that EVERY CONNECTION COUNTS. Learn more at www.te.com and on LinkedIn, Facebook, WeChat, Instagram and X (formerly Twitter). Compensation Competitive base salary commensurate with experience: $114,600 171,800 (subject to change dependent on physical location) Posted salary ranges are made in good faith. TE Connectivity reserves the right to adjust ranges depending on the experience/qualification of the selected candidate as well as internal and external equity. Total Compensation = Base Salary + Incentive(s) + Benefits Benefits A comprehensive benefits package including health insurance, 401(k), disability, life insurance, employee stock purchase plan, paid time off and voluntary benefits. EOE, Including Disability/Vets show less",
      "date_posted": null,
      "location": "United States",
      "remote": "",
      "salary": "$114.6K/yr - $171.8K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4075906839/"
    },
    {
      "job_title": "Sr. Product Marketing Analyst",
      "company": "Lam Research",
      "description": "In Your Career, Let’s Prove What’s Possible. At Lam Research, we create equipment that drives technological advancements in the semiconductor industry. Our innovative solutions enable chipmakers to power progress in nearly all aspects of modern life, and it takes each member of our team to make it possible. Across our organization, our employees come to work and change the world. We take on the toughest challenges with precision and accuracy. We push for the next big semiconductor breakthrough. We lead the way in one of the most critical and fast moving industries on the planet. And we do it together, with deep connections and limitless collaboration. The impact we have on the world is made possible by focusing on our people. So we recognize and celebrate our teams’ achievements. We strive to create an inclusive and diverse culture where everyone’s contribution and voice has value. We evaluate and evolve our offerings, so our people receive the support and empowerment to do meaningful things for their lives, careers, and communities. Because at Lam, we believe that when people are the priority and they’re inspired to unleash the power of innovation for a better world together, anything is possible. Sr. Product Marketing Analyst Date: Dec 16, 2024 Location: Fremont, CA, US, 94538 Req ID: 185309 Worker Category: On site Flex The Group You’ll Be A Part Of The Customer Support Business Group focuses on enabling our customers with premier customer support throughout their lifecycle with Lam. We drive performance, productivity, safety, and quality of customers installed base performance and deliver service and lifecycle solutions for their most critical equipment and processes. The Impact You’ll Make Provides support for the product marketing function through research and analysis of the company's markets, competition and product mix. Researches and makes presentations on new market areas. Analyzes the competitive environment and future trends and makes recommendations based on findings. May publish regular updates on market conditions to track company progress in specialized market niches or product technology disciplines. What You’ll Do This position is a Product Marketing Senior Analyst reporting to the Director of Product Marketing for the CSBG Upgrades organization at Lam. The Customer Support Business Group (CSBG) organization at Lam has a large group of products in the areas of wet metal deposition, dry metal deposition, dielectric deposition, and wet clean serving the semiconductor fabrication in integrated circuit and packaging. In addition to systems, CSBG product offerings include upgrades, spares, and services. The Analyst’s responsibility will be to work with the Product Marketing and Product Management teams to ensure standard product options and non standard customer special requests are structured and priced in Lam’s CRM. As new options and product configurations are released, the Analyst will maintain the pricing and configuration integrity among the CSBG products. The Analyst will serve as the point of contact to Lam’s business operations team for all CSBG products to ensure the timely pricing of all configurations. In addition, the Analyst may work with Product Marketing owning the total addressable market (TAM), serviceable addressable market (SAM) and marketing share model integrity for CSBG. This will also include running market share and scenario assessments. Who We’re Looking For 5 years of product management, product marketing or business operations experience in hardware product company, preferably in semiconductor equipment. Prefer an MBA. A combination of analytical, problem solving, and communication skills. Excellent data and analytical skills with attention to detail in data, calculations, and output integrity. This should include generating analytical and financial models, revision tracking, and output reporting. The candidate needs to be able to thrive in a varied, fast paced, high energy environment working with various groups at Lam. Most models will be done within Microsoft Excel or Lam’s business systems. Preferred Qualifications Our Commitment We believe it is important for every person to feel valued, included, and empowered to achieve their full potential. By bringing unique individuals and viewpoints together, we achieve extraordinary results. Lam Research (\"Lam\" or the \"Company\") is an equal opportunity employer. Lam is committed to and reaffirms support of equal opportunity in employment and non discrimination in employment policies, practices and procedures on the basis of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex (including pregnancy, childbirth and related medical conditions), gender, gender identity, gender expression, age, sexual orientation, or military and veteran status or any other category protected by applicable federal, state, or local laws. It is the Company's intention to comply with all applicable laws and regulations. Company policy prohibits unlawful discrimination against applicants or employees. Lam offers a variety of work location models based on the needs of each role. Our hybrid roles combine the benefits of on site collaboration with colleagues and the flexibility to work remotely and fall into two categories – On site Flex and Virtual Flex. ‘On site Flex’ you’ll work 3+ days per week on site at a Lam or customer/supplier location, with the opportunity to work remotely for the balance of the week. ‘Virtual Flex’ you’ll work 1 2 days per week on site at a Lam or customer/supplier location, and remotely the rest of the time. Salary CA San Francisco Bay Area Salary Range for this position: $111,000.00 $244,000.00. The above salary range for this position is relevant to applicants that reside or work onsite in the California, San Francisco Bay Area only. Salary offers will depend on factors that include the location you work from, your level, education, training, specific skills, years of experience and comparison to other employees already in this role. Actual salary may vary from salary offered due to numerous factors including but not limited to unpaid time off, unpaid leave, company mandated shutdown, and other relevant factors. Our Perks And Benefits At Lam, our people make amazing things possible. That’s why we invest in you throughout the phases of your life with a comprehensive set of outstanding benefits. Discover more at Lam Benefits Nearest Major Market: San Francisco Nearest Secondary Market: Oakland Job Segment: Senior Product Manager, CRM, Product Manager, Operations, Technology, Research, Customer Service show less",
      "date_posted": null,
      "location": "Fremont, CA",
      "remote": "Onsite",
      "salary": "$111K/yr - $244K/yr\nMatches your job preferences, minimum pay preference is 175000.",
      "job_url": "https://www.linkedin.com/jobs/view/4030102007/"
    },
    {
      "job_title": "Senior Digital Marketing Analyst- Remote",
      "company": "TE Connectivity",
      "description": "At TE, you will unleash your potential working with people from diverse backgrounds and industries to create a safer, sustainable and more connected world. As a member of the Digital Data Networks (DDN) Marketing team, the Senior Digital Marketing Analyst is responsible for driving extraordinary digital experience for DDN’s target customers This position reports to the Digital Marketing Manager of DDN and is responsible for optimizing customer paths across digital channels (including but not limited to TE.com, search, paid & earned media and distributor websites), displaying compelling content and generating insights from analytics for further improvements. The role will ensure a best in class digital experience that generates awareness, engagement, leads and ultimately business growth in target markets and from target customers. The ideal candidate will have demonstrated experience planning & implementing digital enhancements to fulfill customer needs and solve business problems, leading cross functional teams to plan and take solid actions to implement solutions, as well as measuring program effectiveness to generate and enable business growth. The person should have a keen eye for commercial needs that tie with digital trends and solutions. This individual must be skilled in cross functional and matrixed organizations. She/he will be self directed and able to flawlessly execute on a broad spectrum of digital projects while partnering with multiple stakeholders globally. Responsibilities Identify and prioritize commercial needs and problems to solve via digital enhancements Plan and manage digital enhancements to expand customer reach and improve customer experience across channels Lead cross functional teams & workshops to initiate, align and track collaborative digital experience improvement efforts. Manage digital properties & platforms to deliver an excellent experience, driving revenue potential and brand relevance. Execute organic and paid search plans that will increase findability, conduct keyword research and manage process to optimize content for improved search effectiveness. Manage the DDN website pages and identify opportunities for navigation experience improvement and support strategic business growth goals. Conduct digital analysis to generate customer journey insights and identify opportunities for better customer experience & business growth. Make recommendations for technology and digital capabilities that will enable the business unit to deliver an optimized & personalized customer experience across channels. Background & Qualifications BA/BS – preferably advanced education and/or coursework At least 7 years’ experience in digital marketing Good understanding of B2B customer journey, with customer centric and commercial driven mindset Result oriented mindset, with ability and willingness to challenge the status quo Strong project management skills Excellent interpersonal, organizational and leadership skills Experience with the full marketing mix across paid, owned, and earned channels Proficient in mainstream digital platforms & tools, including but not limited to SEO/SEM (SEMrush, Google Ads), content publishing (AEM), analysis (Adobe/Google Analytics,), and proficient in MS Office. Strong analytics skills to drive insights & measure success Competencies SET: Strategy, Execution, Talent (for managers) Values: Integrity, Accountability, Teamwork, Innovation About Te Connectivity TE Connectivity is a global industrial technology leader creating a safer, sustainable, productive, and connected future. Our broad range of connectivity and sensor solutions enable the distribution of power, signal and data to advance next generation transportation, renewable energy, automated factories, data centers, medical technology and more. With more than 85,000 employees, including 8,000 engineers, working alongside customers in approximately 140 countries. TE ensures that EVERY CONNECTION COUNTS. Learn more at Compensation Competitive base salary commensurate with experience: $114,600 171,800 (subject to change dependent on physical location) Posted salary ranges are made in good faith. TE Connectivity reserves the right to adjust ranges depending on the experience/qualification of the selected candidate as well as internal and external equity. Total Compensation = Base Salary + Incentive(s) + Benefits Benefits A comprehensive benefits package including health insurance, 401(k), disability, life insurance, employee stock purchase plan, paid time off and voluntary benefits. EOE, Including Disability/Vets show less",
      "date_posted": null,
      "location": "Montgomery County, PA",
      "remote": "",
      "salary": "$114.6K/yr - $171.8K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4076135383/"
    },
    {
      "job_title": "Marketing Analyst",
      "company": "The Sage Group",
      "description": "The Sage Group’s client, an American delivery company based in San Francisco that operates a grocery delivery and pick up service, is looking for an experienced Marketing Analyst to contribute to the Retailer Marketing team’s performance and growth. About the team The Marketing Team is highly analytical, moves fast and is passionate about delivering results. The Marketing Analyst will be a vital addition to our Retailer Marketing team as we continue to partner with Business Development, Brand, Product, Product Marketing, Data Science, Analytics, and Performance Marketing. Together, we will work to find opportunities to help people understand what our client brings to the table and make our retailers successful on our client’s platform. In this role you will: Build marketing dashboards, including operating in company dashboard tools Write SQL queries to query data Manage budgeting process and data tables connected to spend pacing and performance Report in executive dashboards campaign and team performance across sales, ROI, and engagement metrics Be able to concisely summarize and deliver insights with limited guidance Manage data mapping tables to track performance across marketing channels, in partnership with internal data science and marketing analytics teams Partner with finance team to manage teams forecast locks and ongoing pacing updates Field adhoc marketing campaign analytics and dashboard requests for ongoing team needs Qualification: 3+ Years of experience in Marketing Analytics Experience building and maintaining data tables for marketing budget management Strong working knowledge of SQL and Google Sheets Adept at cross functional collaboration with strong communication skills Duration: 6 Months, likely to extend Location: Remote, USA Pay: $80 $90/hr DOE show less",
      "date_posted": null,
      "location": "United States",
      "remote": "Remote",
      "salary": "$80/hr - $90/hr",
      "job_url": "https://www.linkedin.com/jobs/view/4106263674/"
    },
    {
      "job_title": "Marketing Analyst - Private Investing",
      "company": "ProPivotal Staffing",
      "description": "Marketing Analyst Private Investing The Marketing Analyst is a key role on the Marketing team, focused on supporting private investing capabilities, strategies, and funds. This individual will work closely with internal teams such as product management, portfolio managers, legal & compliance, and client services to execute comprehensive marketing strategies. The position also requires close collaboration with the Marketing Strategist in the development and execution of overarching strategy and tactical plans. About the role: Competitive salary ranging from $120,000 to $160,000 annually Comprehensive benefits package Join a dynamic, growth focused marketing team Responsibilities: Lead the strategy and execution of events, including overseeing conference sponsorships and hosted events Manage all event logistics, such as registration, attendee tracking, materials, and presentations Oversee event budgets, negotiate contracts, and manage vendor relationships Regularly update internal teams on marketing activities, including press mentions, new content, and quarterly reports Collaborate with the marketing strategist to develop PR strategies that strengthen the brand’s public image Contribute to the creation and distribution of marketing materials Develop integrated marketing plans that include public relations, email campaigns, and event strategies Create compelling content and provide strategic marketing insights to engage diverse audiences Qualifications: 6 to 10 years of marketing experience within the private investing sector Strong background in event management, communications, branding, conference coordination, and fundraising Excellent content creation skills with a strategic marketing focus Proven ability to build strong relationships and influence key stakeholders across teams There are no costs for candidates utilizing our services as our clients pay for all related hiring fees. All ProPivotal job postings are either actual positions we had available at the time of posting and/or are representative of positions we typically fill or expect to fill. If you see a job that interests you, respond to the ad or give us a call so that we can help you find a job you'll love. As one of the area's largest staffing firms, we help 2,500 people find jobs a year so chances are good that we can help you too. ProPivotal is an equal opportunity employer and considers qualified applicants for employment regardless of race, gender, gender identity, gender expression, age, color, religion, disability, veteran's status, sexual orientation, or any other protected factor. show less",
      "date_posted": null,
      "location": "Boston, MA",
      "remote": "Onsite",
      "salary": "$120K/yr - $160K/yr",
      "job_url": "https://www.linkedin.com/jobs/view/4109325880/"
    }
  ]
}